[
  {
    "id": "persian",
    "slug": "persian",
    "name_en": "Persian",
    "name_el": "Περσική",
    "type": "cat",
    "origin": "Iran (Persia)",
    "originCode": "IR",
    "images": [],
    "size": "medium",
    "lifespan": "12-17 years",
    "temperament_en": ["Quiet", "Sweet", "Gentle", "Calm", "Affectionate"],
    "temperament_el": ["Ήσυχη", "Γλυκιά", "Ήπια", "Ήρεμη", "Στοργική"],
    "description_en": "The Persian cat is one of the oldest and most recognizable cat breeds in the world, known for their long, luxurious coats and distinctive flat faces. Originally from Persia (modern-day Iran), these elegant cats were brought to Europe in the 1600s and quickly became favorites of royalty and aristocrats. Persians are calm, gentle cats that prefer a serene environment and make excellent lap cats. They are not as active or playful as some breeds, preferring to lounge in comfortable spots and observe their surroundings with their large, expressive eyes. Their sweet, patient nature makes them wonderful companions.",
    "description_el": "Η Περσική γάτα είναι μία από τις παλαιότερες και πιο αναγνωρίσιμες ράτσες γάτας στον κόσμο, γνωστή για τα μακριά, πολυτελή τριχώματά της και τα χαρακτηριστικά επίπεδα πρόσωπα. Κατάγεται από την Περσία (σημερινό Ιράν), αυτές οι κομψές γάτες μεταφέρθηκαν στην Ευρώπη το 1600 και γρήγορα έγιναν αγαπημένες της βασιλείας και των αριστοκρατών. Οι Περσικές είναι ήρεμες, ήπιες γάτες που προτιμούν ένα γαλήνιο περιβάλλον και είναι εξαιρετικές γάτες αγκαλιάς. Δεν είναι τόσο δραστήριες ή παιχνιδιάρες όσο ορισμένες ράτσες, προτιμώντας να ξαπλώνουν σε άνετα σημεία και να παρατηρούν το περιβάλλον τους με τα μεγάλα, εκφραστικά μάτια τους. Η γλυκιά, υπομονετική φύση τους τις καθιστά υπέροχους συντρόφους.",
    "characteristics": { "energy": 2, "grooming": 5, "friendliness": 4, "trainability": 2, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Persian cats require daily grooming to prevent their long coat from matting and tangling. A thorough brushing session of 15-20 minutes each day is recommended, along with regular professional grooming. Their flat faces require daily cleaning to prevent tear staining and skin fold infections - gently wipe their face with a damp cloth. Persians are indoor cats and should not be allowed outside unsupervised. They prefer a calm, quiet environment and can become stressed in chaotic households. Regular eye cleaning is essential as their prominent eyes are prone to discharge.",
    "care_el": "Οι Περσικές γάτες απαιτούν καθημερινή περιποίηση για να αποφευχθεί το μπέρδεμα και οι κόμποι στο μακρύ τρίχωμά τους. Συνιστάται μια διεξοδική συνεδρία βουρτσίσματος 15-20 λεπτών κάθε μέρα, μαζί με τακτική επαγγελματική περιποίηση. Τα επίπεδα πρόσωπά τους απαιτούν καθημερινό καθαρισμό για να αποφευχθούν οι λεκέδες δακρύων και οι λοιμώξεις δερματικών πτυχών - καθαρίστε απαλά το πρόσωπό τους με ένα υγρό πανί. Οι Περσικές είναι γάτες εσωτερικού χώρου και δεν πρέπει να αφήνονται έξω χωρίς επίβλεψη. Προτιμούν ένα ήρεμο, ήσυχο περιβάλλον και μπορεί να αγχωθούν σε χαοτικά νοικοκυριά. Ο τακτικός καθαρισμός ματιών είναι απαραίτητος καθώς τα προεξέχοντα μάτια τους είναι επιρρεπή σε εκκρίσεις.",
    "health_en": "Persian cats are prone to several health conditions, many related to their brachycephalic (flat-faced) structure. Polycystic Kidney Disease (PKD) is a hereditary condition that affects many Persians - reputable breeders screen for this. Breathing difficulties and dental malocclusion can occur due to their facial structure. Eye problems including cherry eye, entropion, and excessive tearing are common. Persians may also develop hypertrophic cardiomyopathy and hip dysplasia. Their long coats can lead to hairballs if not properly maintained. Regular veterinary checkups and choosing a breeder who prioritizes health are essential.",
    "health_el": "Οι Περσικές γάτες είναι επιρρεπείς σε αρκετές υγειονομικές παθήσεις, πολλές σχετικές με τη βραχυκεφαλική τους (επίπεδο πρόσωπο) δομή. Η Πολυκυστική Νεφροπάθεια (PKD) είναι μια κληρονομική πάθηση που επηρεάζει πολλές Περσικές - οι αξιόπιστοι εκτροφείς ελέγχουν για αυτό. Αναπνευστικές δυσκολίες και οδοντική κακοσύμβαση μπορεί να εμφανιστούν λόγω της δομής του προσώπου τους. Προβλήματα ματιών συμπεριλαμβανομένου του κερασιού στο μάτι, του εντροπίου και της υπερβολικής δακρύρροιας είναι συχνά. Οι Περσικές μπορεί επίσης να αναπτύξουν υπερτροφική μυοκαρδιοπάθεια και δυσπλασία ισχίου. Τα μακριά τριχώματά τους μπορεί να οδηγήσουν σε τριχόσφαιρες αν δεν συντηρηθούν σωστά. Οι τακτικοί κτηνιατρικοί έλεγχοι και η επιλογή εκτροφέα που δίνει προτεραιότητα στην υγεία είναι απαραίτητα."
  },
  {
    "id": "maine-coon",
    "slug": "maine-coon",
    "name_en": "Maine Coon",
    "name_el": "Μέιν Κουν",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "12-15 years",
    "temperament_en": ["Gentle", "Friendly", "Intelligent", "Playful", "Social"],
    "temperament_el": ["Ήπια", "Φιλική", "Έξυπνη", "Παιχνιδιάρα", "Κοινωνική"],
    "description_en": "The Maine Coon is one of the largest domestic cat breeds, affectionately known as 'gentle giants' of the cat world. Native to the state of Maine in the United States, these magnificent cats are distinguished by their large size, tufted ears, bushy tails, and dog-like personalities. Males can weigh up to 18-25 pounds, while females typically reach 10-15 pounds. Maine Coons are remarkably intelligent and social cats that often follow their owners around the house and enjoy participating in family activities. They mature slowly, not reaching their full size until 3-5 years of age.",
    "description_el": "Η Μέιν Κουν είναι μία από τις μεγαλύτερες ράτσες οικόσιτων γατών, στοργικά γνωστές ως 'ήπιοι γίγαντες' του κόσμου των γατών. Κατάγεται από την πολιτεία Μέιν στις Ηνωμένες Πολιτείες, αυτές οι υπέροχες γάτες διακρίνονται από το μεγάλο μέγεθός τους, τα θυσανωτά αυτιά, τις φουντωτές ουρές και τις προσωπικότητες που μοιάζουν με σκύλου. Τα αρσενικά μπορεί να ζυγίσουν έως 8-11 κιλά, ενώ τα θηλυκά τυπικά φτάνουν τα 4,5-7 κιλά. Οι Μέιν Κουν είναι εξαιρετικά έξυπνες και κοινωνικές γάτες που συχνά ακολουθούν τους ιδιοκτήτες τους στο σπίτι και απολαμβάνουν να συμμετέχουν σε οικογενειακές δραστηριότητες. Ωριμάζουν αργά, μη φτάνοντας το πλήρες μέγεθός τους μέχρι τα 3-5 χρόνια.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Maine Coons require regular brushing 2-3 times per week to maintain their semi-long coat and prevent matting. Their coat is water-resistant and relatively easy to care for compared to other long-haired breeds. These cats need adequate space to move around due to their large size - tall cat trees and sturdy scratching posts are recommended. Maine Coons are active and playful, enjoying interactive toys and even learning to play fetch. Many enjoy water and may join you near sinks or bathtubs. They thrive with companionship and don't like being left alone for long periods.",
    "care_el": "Οι Μέιν Κουν απαιτούν τακτικό βούρτσισμα 2-3 φορές την εβδομάδα για να διατηρήσουν το ημι-μακρύ τρίχωμά τους και να αποφευχθούν οι κόμποι. Το τρίχωμά τους είναι αδιάβροχο και σχετικά εύκολο στη φροντίδα σε σύγκριση με άλλες μακρύτριχες ράτσες. Αυτές οι γάτες χρειάζονται επαρκή χώρο για να κινηθούν λόγω του μεγάλου μεγέθους τους - συνιστώνται ψηλά δέντρα γάτας και γερά ξυστρά. Οι Μέιν Κουν είναι δραστήριες και παιχνιδιάρες, απολαμβάνοντας διαδραστικά παιχνίδια και ακόμη μαθαίνοντας να παίζουν φέτσ. Πολλές απολαμβάνουν το νερό και μπορεί να σας συντροφεύσουν κοντά σε νεροχύτες ή μπανιέρες. Ευδοκιμούν με συντροφιά και δεν τους αρέσει να μένουν μόνες για μεγάλα χρονικά διαστήματα.",
    "health_en": "Maine Coons may be prone to hypertrophic cardiomyopathy (HCM), a heart condition that is the leading cause of heart disease in cats. Reputable breeders screen for this condition. Hip dysplasia can occur due to their large size. Spinal muscular atrophy (SMA) is a genetic condition that causes muscle weakness - genetic testing is available. Polycystic kidney disease (PKD) is occasionally seen. Despite these potential issues, Maine Coons are generally healthy cats with good lifespans. Regular cardiac screening and choosing a health-tested breeder help ensure a healthy pet.",
    "health_el": "Οι Μέιν Κουν μπορεί να είναι επιρρεπείς σε υπερτροφική μυοκαρδιοπάθεια (HCM), μια καρδιακή πάθηση που είναι η κύρια αιτία καρδιακής νόσου στις γάτες. Οι αξιόπιστοι εκτροφείς ελέγχουν για αυτή την πάθηση. Η δυσπλασία ισχίου μπορεί να εμφανιστεί λόγω του μεγάλου τους μεγέθους. Η νωτιαία μυϊκή ατροφία (SMA) είναι μια γενετική πάθηση που προκαλεί μυϊκή αδυναμία - υπάρχει διαθέσιμος γενετικός έλεγχος. Η πολυκυστική νεφροπάθεια (PKD) εμφανίζεται περιστασιακά. Παρά αυτά τα πιθανά προβλήματα, οι Μέιν Κουν είναι γενικά υγιείς γάτες με καλή διάρκεια ζωής. Ο τακτικός καρδιακός έλεγχος και η επιλογή εκτροφέα με ελεγμένη υγεία βοηθούν στην εξασφάλιση ενός υγιούς κατοικίδιου."
  },
  {
    "id": "siamese",
    "slug": "siamese",
    "name_en": "Siamese",
    "name_el": "Σιαμέζα",
    "type": "cat",
    "origin": "Thailand",
    "originCode": "TH",
    "images": [],
    "size": "medium",
    "lifespan": "12-20 years",
    "temperament_en": ["Vocal", "Affectionate", "Social", "Intelligent", "Active"],
    "temperament_el": ["Φωνακλού", "Στοργική", "Κοινωνική", "Έξυπνη", "Δραστήρια"],
    "description_en": "The Siamese cat is one of the most recognizable and ancient cat breeds, originating from Thailand (formerly Siam). These elegant cats are known for their striking blue almond-shaped eyes, color-pointed coats, and vocal personalities. Siamese cats are extremely social and form strong bonds with their owners - they are often described as 'dog-like' in their loyalty and companionship. They are highly intelligent and communicative, using their distinctive voice to express their opinions on everything. Siamese cats thrive on interaction and don't do well when left alone for long periods.",
    "description_el": "Η Σιαμέζα γάτα είναι μία από τις πιο αναγνωρίσιμες και αρχαίες ράτσες γατών, που κατάγεται από την Ταϊλάνδη (πρώην Σιάμ). Αυτές οι κομψές γάτες είναι γνωστές για τα εντυπωσιακά μπλε αμυγδαλωτά μάτια τους, τα τριχώματα με χρωματιστές άκρες και τις φωνητικές προσωπικότητες. Οι Σιαμέζες γάτες είναι εξαιρετικά κοινωνικές και δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες τους - συχνά περιγράφονται ως 'σαν σκύλος' στην αφοσίωση και τη συντροφιά τους. Είναι εξαιρετικά έξυπνες και επικοινωνιακές, χρησιμοποιώντας τη χαρακτηριστική τους φωνή για να εκφράσουν τις απόψεις τους για τα πάντα. Οι Σιαμέζες γάτες ευδοκιμούν με την αλληλεπίδραση και δεν τα πάνε καλά όταν αφήνονται μόνες για μεγάλες περιόδους.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 5, "trainability": 5, "cost_index": 2 },
    "cost_annual_usd": "$600-900",
    "care_en": "Siamese cats have minimal grooming needs thanks to their short, fine coat - weekly brushing is usually sufficient. However, they have high social needs and require lots of attention and interaction. They don't tolerate being alone well and may develop separation anxiety or behavioral issues if left for long periods. Providing puzzle toys, interactive play sessions, and even considering a feline companion can help meet their social needs. Siamese cats are active and need opportunities for play and exercise. Their intelligence makes them receptive to training and they enjoy learning tricks.",
    "care_el": "Οι Σιαμέζες γάτες έχουν ελάχιστες ανάγκες περιποίησης χάρη στο κοντό, λεπτό τρίχωμά τους - το εβδομαδιαίο βούρτσισμα είναι συνήθως αρκετό. Ωστόσο, έχουν υψηλές κοινωνικές ανάγκες και απαιτούν πολλή προσοχή και αλληλεπίδραση. Δεν ανέχονται καλά τη μοναξιά και μπορεί να αναπτύξουν άγχος αποχωρισμού ή προβλήματα συμπεριφοράς αν αφήνονται για μεγάλες περιόδους. Η παροχή παιχνιδιών παζλ, διαδραστικών συνεδριών παιχνιδιού, και ακόμη η εξέταση ενός γατίστικου συντρόφου μπορεί να βοηθήσει στην κάλυψη των κοινωνικών τους αναγκών. Οι Σιαμέζες γάτες είναι δραστήριες και χρειάζονται ευκαιρίες για παιχνίδι και άσκηση. Η νοημοσύνη τους τις καθιστά δεκτικές στην εκπαίδευση και απολαμβάνουν να μαθαίνουν κόλπα.",
    "health_en": "Siamese cats may be prone to several health conditions. Respiratory issues including asthma and bronchial disease are more common in this breed. Progressive retinal atrophy (PRA) can lead to vision loss. Amyloidosis, particularly liver amyloidosis, affects some Siamese cats. They may also develop certain heart conditions and some lines are prone to crossed eyes and kinked tails (though these are now largely bred out). Dental disease can be a concern. Despite these potential issues, Siamese cats often live long lives, frequently reaching 15-20 years with proper care.",
    "health_el": "Οι Σιαμέζες γάτες μπορεί να είναι επιρρεπείς σε αρκετές υγειονομικές παθήσεις. Αναπνευστικά προβλήματα συμπεριλαμβανομένου του άσθματος και της βρογχικής νόσου είναι πιο συχνά σε αυτή τη ράτσα. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) μπορεί να οδηγήσει σε απώλεια όρασης. Η αμυλοείδωση, ιδιαίτερα η ηπατική αμυλοείδωση, επηρεάζει ορισμένες Σιαμέζες γάτες. Μπορεί επίσης να αναπτύξουν ορισμένες καρδιακές παθήσεις και ορισμένες σειρές είναι επιρρεπείς σε αλλήθωρα και τσακισμένες ουρές (αν και αυτά έχουν πλέον σε μεγάλο βαθμό εκτραφεί εκτός). Η οδοντική νόσος μπορεί να είναι ανησυχία. Παρά αυτά τα πιθανά προβλήματα, οι Σιαμέζες γάτες συχνά ζουν μακροχρόνιες ζωές, φτάνοντας συχνά τα 15-20 χρόνια με σωστή φροντίδα."
  },
  {
    "id": "ragdoll",
    "slug": "ragdoll",
    "name_en": "Ragdoll",
    "name_el": "Ράγκντολ",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "12-17 years",
    "temperament_en": ["Docile", "Calm", "Affectionate", "Gentle", "Relaxed"],
    "temperament_el": ["Πειθήνια", "Ήρεμη", "Στοργική", "Ήπια", "Χαλαρή"],
    "description_en": "The Ragdoll is a large, gentle cat breed known for its tendency to go limp and relaxed when picked up - hence the name. Developed in California in the 1960s by breeder Ann Baker, Ragdolls are characterized by their striking blue eyes, semi-long silky coat, and color-pointed pattern. They are one of the largest domestic cat breeds, with males often weighing 15-20 pounds. Ragdolls are extremely docile and affectionate, often following their owners from room to room. They are sometimes called 'puppy cats' because of their loyal, dog-like devotion to their families.",
    "description_el": "Η Ράγκντολ είναι μια μεγάλη, ήπια ράτσα γάτας γνωστή για την τάση της να χαλαρώνει και να γίνεται πλαδαρή όταν την σηκώνουν - εξ ου και το όνομα. Αναπτύχθηκε στην Καλιφόρνια τη δεκαετία του 1960 από την εκτροφέα Ann Baker, οι Ράγκντολ χαρακτηρίζονται από τα εντυπωσιακά μπλε μάτια τους, το ημι-μακρύ μεταξένιο τρίχωμα και το σχέδιο με χρωματιστές άκρες. Είναι μία από τις μεγαλύτερες ράτσες οικόσιτων γατών, με τα αρσενικά να ζυγίζουν συχνά 7-9 κιλά. Οι Ράγκντολ είναι εξαιρετικά πειθήνιες και στοργικές, συχνά ακολουθώντας τους ιδιοκτήτες τους από δωμάτιο σε δωμάτιο. Μερικές φορές ονομάζονται 'γάτες κουτάβια' λόγω της πιστής, σαν σκύλου αφοσίωσής τους στις οικογένειές τους.",
    "characteristics": { "energy": 2, "grooming": 3, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Ragdolls have a semi-long coat that is less prone to matting than Persian or Himalayan coats, but still requires regular grooming - brushing 2-3 times per week is recommended. They are indoor cats and should not be allowed outside unsupervised due to their trusting, non-defensive nature. Ragdolls are not as active as some breeds but still enjoy interactive play and should have access to toys and climbing structures. They are very social and prefer not to be left alone for long periods. Their gentle nature makes them excellent choices for families with children or other pets.",
    "care_el": "Οι Ράγκντολ έχουν ημι-μακρύ τρίχωμα που είναι λιγότερο επιρρεπές σε κόμπους από τα τριχώματα Περσικής ή Ιμαλαΐων, αλλά εξακολουθεί να απαιτεί τακτική περιποίηση - συνιστάται βούρτσισμα 2-3 φορές την εβδομάδα. Είναι γάτες εσωτερικού χώρου και δεν πρέπει να αφήνονται έξω χωρίς επίβλεψη λόγω της εμπιστευτικής, μη αμυντικής φύσης τους. Οι Ράγκντολ δεν είναι τόσο δραστήριες όσο ορισμένες ράτσες αλλά εξακολουθούν να απολαμβάνουν το διαδραστικό παιχνίδι και πρέπει να έχουν πρόσβαση σε παιχνίδια και δομές αναρρίχησης. Είναι πολύ κοινωνικές και προτιμούν να μην αφήνονται μόνες για μεγάλες περιόδους. Η ήπια φύση τους τις καθιστά εξαιρετικές επιλογές για οικογένειες με παιδιά ή άλλα κατοικίδια.",
    "health_en": "Ragdolls may be prone to hypertrophic cardiomyopathy (HCM), a heart condition that reputable breeders screen for. Polycystic kidney disease (PKD) can also occur. Bladder stones are sometimes seen in the breed. Their docile nature means they are trusting and may not recognize dangers, making outdoor access risky. Some Ragdolls may develop feline infectious peritonitis (FIP). Regular cardiac screening is recommended. Despite these potential concerns, Ragdolls are generally healthy cats with good lifespans when obtained from responsible breeders who test for hereditary conditions.",
    "health_el": "Οι Ράγκντολ μπορεί να είναι επιρρεπείς σε υπερτροφική μυοκαρδιοπάθεια (HCM), μια καρδιακή πάθηση για την οποία οι αξιόπιστοι εκτροφείς κάνουν έλεγχο. Η πολυκυστική νεφροπάθεια (PKD) μπορεί επίσης να εμφανιστεί. Πέτρες στην ουροδόχο κύστη εμφανίζονται μερικές φορές στη ράτσα. Η πειθήνια φύση τους σημαίνει ότι είναι εμπιστευτικές και μπορεί να μην αναγνωρίζουν τους κινδύνους, καθιστώντας την πρόσβαση σε εξωτερικούς χώρους επικίνδυνη. Ορισμένες Ράγκντολ μπορεί να αναπτύξουν λοιμώδη περιτονίτιδα γατών (FIP). Συνιστάται τακτικός καρδιακός έλεγχος. Παρά αυτές τις πιθανές ανησυχίες, οι Ράγκντολ είναι γενικά υγιείς γάτες με καλή διάρκεια ζωής όταν αποκτούνται από υπεύθυνους εκτροφείς που ελέγχουν για κληρονομικές παθήσεις."
  },
  {
    "id": "british-shorthair",
    "slug": "british-shorthair",
    "name_en": "British Shorthair",
    "name_el": "Βρετανική Κοντότριχη",
    "type": "cat",
    "origin": "United Kingdom",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "12-20 years",
    "temperament_en": ["Calm", "Easygoing", "Loyal", "Quiet", "Independent"],
    "temperament_el": ["Ήρεμη", "Χαλαρή", "Πιστή", "Ήσυχη", "Ανεξάρτητη"],
    "description_en": "The British Shorthair is one of the oldest English cat breeds, believed to have been brought to Britain by the Romans nearly 2,000 years ago. These sturdy, round cats are known for their dense, plush coats (most famously in 'British Blue' gray), round faces, and copper or gold eyes. British Shorthairs are calm, easygoing companions that are not overly demanding of attention. They are affectionate on their own terms, enjoying companionship without being clingy or needy. Their teddy bear appearance and dignified demeanor have made them extremely popular worldwide.",
    "description_el": "Η Βρετανική Κοντότριχη είναι μία από τις παλαιότερες αγγλικές ράτσες γατών, που πιστεύεται ότι μεταφέρθηκε στη Βρετανία από τους Ρωμαίους σχεδόν 2.000 χρόνια πριν. Αυτές οι εύρωστες, στρογγυλές γάτες είναι γνωστές για τα πυκνά, βελούδινα τριχώματά τους (πιο διάσημα σε 'Βρετανικό Μπλε' γκρι), τα στρογγυλά πρόσωπα και τα χάλκινα ή χρυσά μάτια. Οι Βρετανικές Κοντότριχες είναι ήρεμοι, χαλαροί σύντροφοι που δεν απαιτούν υπερβολική προσοχή. Είναι στοργικές με τους δικούς τους όρους, απολαμβάνοντας τη συντροφιά χωρίς να είναι κολλώδεις ή απαιτητικές. Η εμφάνισή τους που μοιάζει με αρκουδάκι και η αξιοπρεπής συμπεριφορά τους τις έχουν κάνει εξαιρετικά δημοφιλείς παγκοσμίως.",
    "characteristics": { "energy": 2, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$600-900",
    "care_en": "British Shorthairs are relatively low-maintenance cats. Their dense coat benefits from weekly brushing to remove loose hair and distribute natural oils. They are not as active as some breeds and can be prone to obesity, so portion control and encouraging play are important. They prefer to stay on the ground rather than climbing to high places. British Shorthairs are independent and handle time alone better than some breeds, but still enjoy companionship. They don't typically like being picked up and prefer to sit beside you rather than on your lap.",
    "care_el": "Οι Βρετανικές Κοντότριχες είναι σχετικά εύκολες στη συντήρηση γάτες. Το πυκνό τρίχωμά τους επωφελείται από εβδομαδιαίο βούρτσισμα για να αφαιρεθεί το χαλαρό τρίχωμα και να κατανεμηθούν τα φυσικά έλαια. Δεν είναι τόσο δραστήριες όσο ορισμένες ράτσες και μπορεί να είναι επιρρεπείς στην παχυσαρκία, επομένως ο έλεγχος μερίδων και η ενθάρρυνση του παιχνιδιού είναι σημαντικά. Προτιμούν να μένουν στο έδαφος αντί να σκαρφαλώνουν σε ψηλά μέρη. Οι Βρετανικές Κοντότριχες είναι ανεξάρτητες και διαχειρίζονται τον χρόνο μόνες τους καλύτερα από ορισμένες ράτσες, αλλά εξακολουθούν να απολαμβάνουν τη συντροφιά. Συνήθως δεν τους αρέσει να τις σηκώνουν και προτιμούν να κάθονται δίπλα σας αντί στην αγκαλιά σας.",
    "health_en": "British Shorthairs may be prone to hypertrophic cardiomyopathy (HCM), a common heart condition in cats. Reputable breeders screen for this condition. Polycystic kidney disease (PKD) can also occur. Obesity is a significant concern due to their sedentary nature - maintaining a healthy weight is essential for preventing joint problems and diabetes. Hemophilia B has been identified in some lines. Dental disease may develop without proper care. Despite these potential issues, British Shorthairs are generally robust cats with long lifespans, often living well into their late teens.",
    "health_el": "Οι Βρετανικές Κοντότριχες μπορεί να είναι επιρρεπείς σε υπερτροφική μυοκαρδιοπάθεια (HCM), μια συχνή καρδιακή πάθηση στις γάτες. Οι αξιόπιστοι εκτροφείς ελέγχουν για αυτή την πάθηση. Η πολυκυστική νεφροπάθεια (PKD) μπορεί επίσης να εμφανιστεί. Η παχυσαρκία είναι σημαντική ανησυχία λόγω της καθιστικής τους φύσης - η διατήρηση υγιούς βάρους είναι απαραίτητη για την πρόληψη προβλημάτων αρθρώσεων και διαβήτη. Η αιμορροφιλία Β έχει αναγνωριστεί σε ορισμένες σειρές. Η οδοντική νόσος μπορεί να αναπτυχθεί χωρίς σωστή φροντίδα. Παρά αυτά τα πιθανά προβλήματα, οι Βρετανικές Κοντότριχες είναι γενικά εύρωστες γάτες με μακρά διάρκεια ζωής, συχνά ζώντας καλά μέχρι τα τέλη της δεύτερης δεκαετίας τους."
  },
  {
    "id": "bengal",
    "slug": "bengal",
    "name_en": "Bengal",
    "name_el": "Βεγγάλη",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-16 years",
    "temperament_en": ["Energetic", "Intelligent", "Playful", "Curious", "Athletic"],
    "temperament_el": ["Ενεργητική", "Έξυπνη", "Παιχνιδιάρα", "Περίεργη", "Αθλητική"],
    "description_en": "The Bengal is a stunning domestic cat breed developed by crossing domestic cats with the Asian leopard cat, creating their distinctive wild appearance. Bengals are known for their beautiful spotted or marbled coat patterns that resemble wild cats like leopards and ocelots. Their coat often has a unique 'glitter' effect that sparkles in the light. Beyond their exotic looks, Bengals are highly active, intelligent, and playful cats that require significant mental and physical stimulation. They form strong bonds with their families and are often described as having dog-like personalities.",
    "description_el": "Η Βεγγάλη είναι μια εντυπωσιακή ράτσα οικόσιτης γάτας που αναπτύχθηκε από τη διασταύρωση οικόσιτων γατών με την ασιατική γάτα λεοπάρδαλη, δημιουργώντας τη χαρακτηριστική άγρια εμφάνισή τους. Οι Βεγγάλες είναι γνωστές για τα όμορφα στικτά ή μαρμάρινα σχέδια τριχώματος που μοιάζουν με άγριες γάτες όπως λεοπαρδάλεις και οσελότ. Το τρίχωμά τους συχνά έχει ένα μοναδικό εφέ 'γκλίτερ' που λάμπει στο φως. Πέρα από την εξωτική εμφάνισή τους, οι Βεγγάλες είναι εξαιρετικά δραστήριες, έξυπνες και παιχνιδιάρες γάτες που απαιτούν σημαντική νοητική και σωματική διέγερση. Δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους και συχνά περιγράφονται ότι έχουν προσωπικότητες που μοιάζουν με σκύλου.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 5, "cost_index": 5 },
    "cost_annual_usd": "$1,800-2,500+",
    "care_en": "Bengals are extremely active cats that require extensive play and mental stimulation. They love climbing, so tall cat trees, shelves, and climbing structures are essential. Interactive toys, puzzle feeders, and play sessions are necessary to keep them engaged. Many Bengals enjoy water and may join you in the shower or play in water dishes. A cat wheel can help burn off excess energy. Without adequate stimulation, Bengals can become destructive or develop behavioral issues. They are not ideal for quiet households or owners who are away frequently.",
    "care_el": "Οι Βεγγάλες είναι εξαιρετικά δραστήριες γάτες που απαιτούν εκτεταμένο παιχνίδι και νοητική διέγερση. Λατρεύουν να σκαρφαλώνουν, οπότε ψηλά δέντρα γάτας, ράφια και δομές αναρρίχησης είναι απαραίτητα. Διαδραστικά παιχνίδια, ταΐστρες παζλ και συνεδρίες παιχνιδιού είναι απαραίτητα για να τις κρατήσετε απασχολημένες. Πολλές Βεγγάλες απολαμβάνουν το νερό και μπορεί να σας συντροφεύσουν στο ντους ή να παίξουν σε πιάτα νερού. Ένας τροχός γάτας μπορεί να βοηθήσει στην κατανάλωση της περίσσειας ενέργειας. Χωρίς επαρκή διέγερση, οι Βεγγάλες μπορεί να γίνουν καταστροφικές ή να αναπτύξουν προβλήματα συμπεριφοράς. Δεν είναι ιδανικές για ήσυχα νοικοκυριά ή ιδιοκτήτες που λείπουν συχνά.",
    "health_en": "Bengals may be prone to several health conditions. Progressive retinal atrophy (PRA) can cause vision loss - reputable breeders test for the Bengal PRA gene. Hypertrophic cardiomyopathy (HCM) affects some Bengals, and cardiac screening is recommended. Pyruvate kinase deficiency (PK Def), a blood disorder, can be tested for genetically. Some Bengals may be sensitive to certain anesthetics. Patellar luxation occasionally occurs. When obtained from responsible breeders who perform genetic testing, Bengals are generally healthy cats with good lifespans.",
    "health_el": "Οι Βεγγάλες μπορεί να είναι επιρρεπείς σε αρκετές υγειονομικές παθήσεις. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) μπορεί να προκαλέσει απώλεια όρασης - οι αξιόπιστοι εκτροφείς ελέγχουν για το γονίδιο PRA Βεγγάλης. Η υπερτροφική μυοκαρδιοπάθεια (HCM) επηρεάζει ορισμένες Βεγγάλες και συνιστάται καρδιακός έλεγχος. Η ανεπάρκεια πυροσταφυλικής κινάσης (PK Def), μια διαταραχή του αίματος, μπορεί να ελεγχθεί γενετικά. Ορισμένες Βεγγάλες μπορεί να είναι ευαίσθητες σε ορισμένα αναισθητικά. Η εξάρθρωση επιγονατίδας εμφανίζεται περιστασιακά. Όταν αποκτούνται από υπεύθυνους εκτροφείς που εκτελούν γενετικό έλεγχο, οι Βεγγάλες είναι γενικά υγιείς γάτες με καλή διάρκεια ζωής."
  },
  {
    "id": "russian-blue",
    "slug": "russian-blue",
    "name_en": "Russian Blue",
    "name_el": "Ρωσική Μπλε",
    "type": "cat",
    "origin": "Russia",
    "originCode": "RU",
    "images": [],
    "size": "medium",
    "lifespan": "15-20 years",
    "temperament_en": ["Gentle", "Quiet", "Shy", "Loyal", "Intelligent"],
    "temperament_el": ["Ήπια", "Ήσυχη", "Ντροπαλή", "Πιστή", "Έξυπνη"],
    "description_en": "The Russian Blue is an elegant cat breed known for their distinctive blue-gray coat and bright green eyes. Believed to have originated from the Russian port city of Archangelsk, these cats were favorites of Russian czars and were brought to Europe in the 1860s. Russian Blues have a unique double coat that stands out from their body, giving them a plush appearance. They are gentle, quiet cats that form deep bonds with their chosen people while remaining reserved around strangers. Their intelligence and sensitivity make them excellent companions for calm households.",
    "description_el": "Η Ρωσική Μπλε είναι μια κομψή ράτσα γάτας γνωστή για το χαρακτηριστικό μπλε-γκρι τρίχωμά της και τα λαμπερά πράσινα μάτια. Πιστεύεται ότι κατάγεται από τη ρωσική λιμενική πόλη Αρχάγγελσκ, αυτές οι γάτες ήταν αγαπημένες των Ρώσων τσάρων και μεταφέρθηκαν στην Ευρώπη τη δεκαετία του 1860. Οι Ρωσικές Μπλε έχουν ένα μοναδικό διπλό τρίχωμα που ξεχωρίζει από το σώμα τους, δίνοντάς τους μια βελούδινη εμφάνιση. Είναι ήπιες, ήσυχες γάτες που δημιουργούν βαθιούς δεσμούς με τους εκλεκτούς τους ανθρώπους ενώ παραμένουν επιφυλακτικές απέναντι σε ξένους. Η νοημοσύνη και η ευαισθησία τους τις καθιστούν εξαιρετικούς συντρόφους για ήρεμα νοικοκυριά.",
    "characteristics": { "energy": 3, "grooming": 1, "friendliness": 3, "trainability": 4, "cost_index": 1 },
    "cost_annual_usd": "$400-600",
    "care_en": "Russian Blues have minimal grooming needs - their short, dense coat requires only occasional brushing. They are sensitive to changes in routine and prefer a consistent, calm environment. They may be shy with strangers initially but are devoted to family members. Russian Blues are intelligent and enjoy puzzle toys and interactive play. They are known for being creatures of habit who appreciate regular meal times and play schedules. They can tolerate some time alone better than more social breeds but still need daily interaction and companionship.",
    "care_el": "Οι Ρωσικές Μπλε έχουν ελάχιστες ανάγκες περιποίησης - το κοντό, πυκνό τρίχωμά τους απαιτεί μόνο περιστασιακό βούρτσισμα. Είναι ευαίσθητες στις αλλαγές ρουτίνας και προτιμούν ένα σταθερό, ήρεμο περιβάλλον. Μπορεί να είναι ντροπαλές με ξένους αρχικά αλλά είναι αφοσιωμένες στα μέλη της οικογένειας. Οι Ρωσικές Μπλε είναι έξυπνες και απολαμβάνουν παιχνίδια παζλ και διαδραστικό παιχνίδι. Είναι γνωστές ως πλάσματα της συνήθειας που εκτιμούν τους τακτικούς χρόνους γεύματος και τα προγράμματα παιχνιδιού. Μπορούν να ανεχτούν κάποιο χρόνο μόνες τους καλύτερα από πιο κοινωνικές ράτσες αλλά εξακολουθούν να χρειάζονται καθημερινή αλληλεπίδραση και συντροφιά.",
    "health_en": "Russian Blues are generally one of the healthiest cat breeds with few breed-specific health concerns. They may be prone to obesity, so portion control and regular play are important. Bladder stones can occasionally occur. Some may develop progressive retinal atrophy. Dental disease may develop without proper care. Their long lifespan (often 15-20 years) speaks to their overall health and hardiness. When obtained from responsible breeders and given proper care, Russian Blues typically enjoy long, healthy lives with few major health issues.",
    "health_el": "Οι Ρωσικές Μπλε είναι γενικά μία από τις πιο υγιείς ράτσες γατών με λίγα ειδικά για τη ράτσα προβλήματα υγείας. Μπορεί να είναι επιρρεπείς στην παχυσαρκία, οπότε ο έλεγχος μερίδων και το τακτικό παιχνίδι είναι σημαντικά. Πέτρες στην ουροδόχο κύστη μπορεί να εμφανιστούν περιστασιακά. Ορισμένες μπορεί να αναπτύξουν προοδευτική ατροφία αμφιβληστροειδούς. Η οδοντική νόσος μπορεί να αναπτυχθεί χωρίς σωστή φροντίδα. Η μακρά διάρκεια ζωής τους (συχνά 15-20 χρόνια) μιλά για τη συνολική υγεία και αντοχή τους. Όταν αποκτούνται από υπεύθυνους εκτροφείς και δέχονται σωστή φροντίδα, οι Ρωσικές Μπλε τυπικά απολαμβάνουν μακρές, υγιείς ζωές με λίγα σημαντικά προβλήματα υγείας."
  },
  {
    "id": "sphynx",
    "slug": "sphynx",
    "name_en": "Sphynx",
    "name_el": "Σφίγγα",
    "type": "cat",
    "origin": "Canada",
    "originCode": "CA",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Friendly", "Energetic", "Affectionate", "Curious", "Extroverted"],
    "temperament_el": ["Φιλική", "Ενεργητική", "Στοργική", "Περίεργη", "Εξωστρεφής"],
    "description_en": "The Sphynx is instantly recognizable as the 'hairless' cat, though they actually have a fine layer of peach-fuzz down that gives their skin a suede-like texture. Originating from a natural genetic mutation in Canada in the 1960s, Sphynx cats are warm to the touch (often described as feeling like a warm suede hot water bottle) and extremely affectionate. They seek out body contact for warmth and companionship, often snuggling under blankets with their owners. Despite their somewhat alien appearance, Sphynx cats are known for being friendly, energetic, and clownish in their behavior.",
    "description_el": "Η Σφίγγα είναι άμεσα αναγνωρίσιμη ως η 'άτριχη' γάτα, αν και στην πραγματικότητα έχει ένα λεπτό στρώμα χνουδιού που δίνει στο δέρμα της μια υφή σαν σουέτ. Κατάγεται από μια φυσική γενετική μετάλλαξη στον Καναδά τη δεκαετία του 1960, οι γάτες Σφίγγα είναι ζεστές στην αφή (συχνά περιγράφονται ότι νιώθουν σαν ένα ζεστό σουέτ θερμοφόρα) και εξαιρετικά στοργικές. Αναζητούν τη σωματική επαφή για ζεστασιά και συντροφιά, συχνά χουχουλιάζοντας κάτω από κουβέρτες με τους ιδιοκτήτες τους. Παρά την κάπως εξωγήινη εμφάνισή τους, οι γάτες Σφίγγα είναι γνωστές για το ότι είναι φιλικές, ενεργητικές και κλόουν στη συμπεριφορά τους.",
    "characteristics": { "energy": 5, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Despite lacking fur, Sphynx cats require significant grooming care. Their skin produces oils that would normally be absorbed by fur, so they need weekly baths to remove oil buildup. Their ears produce more wax than most cats and require regular cleaning. They need protection from sun exposure (sunburn is a real risk) and cold temperatures (sweaters may be necessary in cool weather). Sphynx cats are indoor-only due to their lack of fur protection. They have high metabolisms and may need more food than similarly sized cats. Their skin folds require attention to prevent infections.",
    "care_el": "Παρά την έλλειψη τριχώματος, οι γάτες Σφίγγα απαιτούν σημαντική φροντίδα περιποίησης. Το δέρμα τους παράγει λάδια που κανονικά θα απορροφούνταν από το τρίχωμα, οπότε χρειάζονται εβδομαδιαία μπάνια για να αφαιρεθεί η συσσώρευση λαδιού. Τα αυτιά τους παράγουν περισσότερο κερί από τις περισσότερες γάτες και απαιτούν τακτικό καθαρισμό. Χρειάζονται προστασία από την έκθεση στον ήλιο (το ηλιακό έγκαυμα είναι πραγματικός κίνδυνος) και τις κρύες θερμοκρασίες (πουλόβερ μπορεί να είναι απαραίτητα σε κρύο καιρό). Οι γάτες Σφίγγα είναι αποκλειστικά εσωτερικού χώρου λόγω της έλλειψης προστασίας τριχώματος. Έχουν υψηλούς μεταβολισμούς και μπορεί να χρειάζονται περισσότερο φαγητό από γάτες παρόμοιου μεγέθους. Οι πτυχές του δέρματός τους απαιτούν προσοχή για να αποφευχθούν λοιμώξεις.",
    "health_en": "Sphynx cats may be prone to hypertrophic cardiomyopathy (HCM), which is the most common concern in the breed. Regular cardiac screening is recommended. Their lack of fur makes them susceptible to skin conditions including urticaria pigmentosa and oil seborrhea. They can develop respiratory infections if exposed to cold. Dental disease may occur without proper care. Some Sphynx cats have sensitive digestive systems. Sun exposure can cause skin damage and even skin cancer. Despite these considerations, well-cared-for Sphynx cats can live healthy lives of 12-15 years.",
    "health_el": "Οι γάτες Σφίγγα μπορεί να είναι επιρρεπείς σε υπερτροφική μυοκαρδιοπάθεια (HCM), που είναι η πιο συχνή ανησυχία στη ράτσα. Συνιστάται τακτικός καρδιακός έλεγχος. Η έλλειψη τριχώματος τις καθιστά επιρρεπείς σε δερματικές παθήσεις συμπεριλαμβανομένης της χρωστικής κνίδωσης και της λιπαρής σμηγματόρροιας. Μπορεί να αναπτύξουν αναπνευστικές λοιμώξεις αν εκτεθούν στο κρύο. Η οδοντική νόσος μπορεί να εμφανιστεί χωρίς σωστή φροντίδα. Ορισμένες γάτες Σφίγγα έχουν ευαίσθητα πεπτικά συστήματα. Η έκθεση στον ήλιο μπορεί να προκαλέσει δερματική βλάβη και ακόμη καρκίνο του δέρματος. Παρά αυτές τις εκτιμήσεις, οι καλά φροντισμένες γάτες Σφίγγα μπορούν να ζήσουν υγιείς ζωές 12-15 ετών."
  },
  {
    "id": "scottish-fold",
    "slug": "scottish-fold",
    "name_en": "Scottish Fold",
    "name_el": "Σκωτσέζικη Φολντ",
    "type": "cat",
    "origin": "Scotland",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "11-14 years",
    "temperament_en": ["Sweet", "Adaptable", "Loyal", "Quiet", "Affectionate"],
    "temperament_el": ["Γλυκιά", "Προσαρμοστική", "Πιστή", "Ήσυχη", "Στοργική"],
    "description_en": "The Scottish Fold is instantly recognizable by their unique folded ears that give them an owl-like appearance. The breed originated in Scotland in 1961 when a shepherd noticed a barn cat named Susie with unusual folded ears. Scottish Folds are sweet-tempered, adaptable cats that form strong bonds with their families. They are known for sitting in unusual positions, including the 'Buddha sit' with their legs stretched out. While quiet and gentle, they enjoy interactive play and companionship. Not all Scottish Folds have folded ears - about 50% have straight ears.",
    "description_el": "Η Σκωτσέζικη Φολντ είναι άμεσα αναγνωρίσιμη από τα μοναδικά διπλωμένα αυτιά της που της δίνουν μια εμφάνιση σαν κουκουβάγια. Η ράτσα ξεκίνησε στη Σκωτία το 1961 όταν ένας βοσκός παρατήρησε μια γάτα αχυρώνα ονόματι Susie με ασυνήθιστα διπλωμένα αυτιά. Οι Σκωτσέζικες Φολντ είναι γλυκόχαρες, προσαρμοστικές γάτες που δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους. Είναι γνωστές για το ότι κάθονται σε ασυνήθιστες θέσεις, συμπεριλαμβανομένου του 'καθίσματος Βούδα' με τα πόδια τους τεντωμένα. Ενώ είναι ήσυχες και ήπιες, απολαμβάνουν το διαδραστικό παιχνίδι και τη συντροφιά. Δεν έχουν όλες οι Σκωτσέζικες Φολντ διπλωμένα αυτιά - περίπου το 50% έχουν ίσια αυτιά.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 5, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Scottish Folds require regular ear cleaning to prevent wax buildup and infections, as their folded ears don't allow for normal air circulation. Brushing 2-3 times per week is sufficient for most coat types. Due to the cartilage condition that causes their folded ears, Scottish Folds may develop joint problems - monitor their mobility and watch for signs of stiffness or pain. They adapt well to various living situations and are generally easygoing. Interactive play helps keep them mentally and physically healthy. They are social cats that enjoy companionship.",
    "care_el": "Οι Σκωτσέζικες Φολντ απαιτούν τακτικό καθαρισμό αυτιών για να αποφευχθεί η συσσώρευση κεριού και οι λοιμώξεις, καθώς τα διπλωμένα αυτιά τους δεν επιτρέπουν κανονική κυκλοφορία αέρα. Βούρτσισμα 2-3 φορές την εβδομάδα είναι αρκετό για τους περισσότερους τύπους τριχώματος. Λόγω της πάθησης του χόνδρου που προκαλεί τα διπλωμένα αυτιά τους, οι Σκωτσέζικες Φολντ μπορεί να αναπτύξουν προβλήματα αρθρώσεων - παρακολουθήστε την κινητικότητά τους και προσέξτε για σημάδια δυσκαμψίας ή πόνου. Προσαρμόζονται καλά σε διάφορες συνθήκες διαβίωσης και είναι γενικά χαλαρές. Το διαδραστικό παιχνίδι βοηθά να τις κρατήσει νοητικά και σωματικά υγιείς. Είναι κοινωνικές γάτες που απολαμβάνουν τη συντροφιά.",
    "health_en": "Scottish Folds carry a genetic mutation that affects cartilage throughout their body, not just their ears. Osteochondrodysplasia is a serious condition that can cause painful arthritis and skeletal abnormalities - this is why fold-to-fold breeding is unethical and banned in some countries. All Scottish Folds should be monitored for joint problems. Other concerns include hypertrophic cardiomyopathy and polycystic kidney disease. Ethical breeding (fold to straight ear) reduces but doesn't eliminate the risk of joint issues. Regular veterinary care is essential for early detection of problems.",
    "health_el": "Οι Σκωτσέζικες Φολντ φέρουν μια γενετική μετάλλαξη που επηρεάζει τον χόνδρο σε όλο το σώμα τους, όχι μόνο στα αυτιά τους. Η οστεοχονδροδυσπλασία είναι μια σοβαρή πάθηση που μπορεί να προκαλέσει επώδυνη αρθρίτιδα και σκελετικές ανωμαλίες - γι' αυτό η εκτροφή fold με fold είναι ανήθικη και απαγορευμένη σε ορισμένες χώρες. Όλες οι Σκωτσέζικες Φολντ πρέπει να παρακολουθούνται για προβλήματα αρθρώσεων. Άλλες ανησυχίες περιλαμβάνουν υπερτροφική μυοκαρδιοπάθεια και πολυκυστική νεφροπάθεια. Η ηθική εκτροφή (fold με straight ear) μειώνει αλλά δεν εξαλείφει τον κίνδυνο προβλημάτων αρθρώσεων. Η τακτική κτηνιατρική φροντίδα είναι απαραίτητη για την πρώιμη ανίχνευση προβλημάτων."
  },
  {
    "id": "abyssinian",
    "slug": "abyssinian",
    "name_en": "Abyssinian",
    "name_el": "Αβυσσινιανή",
    "type": "cat",
    "origin": "Ethiopia",
    "originCode": "ET",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Active", "Curious", "Intelligent", "Playful", "Social"],
    "temperament_el": ["Δραστήρια", "Περίεργη", "Έξυπνη", "Παιχνιδιάρα", "Κοινωνική"],
    "description_en": "The Abyssinian is one of the oldest known cat breeds, believed to have originated from ancient Egypt or Ethiopia (Abyssinia). These elegant cats are known for their distinctive ticked tabby coat that gives them a wild, exotic appearance reminiscent of small wildcats. Abyssinians are highly active, curious cats that love to explore and climb. They are incredibly intelligent and easily bored, requiring plenty of mental stimulation and play. Often described as 'Aby-grabby' for their tendency to snatch objects, they are entertaining and engaging companions who stay kitten-like throughout their lives.",
    "description_el": "Η Αβυσσινιανή είναι μία από τις παλαιότερες γνωστές ράτσες γατών, πιστεύεται ότι κατάγεται από την αρχαία Αίγυπτο ή την Αιθιοπία (Αβυσσινία). Αυτές οι κομψές γάτες είναι γνωστές για το χαρακτηριστικό τικ ταμπί τρίχωμά τους που τους δίνει μια άγρια, εξωτική εμφάνιση που θυμίζει μικρές άγριες γάτες. Οι Αβυσσινιανές είναι εξαιρετικά δραστήριες, περίεργες γάτες που αγαπούν να εξερευνούν και να σκαρφαλώνουν. Είναι απίστευτα έξυπνες και βαριούνται εύκολα, απαιτώντας πολλή νοητική διέγερση και παιχνίδι. Συχνά περιγράφονται ως 'Aby-grabby' για την τάση τους να αρπάζουν αντικείμενα, είναι διασκεδαστικοί και ελκυστικοί σύντροφοι που παραμένουν σαν γατάκια σε όλη τη ζωή τους.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 5, "cost_index": 2 },
    "cost_annual_usd": "$600-900",
    "care_en": "Abyssinians are extremely active cats that require lots of interactive play and environmental enrichment. Tall cat trees, shelves, and climbing structures are essential. They love toys that mimic hunting behavior and enjoy puzzle feeders. Despite their short coat, regular brushing helps remove loose hair and distribute oils. Abyssinians are social cats that don't do well when left alone for long periods - consider a feline companion if you work long hours. They need mental stimulation and can become destructive if bored. Early socialization helps develop confident, well-adjusted adults.",
    "care_el": "Οι Αβυσσινιανές είναι εξαιρετικά δραστήριες γάτες που απαιτούν πολλή διαδραστική παιχνιδιά και περιβαλλοντικό εμπλουτισμό. Ψηλά δέντρα γάτας, ράφια και δομές αναρρίχησης είναι απαραίτητα. Λατρεύουν τα παιχνίδια που μιμούνται τη συμπεριφορά κυνηγιού και απολαμβάνουν ταΐστρες παζλ. Παρά το κοντό τρίχωμά τους, το τακτικό βούρτσισμα βοηθά στην αφαίρεση χαλαρών τριχών και στην κατανομή των λαδιών. Οι Αβυσσινιανές είναι κοινωνικές γάτες που δεν τα πάνε καλά όταν αφήνονται μόνες για μεγάλες περιόδους - σκεφτείτε έναν γατίσιο σύντροφο αν εργάζεστε πολλές ώρες. Χρειάζονται νοητική διέγερση και μπορεί να γίνουν καταστροφικές αν βαρεθούν. Η πρώιμη κοινωνικοποίηση βοηθά στην ανάπτυξη σίγουρων, καλά προσαρμοσμένων ενηλίκων.",
    "health_en": "Abyssinians may be prone to several genetic conditions. Pyruvate kinase deficiency (PK Def) can cause hemolytic anemia and is testable genetically. Progressive retinal atrophy (PRA) can lead to blindness - responsible breeders test for the rdAc mutation. Renal amyloidosis is a kidney condition that affects some Abyssinians. Patellar luxation occasionally occurs. Gingivitis and periodontal disease may develop, making dental care important. When obtained from breeders who perform genetic testing, Abyssinians are generally healthy cats with good lifespans.",
    "health_el": "Οι Αβυσσινιανές μπορεί να είναι επιρρεπείς σε αρκετές γενετικές παθήσεις. Η ανεπάρκεια πυροσταφυλικής κινάσης (PK Def) μπορεί να προκαλέσει αιμολυτική αναιμία και είναι ελέγξιμη γενετικά. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) μπορεί να οδηγήσει σε τύφλωση - οι υπεύθυνοι εκτροφείς ελέγχουν για τη μετάλλαξη rdAc. Η νεφρική αμυλοείδωση είναι μια πάθηση των νεφρών που επηρεάζει ορισμένες Αβυσσινιανές. Η εξάρθρωση επιγονατίδας εμφανίζεται περιστασιακά. Η ουλίτιδα και η περιοδοντική νόσος μπορεί να αναπτυχθούν, καθιστώντας τη οδοντική φροντίδα σημαντική. Όταν αποκτούνται από εκτροφείς που εκτελούν γενετικό έλεγχο, οι Αβυσσινιανές είναι γενικά υγιείς γάτες με καλή διάρκεια ζωής."
  },
  {
    "id": "norwegian-forest",
    "slug": "norwegian-forest",
    "name_en": "Norwegian Forest Cat",
    "name_el": "Νορβηγική Δασική",
    "type": "cat",
    "origin": "Norway",
    "originCode": "NO",
    "images": [],
    "size": "large",
    "lifespan": "14-16 years",
    "temperament_en": ["Gentle", "Friendly", "Intelligent", "Playful", "Independent"],
    "temperament_el": ["Ήπια", "Φιλική", "Έξυπνη", "Παιχνιδιάρα", "Ανεξάρτητη"],
    "description_en": "The Norwegian Forest Cat is a large, sturdy breed that evolved in the harsh climate of Scandinavian forests. Known in Norway as 'Skogkatt', these magnificent cats have thick, waterproof double coats, tufted ears and paws, and long, bushy tails. They were the companions of Vikings and feature prominently in Norse mythology. Norwegian Forest Cats are gentle, friendly cats that form strong bonds with their families while maintaining an independent spirit. They are excellent climbers with strong claws and enjoy high perches. Despite their wild appearance, they are calm and adaptable companions.",
    "description_el": "Η Νορβηγική Δασική Γάτα είναι μια μεγάλη, εύρωστη ράτσα που εξελίχθηκε στο σκληρό κλίμα των σκανδιναβικών δασών. Γνωστή στη Νορβηγία ως 'Skogkatt', αυτές οι υπέροχες γάτες έχουν παχιά, αδιάβροχα διπλά τριχώματα, θυσανωτά αυτιά και πατούσες, και μακριές, φουντωτές ουρές. Ήταν οι σύντροφοι των Βίκινγκς και εμφανίζονται εμφανώς στη σκανδιναβική μυθολογία. Οι Νορβηγικές Δασικές Γάτες είναι ήπιες, φιλικές γάτες που δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους ενώ διατηρούν ένα ανεξάρτητο πνεύμα. Είναι εξαιρετικοί αναρριχητές με ισχυρά νύχια και απολαμβάνουν τις ψηλές θέσεις. Παρά την άγρια εμφάνισή τους, είναι ήρεμοι και προσαρμοστικοί σύντροφοι.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 4, "trainability": 3, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Norwegian Forest Cats require regular grooming, especially during shedding seasons when daily brushing may be needed. Their water-resistant coat is relatively easy to maintain compared to other long-haired breeds. These large cats need sturdy cat trees and climbing structures - they are excellent climbers and love high perches. They enjoy outdoor access if safe, or a secure catio. Norwegian Forest Cats mature slowly, not reaching full size until 4-5 years old. They are playful and enjoy interactive toys. Their independent nature means they tolerate some time alone better than more demanding breeds.",
    "care_el": "Οι Νορβηγικές Δασικές Γάτες απαιτούν τακτική περιποίηση, ειδικά κατά τις εποχές αλλαγής τριχώματος όταν μπορεί να χρειάζεται καθημερινό βούρτσισμα. Το αδιάβροχο τρίχωμά τους είναι σχετικά εύκολο στη συντήρηση σε σύγκριση με άλλες μακρύτριχες ράτσες. Αυτές οι μεγάλες γάτες χρειάζονται γερά δέντρα γάτας και δομές αναρρίχησης - είναι εξαιρετικοί αναρριχητές και αγαπούν τις ψηλές θέσεις. Απολαμβάνουν την πρόσβαση σε εξωτερικούς χώρους αν είναι ασφαλές, ή ένα ασφαλές catio. Οι Νορβηγικές Δασικές Γάτες ωριμάζουν αργά, δεν φτάνουν το πλήρες μέγεθος μέχρι τα 4-5 χρόνια. Είναι παιχνιδιάρες και απολαμβάνουν διαδραστικά παιχνίδια. Η ανεξάρτητη φύση τους σημαίνει ότι ανέχονται κάποιο χρόνο μόνες καλύτερα από πιο απαιτητικές ράτσες.",
    "health_en": "Norwegian Forest Cats are generally healthy but may be prone to hypertrophic cardiomyopathy (HCM), which is common in many cat breeds. Glycogen Storage Disease Type IV is a fatal genetic condition specific to Norwegian Forest Cats - reputable breeders test for this. Hip dysplasia can occur due to their large size. Polycystic kidney disease (PKD) is occasionally seen. Their long coat requires proper maintenance to prevent skin issues. Regular veterinary checkups and choosing a breeder who screens for genetic conditions helps ensure a healthy pet.",
    "health_el": "Οι Νορβηγικές Δασικές Γάτες είναι γενικά υγιείς αλλά μπορεί να είναι επιρρεπείς σε υπερτροφική μυοκαρδιοπάθεια (HCM), που είναι συχνή σε πολλές ράτσες γατών. Η Νόσος Αποθήκευσης Γλυκογόνου Τύπου IV είναι μια θανατηφόρα γενετική πάθηση ειδική για τις Νορβηγικές Δασικές Γάτες - οι αξιόπιστοι εκτροφείς ελέγχουν για αυτό. Η δυσπλασία ισχίου μπορεί να εμφανιστεί λόγω του μεγάλου τους μεγέθους. Η πολυκυστική νεφροπάθεια (PKD) εμφανίζεται περιστασιακά. Το μακρύ τρίχωμά τους απαιτεί σωστή συντήρηση για να αποφευχθούν δερματικά προβλήματα. Οι τακτικοί κτηνιατρικοί έλεγχοι και η επιλογή εκτροφέα που ελέγχει για γενετικές παθήσεις βοηθά στην εξασφάλιση ενός υγιούς κατοικίδιου."
  },
  {
    "id": "burmese",
    "slug": "burmese",
    "name_en": "Burmese",
    "name_el": "Βιρμανέζικη",
    "type": "cat",
    "origin": "Myanmar (Burma)",
    "originCode": "MM",
    "images": [],
    "size": "medium",
    "lifespan": "15-18 years",
    "temperament_en": ["Affectionate", "Playful", "Social", "Intelligent", "Vocal"],
    "temperament_el": ["Στοργική", "Παιχνιδιάρα", "Κοινωνική", "Έξυπνη", "Φωνακλά"],
    "description_en": "The Burmese cat originated in Myanmar (formerly Burma) and was brought to the United States in 1930. These medium-sized cats are known for their muscular, compact bodies and beautiful satin-like coat that comes in various colors. Burmese cats are extremely people-oriented and form strong bonds with their owners. They are often described as 'velcro cats' because they love to be with their humans constantly. Burmese are playful and kitten-like throughout their lives, maintaining their energy and curiosity well into old age. They have a distinctive, soft voice that they use to communicate.",
    "description_el": "Η Βιρμανέζικη γάτα κατάγεται από τη Μιανμάρ (πρώην Βιρμανία) και μεταφέρθηκε στις Ηνωμένες Πολιτείες το 1930. Αυτές οι μεσαίου μεγέθους γάτες είναι γνωστές για τα μυώδη, συμπαγή σώματά τους και το όμορφο σατινένιο τρίχωμα που έρχεται σε διάφορα χρώματα. Οι Βιρμανέζικες γάτες είναι εξαιρετικά προσανατολισμένες στους ανθρώπους και δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες τους. Συχνά περιγράφονται ως 'γάτες βέλκρο' επειδή αγαπούν να είναι με τους ανθρώπους τους συνεχώς. Οι Βιρμανέζικες είναι παιχνιδιάρες και σαν γατάκια σε όλη τη ζωή τους, διατηρώντας την ενέργεια και την περιέργειά τους μέχρι τα γηρατειά. Έχουν μια χαρακτηριστική, απαλή φωνή που χρησιμοποιούν για να επικοινωνήσουν.",
    "characteristics": { "energy": 4, "grooming": 1, "friendliness": 5, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$600-900",
    "care_en": "Burmese cats have minimal grooming needs thanks to their short, close-lying coat. Weekly brushing is sufficient to remove loose hair and keep their coat shiny. They are highly social cats that require lots of attention and don't do well when left alone for long periods. Consider getting two Burmese if you work long hours, as they thrive with companionship. They are playful and need interactive toys and play sessions. Burmese are indoor cats and should not be allowed outside unsupervised due to their trusting nature. They love warm spots and may seek out sunny windows or heated beds.",
    "care_el": "Οι Βιρμανέζικες γάτες έχουν ελάχιστες ανάγκες περιποίησης χάρη στο κοντό, κοντινό τρίχωμά τους. Το εβδομαδιαίο βούρτσισμα είναι αρκετό για να αφαιρεθεί το χαλαρό τρίχωμα και να διατηρηθεί το τρίχωμά τους λαμπερό. Είναι εξαιρετικά κοινωνικές γάτες που απαιτούν πολλή προσοχή και δεν τα πάνε καλά όταν αφήνονται μόνες για μεγάλες περιόδους. Σκεφτείτε να πάρετε δύο Βιρμανέζικες αν εργάζεστε πολλές ώρες, καθώς ευδοκιμούν με συντροφιά. Είναι παιχνιδιάρες και χρειάζονται διαδραστικά παιχνίδια και συνεδρίες παιχνιδιού. Οι Βιρμανέζικες είναι γάτες εσωτερικού χώρου και δεν πρέπει να αφήνονται έξω χωρίς επίβλεψη λόγω της εμπιστευτικής τους φύσης. Αγαπούν τα ζεστά σημεία και μπορεί να αναζητούν ηλιόλουστα παράθυρα ή θερμαινόμενα κρεβάτια.",
    "health_en": "Burmese cats may be prone to several health conditions. Diabetes mellitus is more common in Burmese than in many other breeds. Hypokalemia (low potassium) can cause muscle weakness and has been seen in some lines. Flat-chested kitten syndrome and cherry eye occasionally occur. Some Burmese may develop feline orofacial pain syndrome. Cranial deformities have been seen in the breed. Despite these potential concerns, well-bred Burmese are generally healthy cats with excellent lifespans, often living 18-20 years with proper care.",
    "health_el": "Οι Βιρμανέζικες γάτες μπορεί να είναι επιρρεπείς σε αρκετές υγειονομικές παθήσεις. Ο σακχαρώδης διαβήτης είναι πιο συχνός στις Βιρμανέζικες από ό,τι σε πολλές άλλες ράτσες. Η υποκαλιαιμία (χαμηλό κάλιο) μπορεί να προκαλέσει μυϊκή αδυναμία και έχει παρατηρηθεί σε ορισμένες σειρές. Το σύνδρομο επίπεδου στήθους γατάκι και το κερασί στο μάτι εμφανίζονται περιστασιακά. Ορισμένες Βιρμανέζικες μπορεί να αναπτύξουν γατίσιο στοματοπροσωπικό σύνδρομο πόνου. Κρανιακές παραμορφώσεις έχουν παρατηρηθεί στη ράτσα. Παρά αυτές τις πιθανές ανησυχίες, οι καλά εκτρεφόμενες Βιρμανέζικες είναι γενικά υγιείς γάτες με εξαιρετική διάρκεια ζωής, συχνά ζώντας 18-20 χρόνια με σωστή φροντίδα."
  },
  {
    "id": "devon-rex",
    "slug": "devon-rex",
    "name_en": "Devon Rex",
    "name_el": "Ντέβον Ρεξ",
    "type": "cat",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Playful", "Mischievous", "Affectionate", "Social", "Active"],
    "temperament_el": ["Παιχνιδιάρα", "Αταξιάρα", "Στοργική", "Κοινωνική", "Δραστήρια"],
    "description_en": "The Devon Rex originated in Devon, England in 1960 when a curly-coated kitten was born to a stray cat. These distinctive cats are known for their large ears, elfin faces, and soft, wavy coats. Despite their appearance, Devon Rex are not hypoallergenic, though some allergy sufferers find them easier to tolerate. Devon Rex are highly social, playful cats often described as 'monkey in a cat suit' for their acrobatic antics and love of climbing. They are attention-seekers who want to be involved in everything their owners do, often perching on shoulders or snuggling under covers.",
    "description_el": "Η Ντέβον Ρεξ προήλθε από το Ντέβον της Αγγλίας το 1960 όταν ένα σγουρό γατάκι γεννήθηκε από μια αδέσποτη γάτα. Αυτές οι ξεχωριστές γάτες είναι γνωστές για τα μεγάλα αυτιά τους, τα ξωτικά πρόσωπα και τα απαλά, κυματιστά τριχώματα. Παρά την εμφάνισή τους, οι Ντέβον Ρεξ δεν είναι υποαλλεργικές, αν και ορισμένοι που πάσχουν από αλλεργίες τις βρίσκουν πιο εύκολες να ανεχθούν. Οι Ντέβον Ρεξ είναι εξαιρετικά κοινωνικές, παιχνιδιάρες γάτες που συχνά περιγράφονται ως 'μαϊμού σε στολή γάτας' για τις ακροβατικές τους αταξίες και την αγάπη τους για το σκαρφάλωμα. Είναι αναζητητές προσοχής που θέλουν να συμμετέχουν σε όλα όσα κάνουν οι ιδιοκτήτες τους, συχνά κουρνιάζοντας στους ώμους ή χουχουλιάζοντας κάτω από καλύμματα.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 5, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$600-900",
    "care_en": "Devon Rex have minimal grooming needs due to their short, delicate coat - in fact, over-brushing can damage it. Gentle wiping with a damp cloth is often sufficient. They require regular ear cleaning as their large ears can accumulate wax. Devon Rex are highly social and need lots of interaction - they don't do well alone. Their lack of full coat coverage means they seek warmth, so heated beds and sweaters may be appreciated in cooler weather. They are very food-motivated and prone to overeating, so portion control is important. High cat trees and climbing structures are essential for these active cats.",
    "care_el": "Οι Ντέβον Ρεξ έχουν ελάχιστες ανάγκες περιποίησης λόγω του κοντού, λεπτού τριχώματός τους - στην πραγματικότητα, το υπερβολικό βούρτσισμα μπορεί να το καταστρέψει. Το απαλό σκούπισμα με ένα υγρό πανί είναι συχνά αρκετό. Απαιτούν τακτικό καθαρισμό αυτιών καθώς τα μεγάλα αυτιά τους μπορεί να συσσωρεύσουν κερί. Οι Ντέβον Ρεξ είναι εξαιρετικά κοινωνικές και χρειάζονται πολλή αλληλεπίδραση - δεν τα πάνε καλά μόνες. Η έλλειψη πλήρους κάλυψης τριχώματος σημαίνει ότι αναζητούν ζεστασιά, οπότε θερμαινόμενα κρεβάτια και πουλόβερ μπορεί να εκτιμηθούν σε πιο κρύο καιρό. Είναι πολύ παρακινημένες από το φαγητό και επιρρεπείς στο υπερφαγητό, οπότε ο έλεγχος μερίδων είναι σημαντικός.",
    "health_en": "Devon Rex may be prone to several health conditions. Hereditary myopathy (Devon Rex myopathy or spasticity) is a muscle condition specific to the breed. Hypertrophic cardiomyopathy (HCM) can affect Devon Rex, and regular cardiac screening is recommended. Patellar luxation may occur. Their delicate coat and lack of guard hairs make them susceptible to skin conditions and sunburn. Dental disease may develop, making regular dental care important. Some Devon Rex carry genes for blood type B, which can cause neonatal isoerythrolysis in kittens. Despite these concerns, most Devon Rex are healthy, entertaining companions.",
    "health_el": "Οι Ντέβον Ρεξ μπορεί να είναι επιρρεπείς σε αρκετές υγειονομικές παθήσεις. Η κληρονομική μυοπάθεια (μυοπάθεια Ντέβον Ρεξ ή σπαστικότητα) είναι μια μυϊκή πάθηση ειδική για τη ράτσα. Η υπερτροφική μυοκαρδιοπάθεια (HCM) μπορεί να επηρεάσει τις Ντέβον Ρεξ, και συνιστάται τακτικός καρδιακός έλεγχος. Η εξάρθρωση επιγονατίδας μπορεί να εμφανιστεί. Το λεπτό τρίχωμά τους και η έλλειψη τριχών φύλακα τις καθιστούν επιρρεπείς σε δερματικές παθήσεις και ηλιακό έγκαυμα. Η οδοντική νόσος μπορεί να αναπτυχθεί, καθιστώντας τη τακτική οδοντική φροντίδα σημαντική."
  },
  {
    "id": "birman",
    "slug": "birman",
    "name_en": "Birman",
    "name_el": "Μπιρμάν",
    "type": "cat",
    "origin": "Myanmar (Burma)",
    "originCode": "MM",
    "images": [],
    "size": "medium",
    "lifespan": "12-16 years",
    "temperament_en": ["Gentle", "Affectionate", "Quiet", "Docile", "Social"],
    "temperament_el": ["Ήπια", "Στοργική", "Ήσυχη", "Πειθήνια", "Κοινωνική"],
    "description_en": "The Birman, also known as the Sacred Cat of Burma, has a legendary history involving temple cats in Myanmar. These beautiful cats are known for their striking blue eyes, color-pointed coat, and distinctive white 'gloves' on all four paws. Birmans have a silky, medium-length coat that is less prone to matting than other long-haired breeds. They are gentle, affectionate cats that enjoy human companionship without being overly demanding. Birmans have a soft, sweet voice and are generally quiet cats. They get along well with other pets and children, making them excellent family companions.",
    "description_el": "Η Μπιρμάν, επίσης γνωστή ως η Ιερή Γάτα της Βιρμανίας, έχει μια θρυλική ιστορία που αφορά γάτες ναών στη Μιανμάρ. Αυτές οι όμορφες γάτες είναι γνωστές για τα εντυπωσιακά μπλε μάτια τους, το τρίχωμα με χρωματιστές άκρες και τα χαρακτηριστικά λευκά 'γάντια' και στα τέσσερα πόδια. Οι Μπιρμάν έχουν ένα μεταξένιο, μεσαίου μήκους τρίχωμα που είναι λιγότερο επιρρεπές σε κόμπους από άλλες μακρύτριχες ράτσες. Είναι ήπιες, στοργικές γάτες που απολαμβάνουν την ανθρώπινη συντροφιά χωρίς να είναι υπερβολικά απαιτητικές. Οι Μπιρμάν έχουν μια απαλή, γλυκιά φωνή και είναι γενικά ήσυχες γάτες. Τα πάνε καλά με άλλα κατοικίδια και παιδιά, καθιστώντας τις εξαιρετικούς οικογενειακούς συντρόφους.",
    "characteristics": { "energy": 3, "grooming": 3, "friendliness": 5, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$600-900",
    "care_en": "Birmans have a silky coat that is relatively easy to maintain compared to other long-haired breeds. Brushing 2-3 times per week helps prevent tangles and removes loose hair. They are social cats that enjoy companionship but are not as demanding as some breeds. Birmans appreciate routine and may become stressed by major changes. They are indoor cats and should have access to scratching posts, climbing structures, and interactive toys. Regular play sessions help keep them active and prevent weight gain. Their gentle nature makes them adaptable to various household situations.",
    "care_el": "Οι Μπιρμάν έχουν ένα μεταξένιο τρίχωμα που είναι σχετικά εύκολο στη συντήρηση σε σύγκριση με άλλες μακρύτριχες ράτσες. Το βούρτσισμα 2-3 φορές την εβδομάδα βοηθά στην πρόληψη μπερδεμάτων και αφαιρεί το χαλαρό τρίχωμα. Είναι κοινωνικές γάτες που απολαμβάνουν τη συντροφιά αλλά δεν είναι τόσο απαιτητικές όσο ορισμένες ράτσες. Οι Μπιρμάν εκτιμούν τη ρουτίνα και μπορεί να αγχωθούν από μεγάλες αλλαγές. Είναι γάτες εσωτερικού χώρου και πρέπει να έχουν πρόσβαση σε ξυστρά, δομές αναρρίχησης και διαδραστικά παιχνίδια. Οι τακτικές συνεδρίες παιχνιδιού βοηθούν να τις κρατήσουν δραστήριες και να αποτρέψουν την αύξηση βάρους.",
    "health_en": "Birmans may be prone to several health conditions. Hypertrophic cardiomyopathy (HCM) is a concern, and regular cardiac screening is recommended. Polycystic kidney disease (PKD) can occur, though it is less common than in some breeds. Feline infectious peritonitis (FIP) has been seen at higher rates in Birmans. Some may develop thyroid issues. Dental disease may occur without proper care. Birmans may carry genes for blood type B, which can cause complications in breeding. Despite these potential concerns, Birmans are generally healthy cats with good lifespans when obtained from responsible breeders.",
    "health_el": "Οι Μπιρμάν μπορεί να είναι επιρρεπείς σε αρκετές υγειονομικές παθήσεις. Η υπερτροφική μυοκαρδιοπάθεια (HCM) είναι ανησυχία, και συνιστάται τακτικός καρδιακός έλεγχος. Η πολυκυστική νεφροπάθεια (PKD) μπορεί να εμφανιστεί, αν και είναι λιγότερο συχνή από ό,τι σε ορισμένες ράτσες. Η λοιμώδης περιτονίτιδα γατών (FIP) έχει παρατηρηθεί σε υψηλότερα ποσοστά στις Μπιρμάν. Ορισμένες μπορεί να αναπτύξουν προβλήματα θυρεοειδούς. Η οδοντική νόσος μπορεί να εμφανιστεί χωρίς σωστή φροντίδα. Οι Μπιρμάν μπορεί να φέρουν γονίδια για ομάδα αίματος Β, που μπορεί να προκαλέσει επιπλοκές στην αναπαραγωγή."
  },
  {
    "id": "american-shorthair",
    "slug": "american-shorthair",
    "name_en": "American Shorthair",
    "name_el": "Αμερικανική Κοντότριχη",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "15-20 years",
    "temperament_en": ["Adaptable", "Friendly", "Calm", "Independent", "Playful"],
    "temperament_el": ["Προσαρμοστική", "Φιλική", "Ήρεμη", "Ανεξάρτητη", "Παιχνιδιάρα"],
    "description_en": "The American Shorthair descended from European cats brought to North America by early settlers to protect cargo from rats. These working cats evolved into a hardy, adaptable breed known for their health and longevity. American Shorthairs are medium-sized, muscular cats with round faces and dense coats in a wide variety of colors and patterns - the classic silver tabby being most iconic. They are friendly, easygoing cats that get along well with families, other pets, and adapt easily to various living situations. Their moderate activity level and independent nature make them excellent companions for busy households.",
    "description_el": "Η Αμερικανική Κοντότριχη κατάγεται από ευρωπαϊκές γάτες που μεταφέρθηκαν στη Βόρεια Αμερική από τους πρώτους αποίκους για να προστατεύσουν τα φορτία από τους αρουραίους. Αυτές οι εργατικές γάτες εξελίχθηκαν σε μια ανθεκτική, προσαρμοστική ράτσα γνωστή για την υγεία και τη μακροζωία τους. Οι Αμερικανικές Κοντότριχες είναι μεσαίου μεγέθους, μυώδεις γάτες με στρογγυλά πρόσωπα και πυκνά τριχώματα σε μεγάλη ποικιλία χρωμάτων και σχεδίων - με το κλασικό ασημί ταμπί να είναι το πιο εμβληματικό. Είναι φιλικές, χαλαρές γάτες που τα πάνε καλά με οικογένειες, άλλα κατοικίδια και προσαρμόζονται εύκολα σε διάφορες συνθήκες διαβίωσης.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 1 },
    "cost_annual_usd": "$400-600",
    "care_en": "American Shorthairs are low-maintenance cats with minimal grooming needs. Weekly brushing is sufficient to remove loose hair and keep their coat healthy. They have moderate energy levels and enjoy play sessions but are also content to relax. They can be prone to obesity, so portion control and regular playtime are important. American Shorthairs are independent enough to tolerate time alone, making them suitable for working owners. They are adaptable cats that do well in various environments, from apartments to houses with outdoor access. Regular veterinary checkups help maintain their excellent health.",
    "care_el": "Οι Αμερικανικές Κοντότριχες είναι γάτες χαμηλής συντήρησης με ελάχιστες ανάγκες περιποίησης. Το εβδομαδιαίο βούρτσισμα είναι αρκετό για να αφαιρεθεί το χαλαρό τρίχωμα και να διατηρηθεί υγιές το τρίχωμά τους. Έχουν μέτρια επίπεδα ενέργειας και απολαμβάνουν τις συνεδρίες παιχνιδιού αλλά είναι επίσης ικανοποιημένες να χαλαρώνουν. Μπορεί να είναι επιρρεπείς στην παχυσαρκία, οπότε ο έλεγχος μερίδων και ο τακτικός χρόνος παιχνιδιού είναι σημαντικός. Οι Αμερικανικές Κοντότριχες είναι αρκετά ανεξάρτητες για να ανεχθούν χρόνο μόνες, καθιστώντας τις κατάλληλες για ιδιοκτήτες που εργάζονται.",
    "health_en": "American Shorthairs are generally very healthy cats with long lifespans, often living 15-20 years. However, they may be prone to hypertrophic cardiomyopathy (HCM), which is common in many cat breeds. Obesity is a significant concern due to their laid-back nature, so diet and exercise management is important. Some may develop hip dysplasia. Dental disease may occur without proper care. Polycystic kidney disease (PKD) is occasionally seen. Their overall hardiness and good health make them one of the healthiest cat breeds available when obtained from responsible breeders.",
    "health_el": "Οι Αμερικανικές Κοντότριχες είναι γενικά πολύ υγιείς γάτες με μακρά διάρκεια ζωής, συχνά ζώντας 15-20 χρόνια. Ωστόσο, μπορεί να είναι επιρρεπείς σε υπερτροφική μυοκαρδιοπάθεια (HCM), που είναι συχνή σε πολλές ράτσες γατών. Η παχυσαρκία είναι σημαντική ανησυχία λόγω της χαλαρής τους φύσης, οπότε η διαχείριση διατροφής και άσκησης είναι σημαντική. Ορισμένες μπορεί να αναπτύξουν δυσπλασία ισχίου. Η οδοντική νόσος μπορεί να εμφανιστεί χωρίς σωστή φροντίδα. Η πολυκυστική νεφροπάθεια (PKD) εμφανίζεται περιστασιακά. Η συνολική τους ανθεκτικότητα και καλή υγεία τις καθιστά μία από τις πιο υγιείς ράτσες γατών."
  }
]
