[
  {
    "id": "american-bobtail",
    "slug": "american-bobtail",
    "name_en": "American Bobtail",
    "name_el": "Αμερικανική Μπομπτέιλ",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "13-15 years",
    "temperament_en": ["Friendly", "Intelligent", "Playful", "Adaptable", "Loyal"],
    "temperament_el": ["Φιλική", "Έξυπνη", "Παιχνιδιάρα", "Προσαρμοστική", "Πιστή"],
    "description_en": "The American Bobtail is a medium to large cat breed known for its distinctive short, stubby tail that can be straight or slightly curved. Developed in the United States in the 1960s, these cats have a wild appearance but a gentle, dog-like personality. They are highly intelligent and enjoy interactive play, often learning to walk on a leash or play fetch. American Bobtails form strong bonds with their families and get along well with children and other pets.",
    "description_el": "Η Αμερικανική Μπομπτέιλ είναι ράτσα γάτας μεσαίου έως μεγάλου μεγέθους γνωστή για την χαρακτηριστική της κοντή, κοντόσφαιρη ουρά που μπορεί να είναι ευθεία ή ελαφρώς κυρτή. Αναπτύχθηκε στις ΗΠΑ τη δεκαετία του 1960, αυτές οι γάτες έχουν άγρια εμφάνιση αλλά ήπια, σαν σκύλου προσωπικότητα. Είναι εξαιρετικά έξυπνες και απολαμβάνουν διαδραστικό παιχνίδι, συχνά μαθαίνοντας να περπατούν με λουρί ή να παίζουν φέτσ. Οι Αμερικανικές Μπομπτέιλ δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους και τα πάνε καλά με παιδιά και άλλα κατοικίδια.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "American Bobtails have a low to medium maintenance coat that benefits from weekly brushing. They are active cats that need play sessions and mental stimulation. Many enjoy puzzle toys and learning tricks. They adapt well to various living situations including apartments. Regular nail trimming and dental care are recommended.",
    "care_el": "Οι Αμερικανικές Μπομπτέιλ έχουν τρίχωμα χαμηλής έως μέτριας συντήρησης που επωφελείται από εβδομαδιαίο βούρτσισμα. Είναι δραστήριες γάτες που χρειάζονται συνεδρίες παιχνιδιού και πνευματικό ερέθισμα. Πολλές απολαμβάνουν παιχνίδια παζλ και μαθαίνουν κόλπα. Προσαρμόζονται καλά σε διάφορες συνθήκες διαβίωσης συμπεριλαμβανομένων διαμερισμάτων. Συνιστώνται τακτικό κούρεμα νυχιών και οδοντική φροντίδα.",
    "health_en": "American Bobtails are generally healthy. The bobtail is a natural genetic mutation and does not typically cause spinal issues when bred responsibly. Some may be prone to hip dysplasia. Reputable breeders screen for genetic conditions. Overall they are a robust breed with good longevity.",
    "health_el": "Οι Αμερικανικές Μπομπτέιλ είναι γενικά υγιείς. Η κοντή ουρά είναι φυσική γενετική μετάλλαξη και συνήθως δεν προκαλεί σπονδυλικά προβλήματα όταν εκτρέφονται υπεύθυνα. Ορισμένες μπορεί να είναι επιρρεπείς σε δυσπλασία ισχίου. Οι αξιόπιστοι εκτροφείς ελέγχουν για γενετικές παθήσεις. Συνολικά είναι εύρωστη ράτσα με καλή μακροζωία."
  },
  {
    "id": "american-curl",
    "slug": "american-curl",
    "name_en": "American Curl",
    "name_el": "Αμερικανική Κερλ",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-16 years",
    "temperament_en": ["Curious", "Affectionate", "Playful", "Gentle", "Social"],
    "temperament_el": ["Περίεργη", "Στοργική", "Παιχνιδιάρα", "Ήπια", "Κοινωνική"],
    "description_en": "The American Curl is distinguished by its unique backward-curling ears, which give the breed an alert, inquisitive expression. The curl develops within the first few days of life. Originating from a stray in California in 1981, the breed comes in both longhair and shorthair varieties. American Curls are people-oriented, playful, and retain their kitten-like personality well into adulthood. They are adaptable and get along with other pets and children.",
    "description_el": "Η Αμερικανική Κερλ διακρίνεται από τα μοναδικά της πίσω λυγισμένα αυτιά, που δίνουν στη ράτσα μια άγρυπνη, ερευνητική έκφραση. Το λύγισμα αναπτύσσεται τις πρώτες μέρες της ζωής. Προερχόμενη από αδέσποτη στην Καλιφόρνια το 1981, η ράτσα υπάρχει σε μακρύτριχη και κοντότριχη ποικιλία. Οι Αμερικανικές Κερλ είναι προσανατολισμένες στους ανθρώπους, παιχνιδιάρες και διατηρούν την προσωπικότητά τους σαν γατάκι μέχρι την ενηλικίωση. Είναι προσαρμοστικές και τα πάνε καλά με άλλα κατοικίδια και παιδιά.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "American Curls need minimal grooming; longhair varieties require more frequent brushing. The curled ears should be handled gently and cleaned occasionally—never force them straight. They are active and enjoy interactive play. Regular ear checks are important due to the unique ear structure.",
    "care_el": "Οι Αμερικανικές Κερλ χρειάζονται ελάχιστη περιποίηση· οι μακρύτριχες ποικιλίες απαιτούν πιο συχνό βούρτσισμα. Τα λυγισμένα αυτιά πρέπει να χειρίζονται απαλά και να καθαρίζονται περιστασιακά—ποτέ μην τα ισιώνετε. Είναι δραστήριες και απολαμβάνουν το διαδραστικό παιχνίδι. Ο τακτικός έλεγχος αυτιών είναι σημαντικός λόγω της μοναδικής δομής των αυτιών.",
    "health_en": "The ear curl is caused by a genetic mutation that does not affect cartilage elsewhere. American Curls are generally healthy with no known breed-specific disorders. Ear curling should be bred carefully to avoid excessive curl that could cause problems. Overall a healthy, long-lived breed.",
    "health_el": "Το λύγισμα του αυτιού προκαλείται από γενετική μετάλλαξη που δεν επηρεάζει το χόνδρο αλλού. Οι Αμερικανικές Κερλ είναι γενικά υγιείς χωρίς γνωστές ειδικές για τη ράτσα διαταραχές. Το λύγισμα του αυτιού πρέπει να εκτρέφεται προσεκτικά για να αποφευχθεί υπερβολικό λύγισμα. Συνολικά υγιής, μακρόβια ράτσα."
  },
  {
    "id": "american-wirehair",
    "slug": "american-wirehair",
    "name_en": "American Wirehair",
    "name_el": "Αμερικανική Γουάιαρχερ",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "14-18 years",
    "temperament_en": ["Calm", "Affectionate", "Curious", "Easygoing", "Loyal"],
    "temperament_el": ["Ήρεμη", "Στοργική", "Περίεργη", "Χαλαρή", "Πιστή"],
    "description_en": "The American Wirehair is known for its springy, wiry coat—each hair is bent or hooked, giving a crimped appearance. The breed arose from a spontaneous mutation in New York in 1966. Despite their coarse-looking coat, the texture is soft to the touch. American Wirehairs are calm, affectionate cats that enjoy human company. They are similar in build and personality to the American Shorthair but with their unique coat.",
    "description_el": "Η Αμερικανική Γουάιαρχερ είναι γνωστή για το ελαστικό, σύρματινο τρίχωμά της—κάθε τρίχα είναι λυγισμένη ή αγκιστρωτή, δίνοντας τσακισμένη εμφάνιση. Η ράτσα προέκυψε από αυθόρμητη μετάλλαξη στη Νέα Υόρκη το 1966. Παρά το τραχύ τρίχωμά τους, η υφή είναι μαλακή στο άγγιγμα. Οι Αμερικανικές Γουάιαρχερ είναι ήρεμες, στοργικές γάτες που απολαμβάνουν την ανθρώπινη συντροφιά. Είναι παρόμοιες σε σωματότυπο και προσωπικότητα με την Αμερικανική Κοντότριχη αλλά με το μοναδικό τους τρίχωμα.",
    "characteristics": { "energy": 3, "grooming": 1, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$600-900",
    "care_en": "The wiry coat should not be over-brushed as it can damage the unique texture. Occasional gentle combing is sufficient. They are low-maintenance cats that adapt well to indoor life. American Wirehairs enjoy play but are not overly demanding. Regular nail trimming and dental care recommended.",
    "care_el": "Το σύρματινο τρίχωμα δεν πρέπει να βουρτσίζεται υπερβολικά καθώς μπορεί να καταστρέψει την μοναδική υφή. Περιστασιακό απαλό χτένισμα είναι αρκετό. Είναι γάτες χαμηλής συντήρησης που προσαρμόζονται καλά στη ζωή σε εσωτερικούς χώρους. Οι Αμερικανικές Γουάιαρχερ απολαμβάνουν το παιχνίδι αλλά δεν απαιτούν υπερβολικά. Συνιστώνται τακτικό κούρεμα νυχιών και οδοντική φροντίδα.",
    "health_en": "American Wirehairs are generally healthy with no known breed-specific conditions. The coat mutation does not affect health. They are a robust breed. Regular veterinary checkups and preventive care are recommended as with all cats.",
    "health_el": "Οι Αμερικανικές Γουάιαρχερ είναι γενικά υγιείς χωρίς γνωστές ειδικές για τη ράτσα παθήσεις. Η μετάλλαξη του τριχώματος δεν επηρεάζει την υγεία. Είναι εύρωστη ράτσα. Συνιστώνται τακτικοί κτηνιατρικοί έλεγχοι και προληπτική φροντίδα όπως με όλες τις γάτες."
  },
  {
    "id": "australian-mist",
    "slug": "australian-mist",
    "name_en": "Australian Mist",
    "name_el": "Αυστραλιανή Ομίχλη",
    "type": "cat",
    "origin": "Australia",
    "originCode": "AU",
    "images": [],
    "size": "medium",
    "lifespan": "15-18 years",
    "temperament_en": ["Gentle", "Friendly", "Tolerant", "Playful", "Adaptable"],
    "temperament_el": ["Ήπια", "Φιλική", "Ανεκτική", "Παιχνιδιάρα", "Προσαρμοστική"],
    "description_en": "The Australian Mist was developed in Australia in the 1970s by crossing Burmese, Abyssinian, and domestic shorthairs. The result is a medium-sized cat with a spotted or marbled coat in muted colors. Australian Mists are known for their gentle, tolerant nature—they are excellent with children and other pets. They are indoor cats by design and thrive in family environments. The breed is still relatively rare outside Australia.",
    "description_el": "Η Αυστραλιανή Ομίχλη αναπτύχθηκε στην Αυστραλία τη δεκαετία του 1970 διασταυρώνοντας Βιρμανέζικη, Αβυσσινιανή και οικόσιτες κοντότριχες. Το αποτέλεσμα είναι γάτα μεσαίου μεγέθους με ριγέ ή μαρμαρωτό τρίχωμα σε ήσυχα χρώματα. Οι Αυστραλιανές Ομίχλες είναι γνωστές για την ήπια, ανεκτική φύση τους—είναι εξαιρετικές με παιδιά και άλλα κατοικίδια. Είναι γάτες εσωτερικού χώρου από σχεδιασμό και ευδοκιμούν σε οικογενειακά περιβάλλοντα. Η ράτσα εξακολουθεί να είναι σχετικά σπάνια εκτός Αυστραλίας.",
    "characteristics": { "energy": 3, "grooming": 1, "friendliness": 5, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$600-900",
    "care_en": "Australian Mists have a short coat requiring minimal grooming—weekly brushing is sufficient. They are active but not hyperactive and enjoy interactive play. As indoor cats they need environmental enrichment. They bond strongly with their families and prefer not to be left alone for long periods.",
    "care_el": "Οι Αυστραλιανές Ομίχλες έχουν κοντό τρίχωμα που απαιτεί ελάχιστη περιποίηση—το εβδομαδιαίο βούρτσισμα είναι αρκετό. Είναι δραστήριες αλλά όχι υπερκινητικές και απολαμβάνουν το διαδραστικό παιχνίδι. Ως γάτες εσωτερικού χώρου χρειάζονται πλούσιο περιβάλλον. Δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους και προτιμούν να μην μένουν μόνες για μεγάλες περιόδους.",
    "health_en": "Australian Mists are generally healthy with a long lifespan. The breed was developed with genetic diversity in mind. No major breed-specific health issues have been identified. Regular veterinary care and preventive measures apply as for all cats.",
    "health_el": "Οι Αυστραλιανές Ομίχλες είναι γενικά υγιείς με μακρά διάρκεια ζωής. Η ράτσα αναπτύχθηκε με γέννηση γενετικής ποικιλότητας. Δεν έχουν αναγνωριστεί σοβαρές ειδικές για τη ράτσα υγειονομικές παθήσεις. Ισχύει τακτική κτηνιατρική φροντίδα και προληπτικά μέτρα όπως για όλες τις γάτες."
  },
  {
    "id": "balinese",
    "slug": "balinese",
    "name_en": "Balinese",
    "name_el": "Μπαλινέζικη",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "15-20 years",
    "temperament_en": ["Vocal", "Affectionate", "Intelligent", "Playful", "Social"],
    "temperament_el": ["Φωνακλού", "Στοργική", "Έξυπνη", "Παιχνιδιάρα", "Κοινωνική"],
    "description_en": "The Balinese is essentially a longhaired Siamese—the breed arose from natural longhair mutations in Siamese litters. They share the same color-point pattern, blue eyes, and vocal, people-oriented personality. Balinese cats are intelligent, athletic, and love to communicate with their owners. They form strong bonds and do not like to be left alone. The coat is silky and does not mat easily compared to other longhairs.",
    "description_el": "Η Μπαλινέζικη είναι ουσιαστικά μακρύτριχη Σιαμέζα—η ράτσα προέκυψε από φυσικές μακρύτριχες μεταλλάξεις σε γέννες Σιαμέζα. Μοιράζονται το ίδιο σχέδιο χρωματιστών άκρων, μπλε μάτια και φωνητική, προσανατολισμένη στους ανθρώπους προσωπικότητα. Οι Μπαλινέζικες γάτες είναι έξυπνες, αθλητικές και αγαπούν να επικοινωνούν με τους ιδιοκτήτες τους. Δημιουργούν ισχυρούς δεσμούς και δεν τους αρέσει να μένουν μόνες. Το τρίχωμα είναι μεταξένιο και δεν μπερδεύεται εύκολα σε σύγκριση με άλλες μακρύτριχες.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Despite the long coat, Balinese need only moderate grooming as they lack the undercoat that causes matting. Brush 2-3 times per week. They have high social and mental needs—puzzle toys, play, and companionship are essential. They can be trained to walk on a leash. Do not leave alone for long periods.",
    "care_el": "Παρά το μακρύ τρίχωμα, οι Μπαλινέζικες χρειάζονται μόνο μέτρια περιποίηση καθώς στερούνται το υποτρίχωμα που προκαλεί μπέρδεμα. Βουρτσίζετε 2-3 φορές την εβδομάδα. Έχουν υψηλές κοινωνικές και πνευματικές ανάγκες—παιχνίδια παζλ, παιχνίδι και συντροφιά είναι απαραίτητα. Μπορούν να εκπαιδευτούν να περπατούν με λουρί. Μην τις αφήνετε μόνες για μεγάλες περιόδους.",
    "health_en": "Balinese share similar health considerations with Siamese: possible respiratory issues, progressive retinal atrophy, and amyloidosis in some lines. They are generally long-lived. Reputable breeders screen for genetic conditions. Dental care is important.",
    "health_el": "Οι Μπαλινέζικες μοιράζονται παρόμοιες υγειονομικές επιλογές με τις Σιαμέζες: πιθανά αναπνευστικά προβλήματα, προοδευτική ατροφία αμφιβληστροειδούς και αμυλοείδωση σε ορισμένες σειρές. Είναι γενικά μακρόβιες. Οι αξιόπιστοι εκτροφείς ελέγχουν για γενετικές παθήσεις. Η οδοντική φροντίδα είναι σημαντική."
  },
  {
    "id": "bambino",
    "slug": "bambino",
    "name_en": "Bambino",
    "name_el": "Μπαμπόνο",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Playful", "Affectionate", "Curious", "Social", "Energetic"],
    "temperament_el": ["Παιχνιδιάρα", "Στοργική", "Περίεργη", "Κοινωνική", "Ενεργητική"],
    "description_en": "The Bambino is a cross between the Sphynx and Munchkin, resulting in a hairless, short-legged cat. The name means 'baby' in Italian, reflecting their kitten-like appearance throughout life. They are small, lightweight cats with wrinkled skin and large ears. Bambinos are outgoing, playful, and love attention. They need to be kept warm due to lack of fur and are strictly indoor cats.",
    "description_el": "Το Μπαμπόνο είναι διασταύρωση Σφίνγα και Μάντσκιν, με αποτέλεσμα γάτα χωρίς τρίχωμα και κοντόποδη. Το όνομα σημαίνει 'μωρό' στα ιταλικά, αντικατοπτρίζοντας την εμφάνισή τους σαν γατάκι σε όλη τη ζωή. Είναι μικρές, ελαφρύβαρες γάτες με ζαρωμένο δέρμα και μεγάλα αυτιά. Τα Μπαμπόνο είναι εξωστρεφή, παιχνιδιάρα και αγαπούν την προσοχή. Χρειάζονται να διατηρούνται ζεστά λόγω έλλειψης τριχώματος και είναι αυστηρά γάτες εσωτερικού χώρου.",
    "characteristics": { "energy": 5, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 5 },
    "cost_annual_usd": "$1,800-2,500",
    "care_en": "Bambinos need regular bathing to remove skin oils since they have no fur to absorb them. Skin can be oily; wipe with damp cloth between baths. They must stay indoors and need sweaters in cool climates. Protect from sun exposure. Nails and ears need regular attention. Provide warm sleeping spots.",
    "care_el": "Τα Μπαμπόνο χρειάζονται τακτικό μπάνιο για αφαίρεση δερματικών ελαίων αφού δεν έχουν τρίχωμα για να τα απορροφήσουν. Το δέρμα μπορεί να είναι λιπαρό· σκουπίστε με υγρό πανί ανάμεσα σε μπάνια. Πρέπει να μένουν σε εσωτερικούς χώρους και χρειάζονται πουλόβερ σε δροσερά κλίματα. Προστατέψτε από την ηλιακή ακτινοβολία. Τα νύχια και τα αυτιά χρειάζονται τακτική προσοχή. Παρέχετε ζεστά σημεία ύπνου.",
    "health_en": "As a hybrid, Bambinos may inherit Sphynx issues (heart conditions, skin sensitivity) or Munchkin concerns (lordosis, pectus excavatum in some lines). Short legs do not typically cause mobility problems. Choose breeders who health-test. Skin care is essential to prevent infections.",
    "health_el": "Ως υβρίδιο, τα Μπαμπόνο μπορεί να κληρονομήσουν προβλήματα Σφίνγα (καρδιακές παθήσεις, ευαισθησία δέρματος) ή ανησυχίες Μάντσκιν (lordώση, pectus excavatum σε ορισμένες σειρές). Τα κοντά πόδια συνήθως δεν προκαλούν προβλήματα κινητικότητας. Επιλέξτε εκτροφείς που κάνουν έλεγχο υγείας. Η δερματική φροντίδα είναι απαραίτητη για την πρόληψη λοιμώξεων."
  },
  {
    "id": "bombay",
    "slug": "bombay",
    "name_en": "Bombay",
    "name_el": "Βομβάη",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-18 years",
    "temperament_en": ["Affectionate", "Social", "Playful", "Curious", "Vocal"],
    "temperament_el": ["Στοργική", "Κοινωνική", "Παιχνιδιάρα", "Περίεργη", "Φωνακλού"],
    "description_en": "The Bombay was bred to resemble a miniature black panther—a sleek, black cat with copper or gold eyes. Developed in the US by crossing black American Shorthairs with Burmese, they have a patent-leather coat and muscular build. Bombays are people-oriented, outgoing, and often described as dog-like. They enjoy being the center of attention and get along well with other pets and children.",
    "description_el": "Η Βομβάη εκτράφηκε να μοιάζει με μικροσκοπική μαύρη πάνθηρα—γλαφυρή, μαύρη γάτα με χάλκινα ή χρυσά μάτια. Αναπτύχθηκε στις ΗΠΑ διασταυρώνοντας μαύρες Αμερικανικές Κοντότριχες με Βιρμανέζικη, έχουν τρίχωμα σαν πατενταρισμένο δέρμα και μυϊκή σωματότυπο. Οι Βομβάη είναι προσανατολισμένες στους ανθρώπους, εξωστρεφείς και συχνά περιγράφονται ως σαν σκύλος. Απολαμβάνουν να είναι στο κέντρο της προσοχής και τα πάνε καλά με άλλα κατοικίδια και παιδιά.",
    "characteristics": { "energy": 4, "grooming": 1, "friendliness": 5, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$600-900",
    "care_en": "Bombays have a short, close-lying coat that needs minimal grooming—weekly brushing suffices. They are active and enjoy play; provide toys and climbing structures. They bond strongly and prefer not to be left alone. They can learn tricks and some enjoy leash walking. Keep indoors to protect the sleek coat and the cat.",
    "care_el": "Οι Βομβάη έχουν κοντό, κολλημένο τρίχωμα που χρειάζεται ελάχιστη περιποίηση—το εβδομαδιαίο βούρτσισμα αρκεί. Είναι δραστήριες και απολαμβάνουν το παιχνίδι· παρέχετε παιχνίδια και δομές αναρρίχησης. Δημιουργούν ισχυρούς δεσμούς και προτιμούν να μην μένουν μόνες. Μπορούν να μάθουν κόλπα και ορισμένες απολαμβάνουν το περπάτημα με λουρί. Κρατήστε τις σε εσωτερικούς χώρους για προστασία του γλαφυρού τριχώματος και της γάτας.",
    "health_en": "Bombays may be prone to some conditions seen in Burmese lines, including craniofacial defects in some breeding lines and susceptibility to upper respiratory infections. Hypertrophic cardiomyopathy has been reported. Generally they are healthy, robust cats. Choose breeders who screen for genetic issues.",
    "health_el": "Οι Βομβάη μπορεί να είναι επιρρεπείς σε ορισμένες παθήσεις που παρατηρούνται σε σειρές Βιρμανέζικης, συμπεριλαμβανομένων κρανιοπροσωπικών ελαττωμάτων σε ορισμένες σειρές εκτροφής και ευαισθησίας σε λοιμώξεις ανώτερου αναπνευστικού. Η υπερτροφική μυοκαρδιοπάθεια έχει αναφερθεί. Γενικά είναι υγιείς, εύρωστες γάτες. Επιλέξτε εκτροφείς που ελέγχουν για γενετικά ζητήματα."
  },
  {
    "id": "british-longhair",
    "slug": "british-longhair",
    "name_en": "British Longhair",
    "name_el": "Βρετανική Μακρύτριχη",
    "type": "cat",
    "origin": "United Kingdom",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "12-20 years",
    "temperament_en": ["Calm", "Gentle", "Affectionate", "Quiet", "Easygoing"],
    "temperament_el": ["Ήρεμη", "Ήπια", "Στοργική", "Ήσυχη", "Χαλαρή"],
    "description_en": "The British Longhair is the longhaired version of the British Shorthair, sharing the same round face, sturdy build, and calm temperament. The long, dense coat comes in the same colors and patterns as the shorthair. They are calm, undemanding cats that enjoy companionship without being clingy. British Longhairs are less common than the shorthair but equally delightful as family pets.",
    "description_el": "Η Βρετανική Μακρύτριχη είναι η μακρύτριχη εκδοχή της Βρετανικής Κοντότριχης, μοιράζοντας το ίδιο στρογγυλό πρόσωπο, εύρωστη σωματότυπο και ήρεμο temperament. Το μακρύ, πυκνό τρίχωμα έρχεται στα ίδια χρώματα και σχέδια με την κοντότριχη. Είναι ήρεμες, μη απαιτητικές γάτες που απολαμβάνουν τη συντροφιά χωρίς να είναι κολλώδεις. Οι Βρετανικές Μακρύτριχες είναι λιγότερο κοινές από την κοντότριχη αλλά εξίσου απολαυστικές ως οικογενειακά κατοικίδια.",
    "characteristics": { "energy": 2, "grooming": 4, "friendliness": 4, "trainability": 3, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "British Longhairs need regular grooming to prevent matting—brush several times per week. The coat is dense and can mat if neglected. They are not highly active; monitor weight and encourage play. They are indoor cats and adapt well to apartment living. Dental care and nail trimming as needed.",
    "care_el": "Οι Βρετανικές Μακρύτριχες χρειάζονται τακτική περιποίηση για πρόληψη μπερδέματος—βουρτσίζετε αρκετές φορές την εβδομάδα. Το τρίχωμα είναι πυκνό και μπορεί να μπερδεύεται αν αμεληθεί. Δεν είναι ιδιαίτερα δραστήριες· παρακολουθήστε το βάρος και ενθαρρύνετε το παιχνίδι. Είναι γάτες εσωτερικού χώρου και προσαρμόζονται καλά στη ζωή σε διαμέρισμα. Οδοντική φροντίδα και κούρεμα νυχιών όταν χρειάζεται.",
    "health_en": "British Longhairs share the same potential health issues as British Shorthairs: hypertrophic cardiomyopathy, polycystic kidney disease, and obesity risk. The long coat does not add breed-specific conditions. Regular cardiac screening recommended. Generally long-lived and robust.",
    "health_el": "Οι Βρετανικές Μακρύτριχες μοιράζονται τις ίδιες πιθανές υγειονομικές παθήσεις με τις Βρετανικές Κοντότριχες: υπερτροφική μυοκαρδιοπάθεια, πολυκυστική νεφροπάθεια και κίνδυνος παχυσαρκίας. Το μακρύ τρίχωμα δεν προσθέτει ειδικές για τη ράτσα παθήσεις. Συνιστάται τακτικός καρδιακός έλεγχος. Γενικά μακρόβιες και εύρωστες."
  },
  {
    "id": "burmilla",
    "slug": "burmilla",
    "name_en": "Burmilla",
    "name_el": "Μπουρμίλα",
    "type": "cat",
    "origin": "United Kingdom",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "10-15 years",
    "temperament_en": ["Gentle", "Playful", "Affectionate", "Social", "Curious"],
    "temperament_el": ["Ήπια", "Παιχνιδιάρα", "Στοργική", "Κοινωνική", "Περίεργη"],
    "description_en": "The Burmilla resulted from an accidental mating between a Chinchilla Persian and a Burmese in the UK in 1981. They have a silver or shaded coat with green or green-gold eyes and a sweet expression. Burmillas combine the gentle nature of the Persian with the playful, people-loving character of the Burmese. They are medium-sized, elegant cats that get along well with families and other pets.",
    "description_el": "Η Μπουρμίλα προέκυψε από τυχαία ζευγάρωμα μεταξύ Περσικής Chinchilla και Βιρμανέζικης στο ΗΒ το 1981. Έχουν ασημί ή σκιασμένο τρίχωμα με πράσινα ή πρασινοχρυσά μάτια και γλυκιά έκφραση. Οι Μπουρμίλα συνδυάζουν την ήπια φύση της Περσικής με τον παιχνιδιάρη, φιλάνθρωπο χαρακτήρα της Βιρμανέζικης. Είναι γάτες μεσαίου μεγέθους, κομψές που τα πάνε καλά με οικογένειες και άλλα κατοικίδια.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Burmillas have a short to semi-long coat that needs weekly brushing. They are active and playful; provide toys and interaction. They enjoy human company and can be prone to loneliness if left alone often. They adapt well to indoor life. Regular play sessions help maintain health and bond.",
    "care_el": "Οι Μπουρμίλα έχουν κοντό έως ημι-μακρύ τρίχωμα που χρειάζεται εβδομαδιαίο βούρτσισμα. Είναι δραστήριες και παιχνιδιάρες· παρέχετε παιχνίδια και αλληλεπίδραση. Απολαμβάνουν την ανθρώπινη συντροφιά και μπορεί να είναι επιρρεπείς στη μοναξιά αν μείνουν μόνες συχνά. Προσαρμόζονται καλά στη ζωή σε εσωτερικούς χώρους. Οι τακτικές συνεδρίες παιχνιδιού βοηθούν στη διατήρηση της υγείας και του δεσμού.",
    "health_en": "Burmillas may inherit conditions from either parent breed: from Burmese, craniofacial issues in some lines; from Persian, possible PKD or respiratory issues in some bloodlines. Generally they are healthy. Choose breeders who test for genetic conditions. Regular vet checkups recommended.",
    "health_el": "Οι Μπουρμίλα μπορεί να κληρονομήσουν παθήσεις από οποιοδήποτε γονική ράτσα: από Βιρμανέζικη, κρανιοπροσωπικά ζητήματα σε ορισμένες σειρές· από Περσική, πιθανή PKD ή αναπνευστικά ζητήματα σε ορισμένες σειρές αίματος. Γενικά είναι υγιείς. Επιλέξτε εκτροφείς που ελέγχουν για γενετικές παθήσεις. Συνιστάται τακτικός κτηνιατρικός έλεγχος."
  },
  {
    "id": "chartreux",
    "slug": "chartreux",
    "name_en": "Chartreux",
    "name_el": "Σαρτρέ",
    "type": "cat",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Quiet", "Gentle", "Loyal", "Calm", "Adaptable"],
    "temperament_el": ["Ήσυχη", "Ήπια", "Πιστή", "Ήρεμη", "Προσαρμοστική"],
    "description_en": "The Chartreux is an ancient French breed with a distinctive blue-gray coat and copper or gold eyes. They have a robust, muscular build and a sweet 'smiling' expression. Chartreux cats are quiet—they tend to chirp rather than meow—and are calm, loyal companions. They form strong bonds with their families but are not demanding. They are good hunters and historically were kept in monasteries.",
    "description_el": "Η Σαρτρέ είναι αρχαία γαλλική ράτσα με χαρακτηριστικό μπλε-γκρι τρίχωμα και χάλκινα ή χρυσά μάτια. Έχουν εύρωστη, μυϊκή σωματότυπο και γλυκιά 'χαμογελαστή' έκφραση. Οι γάτες Σαρτρέ είναι ήσυχες—τείνουν να τιτιβίζουν αντί να νιαουρίζουν—και είναι ήρεμες, πιστές συντρόφισσες. Δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους αλλά δεν απαιτούν. Είναι καλές κυνηγόγατες και ιστορικά κρατούνταν σε μοναστήρια.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Chartreux have a dense, woolly coat that benefits from weekly brushing to reduce shedding. They are moderately active and enjoy play but are not hyper. They adapt well to various living situations. They tend to be reserved with strangers but devoted to their family. Keep indoors for safety.",
    "care_el": "Οι Σαρτρέ έχουν πυκνό, μαλλίστικο τρίχωμα που επωφελείται από εβδομαδιαίο βούρτσισμα για μείωση του πέσιμο τριχών. Είναι μέτρια δραστήριες και απολαμβάνουν το παιχνίδι αλλά δεν είναι υπερκινητικές. Προσαρμόζονται καλά σε διάφορες συνθήκες διαβίωσης. Τείνουν να είναι επιφυλακτικές με αγνώστους αλλά αφοσιωμένες στην οικογένειά τους. Κρατήστε τις σε εσωτερικούς χώρους για ασφάλεια.",
    "health_en": "Chartreux are generally healthy. They may be prone to patellar luxation and polycystic kidney disease in some lines. Dental issues can occur. Obesity can be a concern if overfed. Choose breeders who health-test. Overall a robust breed with good longevity.",
    "health_el": "Οι Σαρτρέ είναι γενικά υγιείς. Μπορεί να είναι επιρρεπείς σε εκτόπιση επιγονατίδος και πολυκυστική νεφροπάθεια σε ορισμένες σειρές. Οδοντικά προβλήματα μπορεί να εμφανιστούν. Η παχυσαρκία μπορεί να είναι ανησυχία αν υπερτρεφονται. Επιλέξτε εκτροφείς που ελέγχουν την υγεία. Συνολικά εύρωστη ράτσα με καλή μακροζωία."
  },
  {
    "id": "chausie",
    "slug": "chausie",
    "name_en": "Chausie",
    "name_el": "Σαουζί",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "12-14 years",
    "temperament_en": ["Active", "Intelligent", "Curious", "Loyal", "Energetic"],
    "temperament_el": ["Δραστήρια", "Έξυπνη", "Περίεργη", "Πιστή", "Ενεργητική"],
    "description_en": "The Chausie is a hybrid of the jungle cat (Felis chaus) and domestic cats, resulting in a large, athletic breed. They have a tall, lean build, large ears, and a ticked or solid coat. Chausies are highly active and need plenty of space and mental stimulation. They are intelligent and can learn tricks and walk on a leash. They bond strongly with their owners and need an experienced cat owner.",
    "description_el": "Η Σαουζί είναι υβρίδιο της δασικής γάτας (Felis chaus) και οικόσιτων γατών, με αποτέλεσμα μεγάλη, αθλητική ράτσα. Έχουν ψηλή, λεπτή σωματότυπο, μεγάλα αυτιά και ριγέ ή ομοιόχρωμο τρίχωμα. Οι Σαουζί είναι πολύ δραστήριες και χρειάζονται αρκετό χώρο και πνευματικό ερέθισμα. Είναι έξυπνες και μπορούν να μάθουν κόλπα και να περπατούν με λουρί. Δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες τους και χρειάζονται έμπειρο ιδιοκτήτη γάτας.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 4, "trainability": 5, "cost_index": 5 },
    "cost_annual_usd": "$1,800-2,500",
    "care_en": "Chausies have short coats needing minimal grooming. They require extensive daily play and enrichment—large cat trees, puzzle feeders, and interactive play. They may have higher protein dietary needs. Secure outdoor enclosure or leash walking can help meet exercise needs. Not suitable for small apartments or first-time owners.",
    "care_el": "Οι Σαουζί έχουν κοντά τριχώματα που χρειάζονται ελάχιστη περιποίηση. Απαιτούν εκτενή καθημερινό παιχνίδι και εμπλουτισμό—μεγάλα δέντρα γάτας, τροφοδοτικά παζλ και διαδραστικό παιχνίδι. Μπορεί να έχουν υψηλότερες διατροφικές ανάγκες σε πρωτεΐνη. Ασφαλές εξωτερικό χώρο ή περπάτημα με λουρί μπορεί να βοηθήσει στην κάλυψη αναγκών άσκησης. Δεν είναι κατάλληλες για μικρά διαμερίσματα ή πρωτοεμφανιζόμενους ιδιοκτήτες.",
    "health_en": "Chausies may have sensitive digestive systems; some do best on grain-free or high-protein diets. Hybrid vigor can mean good health, but early-generation cats may have more wild traits. Ensure breeder health testing. Generally robust when properly cared for.",
    "health_el": "Οι Σαουζί μπορεί να έχουν ευαίσθητο πεπτικό σύστημα· ορισμένες τα πάνε καλύτερα με δίαιτες χωρίς δημητριακά ή υψηλής πρωτεΐνης. Το υβριδικό σθένος μπορεί να σημαίνει καλή υγεία, αλλά οι γάτες πρώτων γενεών μπορεί να έχουν πιο άγρια χαρακτηριστικά. Βεβαιωθείτε για έλεγχο υγείας από τον εκτροφέα. Γενικά εύρωστες όταν φροντίζονται σωστά."
  },
  {
    "id": "colorpoint-shorthair",
    "slug": "colorpoint-shorthair",
    "name_en": "Colorpoint Shorthair",
    "name_el": "Κολορπόιντ Κοντότριχη",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "15-20 years",
    "temperament_en": ["Vocal", "Affectionate", "Intelligent", "Active", "Social"],
    "temperament_el": ["Φωνακλού", "Στοργική", "Έξυπνη", "Δραστήρια", "Κοινωνική"],
    "description_en": "The Colorpoint Shorthair is essentially a Siamese in non-traditional point colors—red, cream, tortie, and lynx points. Developed by crossing Siamese with red tabby domestics, they share the Siamese body type, voice, and personality. They are vocal, people-oriented, and intelligent. Colorpoint Shorthairs thrive on attention and interaction and do not do well when left alone for long periods.",
    "description_el": "Η Κολορπόιντ Κοντότριχη είναι ουσιαστικά Σιαμέζα σε μη παραδοσιακά χρώματα point—κόκκινο, κρεμ, tortie και lynx point. Αναπτύχθηκε διασταυρώνοντας Σιαμέζα με κόκκινες ριγέ οικόσιτες, μοιράζονται το σωματότυπο, τη φωνή και την προσωπικότητα της Σιαμέζα. Είναι φωνητικές, προσανατολισμένες στους ανθρώπους και έξυπνες. Οι Κολορπόιντ Κοντότριχες ευδοκιμούν με προσοχή και αλληλεπίδραση και δεν τα πάνε καλά όταν αφήνονται μόνες για μεγάλες περιόδους.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 5, "trainability": 5, "cost_index": 2 },
    "cost_annual_usd": "$600-900",
    "care_en": "Minimal grooming—short coat needs only weekly brushing. High social and mental needs: play, puzzle toys, and companionship. They can be trained and many enjoy leash walking. Do not leave alone for long. Provide vertical space and interactive toys.",
    "care_el": "Ελάχιστη περιποίηση—το κοντό τρίχωμα χρειάζεται μόνο εβδομαδιαίο βούρτσισμα. Υψηλές κοινωνικές και πνευματικές ανάγκες: παιχνίδι, παιχνίδια παζλ και συντροφιά. Μπορούν να εκπαιδευτούν και πολλές απολαμβάνουν το περπάτημα με λουρί. Μην τις αφήνετε μόνες για μεγάλο διάστημα. Παρέχετε κάθετο χώρο και διαδραστικά παιχνίδια.",
    "health_en": "Same health profile as Siamese: possible respiratory issues, PRA, amyloidosis in some lines. Generally long-lived. Dental care important. Reputable breeders screen for genetic conditions. Good overall health with proper care.",
    "health_el": "Το ίδιο υγειονομικό προφίλ με τη Σιαμέζα: πιθανά αναπνευστικά προβλήματα, PRA, αμυλοείδωση σε ορισμένες σειρές. Γενικά μακρόβιες. Η οδοντική φροντίδα είναι σημαντική. Οι αξιόπιστοι εκτροφείς ελέγχουν για γενετικές παθήσεις. Καλή συνολική υγεία με σωστή φροντίδα."
  },
  {
    "id": "cornish-rex",
    "slug": "cornish-rex",
    "name_en": "Cornish Rex",
    "name_el": "Κόρνις Ρεξ",
    "type": "cat",
    "origin": "United Kingdom",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "11-15 years",
    "temperament_en": ["Playful", "Affectionate", "Curious", "Energetic", "Social"],
    "temperament_el": ["Παιχνιδιάρα", "Στοργική", "Περίεργη", "Ενεργητική", "Κοινωνική"],
    "description_en": "The Cornish Rex has a distinctive curly, soft coat with only the undercoat—no guard hairs. They have a slender build, large ears, and an egg-shaped head. Cornish Rex cats are extremely playful and retain kitten-like energy well into adulthood. They are people-oriented, love to be involved in household activities, and often enjoy fetching. They prefer warm environments due to their thin coat.",
    "description_el": "Η Κόρνις Ρεξ έχει χαρακτηριστικό σγουρό, μαλακό τρίχωμα μόνο με το υποτρίχωμα—χωρίς αμυντικές τρίχες. Έχουν λεπτή σωματότυπο, μεγάλα αυτιά και κεφάλι σαν αβγό. Οι γάτες Κόρνις Ρεξ είναι εξαιρετικά παιχνιδιάρες και διατηρούν ενέργεια σαν γατάκι μέχρι την ενηλικίωση. Είναι προσανατολισμένες στους ανθρώπους, αγαπούν να εμπλέκονται σε οικοκυρικές δραστηριότητες και συχνά απολαμβάνουν το φέτσ. Προτιμούν ζεστά περιβάλλοντα λόγω του λεπτού τριχώματος.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "The curly coat needs minimal grooming—no brushing that could damage curls; occasional wipe with hands or damp cloth. They need to stay warm; provide blankets and avoid drafts. Very active—provide plenty of play and climbing. They love attention and may get into mischief if bored.",
    "care_el": "Το σγουρό τρίχωμα χρειάζεται ελάχιστη περιποίηση—όχι βούρτσισμα που θα μπορούσε να καταστρέψει τα σγουριά· περιστασιακό σκούπισμα με χέρια ή υγρό πανί. Χρειάζονται να μένουν ζεστά· παρέχετε κουβέρτες και αποφεύγετε τα ρεύματα. Πολύ δραστήριες—παρέχετε αρκετό παιχνίδι και αναρρίχηση. Αγαπούν την προσοχή και μπορεί να ασχοληθούν με αταξίες αν βαρεθούν.",
    "health_en": "Cornish Rex may be prone to hypertrophic cardiomyopathy. Some lines may have hereditary hypotrichosis or skin sensitivity. They can get cold easily. Generally healthy. Choose breeders who screen for HCM. No major breed-specific issues when bred responsibly.",
    "health_el": "Η Κόρνις Ρεξ μπορεί να είναι επιρρεπής σε υπερτροφική μυοκαρδιοπάθεια. Ορισμένες σειρές μπορεί να έχουν κληρονομική υποτριχία ή ευαισθησία δέρματος. Μπορούν να κρυώσουν εύκολα. Γενικά υγιείς. Επιλέξτε εκτροφείς που ελέγχουν για HCM. Δεν υπάρχουν σοβαρά ειδικά για τη ράτσα προβλήματα όταν εκτρέφονται υπεύθυνα."
  },
  {
    "id": "cymric",
    "slug": "cymric",
    "name_en": "Cymric",
    "name_el": "Κίμρικ",
    "type": "cat",
    "origin": "Canada",
    "originCode": "CA",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Gentle", "Playful", "Intelligent", "Loyal", "Calm"],
    "temperament_el": ["Ήπια", "Παιχνιδιάρα", "Έξυπνη", "Πιστή", "Ήρεμη"],
    "description_en": "The Cymric is the longhaired variety of the Manx—a tailless or short-tailed cat from the Isle of Man. They have a rounded appearance, double coat, and can be 'rumpy' (no tail), 'rumpy riser', 'stumpy', or 'longy'. Cymrics are gentle, playful cats that bond closely with their families. They are good jumpers despite the lack of tail and enjoy interactive play.",
    "description_el": "Η Κίμρικ είναι η μακρύτριχη ποικιλία της Μανξ—γάτα χωρίς ουρά ή κοντόουρη από το Νησί του Μαν. Έχουν στρογγυλή εμφάνιση, διπλό τρίχωμα και μπορεί να είναι 'rumpy' (χωρίς ουρά), 'rumpy riser', 'stumpy' ή 'longy'. Οι Κίμρικ είναι ήπιες, παιχνιδιάρες γάτες που δημιουργούν στενούς δεσμούς με τις οικογένειές τους. Είναι καλές στο άλμα παρά την έλλειψη ουράς και απολαμβάνουν το διαδραστικό παιχνίδι.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Cymrics need regular brushing to prevent matting of the long coat—several times per week. They are active and enjoy play; provide climbing structures. Monitor for spinal issues (Manx syndrome) especially in rumpy cats. Keep indoors. Regular grooming prevents hairballs.",
    "care_el": "Οι Κίμρικ χρειάζονται τακτικό βούρτσισμα για πρόληψη μπερδέματος του μακριού τριχώματος—αρκετές φορές την εβδομάδα. Είναι δραστήριες και απολαμβάνουν το παιχνίδι· παρέχετε δομές αναρρίχησης. Παρακολουθήστε για σπονδυλικά ζητήματα (σύνδρομο Manx) ειδικά σε γάτες rumpy. Κρατήστε τις σε εσωτερικούς χώρους. Το τακτικό χτένισμα αποτρέπει τις τριχόσφαιρες.",
    "health_en": "Manx syndrome (spinal/neurological defects) can occur in tailless Manx/Cymric when both copies of the gene are inherited; reputable breeders avoid breeding two tailless cats. Arthritis in the tail area may occur in stumpy/longy. Otherwise generally healthy. Choose breeders who test and avoid at-risk matings.",
    "health_el": "Το σύνδρομο Manx (σπονδυλικά/νευρολογικά ελαττώματα) μπορεί να εμφανιστεί σε αούρες Manx/Κίμρικ όταν κληρονομούνται και τα δύο αντίγραφα του γονιδίου· οι αξιόπιστοι εκτροφείς αποφεύγουν την εκτροφή δύο αούρων γατών. Η αρθρίτιδα στην περιοχή της ουράς μπορεί να εμφανιστεί σε stumpy/longy. Διαφορετικά γενικά υγιείς. Επιλέξτε εκτροφείς που ελέγχουν και αποφεύγουν ζευγαρώματα υψηλού κινδύνου."
  },
  {
    "id": "donskoy",
    "slug": "donskoy",
    "name_en": "Don Sphynx (Donskoy)",
    "name_el": "Ντον Σφίνξ (Ντόνσκoϊ)",
    "type": "cat",
    "origin": "Russia",
    "originCode": "RU",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Affectionate", "Social", "Intelligent", "Curious", "Loyal"],
    "temperament_el": ["Στοργική", "Κοινωνική", "Έξυπνη", "Περίεργη", "Πιστή"],
    "description_en": "The Donskoy (Don Sphynx) is a hairless cat breed from Russia, unrelated to the Sphynx—their hairlessness is caused by a dominant gene. They have wrinkled skin, webbed toes, and large ears. Donskoys are affectionate, social cats that bond strongly with their families. They need warmth and are indoor-only cats. They are playful and enjoy human company.",
    "description_el": "Η Ντόνσκoϊ (Ντον Σφίνξ) είναι ράτσα γάτας χωρίς τρίχωμα από τη Ρωσία, άσχετη με τη Σφίνξ—η ατριχία τους προκαλείται από δεσπόζον γονίδιο. Έχουν ζαρωμένο δέρμα, αραχνούς δακτύλους και μεγάλα αυτιά. Οι Ντόνσκoϊ είναι στοργικές, κοινωνικές γάτες που δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους. Χρειάζονται ζεστασιά και είναι γάτες μόνο εσωτερικού χώρου. Είναι παιχνιδιάρες και απολαμβάνουν την ανθρώπινη συντροφιά.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Donskoys need regular bathing to remove skin oils; wipe with damp cloth between baths. Protect from sun and cold—sweaters in cool weather. Nails and ears need regular care. They must stay indoors. Provide warm bedding. Skin can be oily; use gentle, cat-safe products.",
    "care_el": "Οι Ντόνσκoϊ χρειάζονται τακτικό μπάνιο για αφαίρεση δερματικών ελαίων· σκουπίστε με υγρό πανί ανάμεσα σε μπάνια. Προστατέψτε από τον ήλιο και το κρύο—πουλόβερ σε δροσερά καιρό. Τα νύχια και τα αυτιά χρειάζονται τακτική φροντίδα. Πρέπει να μένουν σε εσωτερικούς χώρους. Παρέχετε ζεστά κρεβάτια. Το δέρμα μπορεί να είναι λιπαρό· χρησιμοποιείτε ήπια, ασφαλή για γάτες προϊόντα.",
    "health_en": "Donskoys are generally healthy. Skin care is essential to prevent infections and sunburn. Some may have dental issues. The dominant hairless gene does not cause the same health issues as the recessive Sphynx gene. Hypertrophic cardiomyopathy has been reported in some lines. Regular vet checkups recommended.",
    "health_el": "Οι Ντόνσκoϊ είναι γενικά υγιείς. Η δερματική φροντίδα είναι απαραίτητη για πρόληψη λοιμώξεων και ηλιακού εγκαύματος. Ορισμένες μπορεί να έχουν οδοντικά προβλήματα. Το δεσπόζον γονίδιο ατριχίας δεν προκαλεί τις ίδιες υγειονομικές παθήσεις με το υπολειπόμενο γονίδιο Σφίνξ. Η υπερτροφική μυοκαρδιοπάθεια έχει αναφερθεί σε ορισμένες σειρές. Συνιστάται τακτικός κτηνιατρικός έλεγχος."
  },
  {
    "id": "egyptian-mau",
    "slug": "egyptian-mau",
    "name_en": "Egyptian Mau",
    "name_el": "Αιγυπτιακή Μάου",
    "type": "cat",
    "origin": "Egypt",
    "originCode": "EG",
    "images": [],
    "size": "medium",
    "lifespan": "13-16 years",
    "temperament_en": ["Loyal", "Active", "Alert", "Affectionate", "Reserved"],
    "temperament_el": ["Πιστή", "Δραστήρια", "Άγρυπνη", "Στοργική", "Προφυλακτική"],
    "description_en": "The Egyptian Mau is one of the few naturally spotted domestic cat breeds. They have a graceful build, green eyes, and a distinctive 'M' marking on the forehead. Maus are loyal to their families but can be reserved with strangers. They are active and enjoy climbing and play. They have a soft, melodic voice and often express happiness by wiggling their tails.",
    "description_el": "Η Αιγυπτιακή Μάου είναι μία από τις λίγες φυσικά ριγέ οικόσιτες ράτσες γατών. Έχουν κομψή σωματότυπο, πράσινα μάτια και χαρακτηριστικό 'M' σημάδι στο μέτωπο. Οι Μάου είναι πιστές στις οικογένειές τους αλλά μπορεί να είναι επιφυλακτικές με αγνώστους. Είναι δραστήριες και απολαμβάνουν την αναρρίχηση και το παιχνίδι. Έχουν απαλή, μελωδική φωνή και συχνά εκφράζουν ευτυχία κουνώντας τις ουρές τους.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Egyptian Maus have short coats needing weekly brushing. They are active and need play and vertical space. They can be shy; socialize early and provide safe hiding spots. They bond strongly with one or two people. Keep indoors—they are prized and can be stolen. They enjoy interactive play and may learn fetch.",
    "care_el": "Οι Αιγυπτιακές Μάου έχουν κοντά τριχώματα που χρειάζονται εβδομαδιαίο βούρτσισμα. Είναι δραστήριες και χρειάζονται παιχνίδι και κάθετο χώρο. Μπορεί να είναι ντροπαλές· κοινωνικοποιήστε νωρίς και παρέχετε ασφαλή κρυψώνες. Δημιουργούν ισχυρούς δεσμούς με ένα ή δύο άτομα. Κρατήστε τις σε εσωτερικούς χώρους—έχουν αξία και μπορεί να κλαπούν. Απολαμβάνουν το διαδραστικό παιχνίδι και μπορεί να μάθουν φέτσ.",
    "health_en": "Egyptian Maus may be prone to hypertrophic cardiomyopathy. Some have sensitivity to anesthesia. Leukodystrophy has been reported in some lines. Generally healthy. Choose breeders who screen for HCM. Dental care and regular checkups recommended.",
    "health_el": "Οι Αιγυπτιακές Μάου μπορεί να είναι επιρρεπείς σε υπερτροφική μυοκαρδιοπάθεια. Ορισμένες έχουν ευαισθησία σε αναισθησία. Η λευκοδυστροφία έχει αναφερθεί σε ορισμένες σειρές. Γενικά υγιείς. Επιλέξτε εκτροφείς που ελέγχουν για HCM. Συνιστώνται οδοντική φροντίδα και τακτικοί έλεγχοι."
  },
  {
    "id": "european-shorthair",
    "slug": "european-shorthair",
    "name_en": "European Shorthair",
    "name_el": "Ευρωπαϊκή Κοντότριχη",
    "type": "cat",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "medium",
    "lifespan": "15-20 years",
    "temperament_en": ["Friendly", "Adaptable", "Independent", "Calm", "Healthy"],
    "temperament_el": ["Φιλική", "Προσαρμοστική", "Ανεξάρτητη", "Ήρεμη", "Υγιής"],
    "description_en": "The European Shorthair is the standardized version of the common European domestic cat, recognized mainly by FIFe in Europe. They are medium-sized, robust cats with no extreme features—natural hunters with a variety of coat colors and patterns. European Shorthairs are adaptable, friendly but not clingy, and generally healthy. They make excellent family pets and are low-maintenance.",
    "description_el": "Η Ευρωπαϊκή Κοντότριχη είναι η τυποποιημένη εκδοχή της κοινής ευρωπαϊκής οικόσιτης γάτας, αναγνωρισμένη κυρίως από τη FIFe στην Ευρώπη. Είναι γάτες μεσαίου μεγέθους, εύρωστες χωρίς ακραία χαρακτηριστικά—φυσικές κυνηγόγατες με ποικιλία χρωμάτων και σχεδίων τριχώματος. Οι Ευρωπαϊκές Κοντότριχες είναι προσαρμοστικές, φιλικές αλλά όχι κολλώδεις και γενικά υγιείς. Κάνουν εξαιρετικά οικογενειακά κατοικίδια και είναι εύκολες στη συντήρηση.",
    "characteristics": { "energy": 3, "grooming": 1, "friendliness": 4, "trainability": 3, "cost_index": 1 },
    "cost_annual_usd": "$400-600",
    "care_en": "Minimal grooming—weekly brushing. They are adaptable to indoor or supervised outdoor access in safe areas. Provide scratching posts and play. They are independent but enjoy companionship. Regular vaccinations and parasite control as for all cats.",
    "care_el": "Ελάχιστη περιποίηση—εβδομαδιαίο βούρτσισμα. Είναι προσαρμοστικές σε εσωτερικούς χώρους ή επιβλεπόμενη πρόσβαση σε εξωτερικούς χώρους σε ασφαλή περιοχές. Παρέχετε ξυστρά και παιχνίδι. Είναι ανεξάρτητες αλλά απολαμβάνουν τη συντροφιά. Τακτικοί εμβολιασμοί και έλεγχος παρασίτων όπως για όλες τις γάτες.",
    "health_en": "European Shorthairs are generally very healthy—they are not inbred and have broad genetic diversity. No major breed-specific conditions. Regular veterinary care, dental care, and preventive care apply. Often long-lived.",
    "health_el": "Οι Ευρωπαϊκές Κοντότριχες είναι γενικά πολύ υγιείς—δεν είναι ενδογαμικές και έχουν ευρεία γενετική ποικιλότητα. Δεν υπάρχουν σοβαρές ειδικές για τη ράτσα παθήσεις. Ισχύει τακτική κτηνιατρική φροντίδα, οδοντική φροντίδα και προληπτική φροντίδα. Συχνά μακρόβιες."
  },
  {
    "id": "exotic-shorthair",
    "slug": "exotic-shorthair",
    "name_en": "Exotic Shorthair",
    "name_el": "Εξωτική Κοντότριχη",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Calm", "Sweet", "Gentle", "Playful", "Loyal"],
    "temperament_el": ["Ήρεμη", "Γλυκιά", "Ήπια", "Παιχνιδιάρα", "Πιστή"],
    "description_en": "The Exotic Shorthair is essentially a Persian with a short, plush coat—bred from Persians and American Shorthairs. They have the same flat face, round head, and sweet expression as the Persian but with much easier coat care. Exotics are calm, affectionate cats that enjoy lounging and gentle play. They are ideal for those who want the Persian personality without the high grooming demands.",
    "description_el": "Η Εξωτική Κοντότριχη είναι ουσιαστικά Περσική με κοντό, βελούδινο τρίχωμα—εκτράφηκε από Περσικές και Αμερικανικές Κοντότριχες. Έχουν το ίδιο επίπεδο πρόσωπο, στρογγυλό κεφάλι και γλυκιά έκφραση με την Περσική αλλά με πολύ ευκολότερη φροντίδα τριχώματος. Οι Εξωτικές είναι ήρεμες, στοργικές γάτες που απολαμβάνουν την ξάπλα και το απαλό παιχνίδι. Είναι ιδανικές για όσους θέλουν την περσική προσωπικότητα χωρίς τις υψηλές απαιτήσεις περιποίησης.",
    "characteristics": { "energy": 2, "grooming": 3, "friendliness": 5, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Exotics need weekly brushing despite short coat; they shed. Face cleaning is important due to brachycephalic structure—wipe folds and eyes regularly. They are indoor cats. They enjoy play but are not highly active. Monitor for breathing issues in heat or stress.",
    "care_el": "Οι Εξωτικές χρειάζονται εβδομαδιαίο βούρτσισμα παρά το κοντό τρίχωμα· ρίχνουν τρίχωμα. Ο καθαρισμός του προσώπου είναι σημαντικός λόγω της βραχυκεφαλικής δομής—σκουπίζετε τις πτυχές και τα μάτια τακτικά. Είναι γάτες εσωτερικού χώρου. Απολαμβάνουν το παιχνίδι αλλά δεν είναι ιδιαίτερα δραστήριες. Παρακολουθήστε για αναπνευστικά ζητήματα σε ζέστη ή άγχος.",
    "health_en": "Exotics share Persian health concerns: brachycephalic issues (breathing, dental), polycystic kidney disease (PKD), eye problems. Reputable breeders screen for PKD. Tear staining and skin fold infections need regular care. Generally robust when bred for health.",
    "health_el": "Οι Εξωτικές μοιράζονται τις περσικές υγειονομικές ανησυχίες: βραχυκεφαλικά ζητήματα (αναπνοή, οδοντικά), πολυκυστική νεφροπάθεια (PKD), προβλήματα ματιών. Οι αξιόπιστοι εκτροφείς ελέγχουν για PKD. Οι λεκέδες δακρύων και οι λοιμώξεις δερματικών πτυχών χρειάζονται τακτική φροντίδα. Γενικά εύρωστες όταν εκτρέφονται για υγεία."
  },
  {
    "id": "german-rex",
    "slug": "german-rex",
    "name_en": "German Rex",
    "name_el": "Γερμανική Ρεξ",
    "type": "cat",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Friendly", "Playful", "Curious", "Affectionate", "Adaptable"],
    "temperament_el": ["Φιλική", "Παιχνιδιάρα", "Περίεργη", "Στοργική", "Προσαρμοστική"],
    "description_en": "The German Rex has a short, soft, curly coat similar to the Cornish Rex but with a different genetic mutation. The breed originated in Germany in the 1950s. German Rex cats are friendly, playful, and curious. They have a medium build and large ears. They are social and get along well with families and other pets. The coat is easy to care for.",
    "description_el": "Η Γερμανική Ρεξ έχει κοντό, μαλακό, σγουρό τρίχωμα παρόμοιο με την Κόρνις Ρεξ αλλά με διαφορετική γενετική μετάλλαξη. Η ράτσα προέκυψε στη Γερμανία τη δεκαετία του 1950. Οι γάτες Γερμανική Ρεξ είναι φιλικές, παιχνιδιάρες και περίεργες. Έχουν μέτρια σωματότυπο και μεγάλα αυτιά. Είναι κοινωνικές και τα πάνε καλά με οικογένειες και άλλα κατοικίδια. Το τρίχωμα είναι εύκολο στη φροντίδα.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "German Rex coat needs minimal grooming; gentle handling to preserve curls. They prefer warm environments. Active and playful—provide toys and interaction. They bond with their families. Regular nail and ear care. Keep indoors.",
    "care_el": "Το τρίχωμα Γερμανικής Ρεξ χρειάζεται ελάχιστη περιποίηση· απαλός χειρισμός για διατήρηση σγουριών. Προτιμούν ζεστά περιβάλλοντα. Δραστήριες και παιχνιδιάρες—παρέχετε παιχνίδια και αλληλεπίδραση. Δημιουργούν δεσμούς με τις οικογένειές τους. Τακτική φροντίδα νυχιών και αυτιών. Κρατήστε τις σε εσωτερικούς χώρους.",
    "health_en": "German Rex are generally healthy with no major breed-specific issues. Some may have sensitive skin. The rex mutation does not cause known health problems. Regular veterinary checkups recommended. Generally robust breed.",
    "health_el": "Οι Γερμανικές Ρεξ είναι γενικά υγιείς χωρίς σοβαρά ειδικά για τη ράτσα προβλήματα. Ορισμένες μπορεί να έχουν ευαίσθητο δέρμα. Η μετάλλαξη rex δεν προκαλεί γνωστά υγειονομικά προβλήματα. Συνιστάται τακτικός κτηνιατρικός έλεγχος. Γενικά εύρωστη ράτσα."
  },
  {
    "id": "havana-brown",
    "slug": "havana-brown",
    "name_en": "Havana Brown",
    "name_el": "Χαβανέζικη Καφέ",
    "type": "cat",
    "origin": "United Kingdom",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Affectionate", "Intelligent", "Playful", "Curious", "Social"],
    "temperament_el": ["Στοργική", "Έξυπνη", "Παιχνιδιάρα", "Περίεργη", "Κοινωνική"],
    "description_en": "The Havana Brown has a rich, solid brown (mahogany) coat and striking green eyes. The breed was developed in the UK in the 1950s. Havana Browns are affectionate, intelligent cats that enjoy being involved in everything. They have a distinctive muzzle shape and are medium-sized. They are playful and often use their paws to explore and communicate. They bond closely with their owners.",
    "description_el": "Η Χαβανέζικη Καφέ έχει πλούσιο, ομοιόχρωμο καφέ (μαόνι) τρίχωμα και εντυπωσιακά πράσινα μάτια. Η ράτσα αναπτύχθηκε στο ΗΒ τη δεκαετία του 1950. Οι Χαβανέζικες Καφέ είναι στοργικές, έξυπνες γάτες που απολαμβάνουν να εμπλέκονται σε όλα. Έχουν χαρακτηριστικό σχήμα ρύγχους και είναι μεσαίου μεγέθους. Είναι παιχνιδιάρες και συχνά χρησιμοποιούν τα πόδια τους για να εξερευνήσουν και να επικοινωνήσουν. Δημιουργούν στενούς δεσμούς με τους ιδιοκτήτες τους.",
    "characteristics": { "energy": 4, "grooming": 1, "friendliness": 5, "trainability": 5, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Havana Browns have short coats needing minimal grooming. They are active and need play and mental stimulation. They enjoy interactive toys and learning tricks. They prefer not to be left alone. Keep indoors. They can be trained to walk on a leash.",
    "care_el": "Οι Χαβανέζικες Καφέ έχουν κοντά τριχώματα που χρειάζονται ελάχιστη περιποίηση. Είναι δραστήριες και χρειάζονται παιχνίδι και πνευματικό ερέθισμα. Απολαμβάνουν διαδραστικά παιχνίδια και μαθαίνουν κόλπα. Προτιμούν να μην μένουν μόνες. Κρατήστε τις σε εσωτερικούς χώρους. Μπορούν να εκπαιδευτούν να περπατούν με λουρί.",
    "health_en": "Havana Browns are generally healthy. No major breed-specific conditions. Some lines may have lower genetic diversity due to small gene pool. Reputable breeders aim for health. Regular veterinary care and dental care recommended. Good longevity with proper care.",
    "health_el": "Οι Χαβανέζικες Καφέ είναι γενικά υγιείς. Δεν υπάρχουν σοβαρές ειδικές για τη ράτσα παθήσεις. Ορισμένες σειρές μπορεί να έχουν χαμηλότερη γενετική ποικιλότητα λόγω μικρού γονιδιακού pool. Οι αξιόπιστοι εκτροφείς στοχεύουν στην υγεία. Συνιστώνται τακτική κτηνιατρική φροντίδα και οδοντική φροντίδα. Καλή μακροζωία με σωστή φροντίδα."
  },
  {
    "id": "highlander",
    "slug": "highlander",
    "name_en": "Highlander",
    "name_el": "Χάιλαντερ",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "12-15 years",
    "temperament_en": ["Playful", "Friendly", "Intelligent", "Curious", "Social"],
    "temperament_el": ["Παιχνιδιάρα", "Φιλική", "Έξυπνη", "Περίεργη", "Κοινωνική"],
    "description_en": "The Highlander is a hybrid breed developed from Jungle Curl and Desert Lynx, featuring curled ears and optionally short (bob) or long tail. They have a wild look with a muscular build and spotted or marbled coat. Highlanders are playful, friendly, and intelligent. They are active and enjoy interactive play and climbing. They get along with families and other pets.",
    "description_el": "Η Χάιλαντερ είναι υβριδική ράτσα που αναπτύχθηκε από Jungle Curl και Desert Lynx, με λυγισμένα αυτιά και προαιρετικά κοντή (bob) ή μακριά ουρά. Έχουν άγρια εμφάνιση με μυϊκή σωματότυπο και ριγέ ή μαρμαρωτό τρίχωμα. Οι Χάιλαντερ είναι παιχνιδιάρες, φιλικές και έξυπνες. Είναι δραστήριες και απολαμβάνουν το διαδραστικό παιχνίδι και την αναρρίχηση. Τα πάνε καλά με οικογένειες και άλλα κατοικίδια.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Highlanders have short to medium coat; brush weekly. They need plenty of play and vertical space—large cat trees. They are active and intelligent; puzzle toys and interactive play recommended. Handle curled ears gently. Keep indoors or in secure enclosure.",
    "care_el": "Οι Χάιλαντερ έχουν κοντό έως μέτριο τρίχωμα· βουρτσίζετε εβδομαδιαίως. Χρειάζονται αρκετό παιχνίδι και κάθετο χώρο—μεγάλα δέντρα γάτας. Είναι δραστήριες και έξυπνες· συνιστώνται παιχνίδια παζλ και διαδραστικό παιχνίδι. Χειριστείτε τα λυγισμένα αυτιά απαλά. Κρατήστε τις σε εσωτερικούς χώρους ή σε ασφαλές χώρο.",
    "health_en": "Highlanders are generally healthy. As a developing hybrid breed, ensure breeder health testing. No widely reported breed-specific conditions. Regular veterinary care recommended. Generally robust when from responsible breeders.",
    "health_el": "Οι Χάιλαντερ είναι γενικά υγιείς. Ως αναπτυσσόμενη υβριδική ράτσα, βεβαιωθείτε για έλεγχο υγείας από τον εκτροφέα. Δεν υπάρχουν ευρέως αναφερόμενες ειδικές για τη ράτσα παθήσεις. Συνιστάται τακτική κτηνιατρική φροντίδα. Γενικά εύρωστες όταν προέρχονται από υπεύθυνους εκτροφείς."
  },
  {
    "id": "himalayan",
    "slug": "himalayan",
    "name_en": "Himalayan",
    "name_el": "Ιμαλαϊκή",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Calm", "Sweet", "Gentle", "Affectionate", "Quiet"],
    "temperament_el": ["Ήρεμη", "Γλυκιά", "Ήπια", "Στοργική", "Ήσυχη"],
    "description_en": "The Himalayan is a Persian with Siamese-style color points—long coat, flat face, and blue eyes with pointed pattern. They combine the calm, sweet Persian personality with the striking looks of the colorpoint. Himalayans are gentle, affectionate cats that prefer a quiet environment. They are less active than many breeds and enjoy lounging and being pampered.",
    "description_el": "Η Ιμαλαϊκή είναι Περσική με χρωματιστές άκρες στυλ Σιαμέζα—μακρύ τρίχωμα, επίπεδο πρόσωπο και μπλε μάτια με σχέδιο point. Συνδυάζουν την ήρεμη, γλυκιά περσική προσωπικότητα με την εντυπωσιακή εμφάνιση του colorpoint. Οι Ιμαλαϊκές είναι ήπιες, στοργικές γάτες που προτιμούν ήσυχο περιβάλλον. Είναι λιγότερο δραστήριες από πολλές ράτσες και απολαμβάνουν την ξάπλα και το καλομετάξι.",
    "characteristics": { "energy": 2, "grooming": 5, "friendliness": 5, "trainability": 2, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Himalayans require daily grooming to prevent matting—long coat and undercoat. Face cleaning daily for tear staining and skin folds. They are indoor cats. Prefer calm households. Regular brushing and professional grooming help. Provide comfortable resting spots.",
    "care_el": "Οι Ιμαλαϊκές απαιτούν καθημερινή περιποίηση για πρόληψη μπερδέματος—μακρύ τρίχωμα και υποτρίχωμα. Καθημερινός καθαρισμός προσώπου για λεκέδες δακρύων και δερματικές πτυχές. Είναι γάτες εσωτερικού χώρου. Προτιμούν ήρεμα νοικοκυριά. Το τακτικό βούρτσισμα και η επαγγελματική περιποίηση βοηθούν. Παρέχετε άνετα σημεία ξεκούρασης.",
    "health_en": "Himalayans share Persian health issues: brachycephalic problems, PKD, eye issues, breathing difficulties. Reputable breeders screen for PKD and respiratory health. Dental care important. Heat sensitivity due to flat face. Generally good lifespan with proper care.",
    "health_el": "Οι Ιμαλαϊκές μοιράζονται τα περσικά υγειονομικά ζητήματα: βραχυκεφαλικά προβλήματα, PKD, προβλήματα ματιών, αναπνευστικές δυσκολίες. Οι αξιόπιστοι εκτροφείς ελέγχουν για PKD και αναπνευστική υγεία. Η οδοντική φροντίδα είναι σημαντική. Ευαισθησία στη ζέστη λόγω επίπεδου προσώπου. Γενικά καλή διάρκεια ζωής με σωστή φροντίδα."
  },
  {
    "id": "japanese-bobtail",
    "slug": "japanese-bobtail",
    "name_en": "Japanese Bobtail",
    "name_el": "Ιαπωνική Μπομπτέιλ",
    "type": "cat",
    "origin": "Japan",
    "originCode": "JP",
    "images": [],
    "size": "medium",
    "lifespan": "15-18 years",
    "temperament_en": ["Active", "Vocal", "Friendly", "Intelligent", "Playful"],
    "temperament_el": ["Δραστήρια", "Φωνακλού", "Φιλική", "Έξυπνη", "Παιχνιδιάρα"],
    "description_en": "The Japanese Bobtail has a distinctive short, pom-pom-like tail that is unique to each cat. The breed has been in Japan for centuries and is considered a symbol of good luck. They have a slender build, high cheekbones, and can be short or longhaired. Japanese Bobtails are active, vocal, and friendly. They have a wide range of vocalizations and enjoy interactive play. They are people-oriented and adapt well to family life.",
    "description_el": "Η Ιαπωνική Μπομπτέιλ έχει χαρακτηριστική κοντή, σαν pom-pom ουρά που είναι μοναδική σε κάθε γάτα. Η ράτσα υπάρχει στην Ιαπωνία εδώ και αιώνες και θεωρείται σύμβολο καλής τύχης. Έχουν λεπτή σωματότυπο, ψηλά μαγουλά και μπορεί να είναι κοντό ή μακρύτριχες. Οι Ιαπωνικές Μπομπτέιλ είναι δραστήριες, φωνητικές και φιλικές. Έχουν ευρεία γκάμα φωνητικών εκφράσεων και απολαμβάνουν το διαδραστικό παιχνίδι. Είναι προσανατολισμένες στους ανθρώπους και προσαρμόζονται καλά στην οικογενειακή ζωή.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Japanese Bobtails need weekly brushing; longhair variety needs more. They are active and need play and climbing opportunities. They are social and prefer company. Keep indoors. They enjoy learning tricks and interactive games. The bobtail is natural and does not require special care.",
    "care_el": "Οι Ιαπωνικές Μπομπτέιλ χρειάζονται εβδομαδιαίο βούρτσισμα· η μακρύτριχη ποικιλία χρειάζεται περισσότερο. Είναι δραστήριες και χρειάζονται παιχνίδι και ευκαιρίες αναρρίχησης. Είναι κοινωνικές και προτιμούν συντροφιά. Κρατήστε τις σε εσωτερικούς χώρους. Απολαμβάνουν να μαθαίνουν κόλπα και διαδραστικά παιχνίδια. Η κοντή ουρά είναι φυσική και δεν απαιτεί ειδική φροντίδα.",
    "health_en": "Japanese Bobtails are generally healthy. The bobtail is a natural mutation not linked to spinal defects (unlike Manx). No major breed-specific health issues. Good longevity. Regular veterinary care and dental care recommended.",
    "health_el": "Οι Ιαπωνικές Μπομπτέιλ είναι γενικά υγιείς. Η κοντή ουρά είναι φυσική μετάλλαξη που δεν συνδέεται με σπονδυλικά ελαττώματα (σε αντίθεση με τη Manx). Δεν υπάρχουν σοβαρά ειδικά για τη ράτσα υγειονομικά ζητήματα. Καλή μακροζωία. Συνιστώνται τακτική κτηνιατρική φροντίδα και οδοντική φροντίδα."
  },
  {
    "id": "javanese",
    "slug": "javanese",
    "name_en": "Javanese",
    "name_el": "Τζαβανήζικη",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "15-20 years",
    "temperament_en": ["Vocal", "Affectionate", "Intelligent", "Playful", "Social"],
    "temperament_el": ["Φωνακλού", "Στοργική", "Έξυπνη", "Παιχνιδιάρα", "Κοινωνική"],
    "description_en": "The Javanese is a Colorpoint Shorthair with long hair—essentially a longhaired version in non-traditional point colors. They share the Siamese/Balinese body type and personality: vocal, affectionate, intelligent, and active. Javanese cats are people-oriented and do not like to be left alone. They have a silky coat that does not mat easily. The name refers to the breed's exotic color palette, not the island of Java.",
    "description_el": "Η Τζαβανήζικη είναι Κολορπόιντ Κοντότριχη με μακρύ τρίχωμα—ουσιαστικά μακρύτριχη εκδοχή σε μη παραδοσιακά χρώματα point. Μοιράζονται το σωματότυπο και την προσωπικότητα Σιαμέζα/Μπαλινέζικη: φωνητικές, στοργικές, έξυπνες και δραστήριες. Οι Τζαβανήζικες γάτες είναι προσανατολισμένες στους ανθρώπους και δεν τους αρέσει να μένουν μόνες. Έχουν μεταξένιο τρίχωμα που δεν μπερδεύεται εύκολα. Το όνομα αναφέρεται στην εξωτική παλέτα χρωμάτων της ράτσας, όχι στο νησί της Ιάβας.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Javanese need moderate grooming—brush 2-3 times per week. They have high social and mental needs; provide play, puzzle toys, and companionship. They can be trained and enjoy leash walking. Do not leave alone for long. Provide vertical space and interactive toys.",
    "care_el": "Οι Τζαβανήζικες χρειάζονται μέτρια περιποίηση—βουρτσίζετε 2-3 φορές την εβδομάδα. Έχουν υψηλές κοινωνικές και πνευματικές ανάγκες· παρέχετε παιχνίδι, παιχνίδια παζλ και συντροφιά. Μπορούν να εκπαιδευτούν και απολαμβάνουν το περπάτημα με λουρί. Μην τις αφήνετε μόνες για μεγάλο διάστημα. Παρέχετε κάθετο χώρο και διαδραστικά παιχνίδια.",
    "health_en": "Javanese share Siamese/Balinese health profile: possible respiratory issues, PRA, amyloidosis. Generally long-lived. Dental care important. Reputable breeders screen for genetic conditions. Good overall health with proper care.",
    "health_el": "Οι Τζαβανήζικες μοιράζονται το υγειονομικό προφίλ Σιαμέζα/Μπαλινέζικη: πιθανά αναπνευστικά προβλήματα, PRA, αμυλοείδωση. Γενικά μακρόβιες. Η οδοντική φροντίδα είναι σημαντική. Οι αξιόπιστοι εκτροφείς ελέγχουν για γενετικές παθήσεις. Καλή συνολική υγεία με σωστή φροντίδα."
  },
  {
    "id": "khao-manee",
    "slug": "khao-manee",
    "name_en": "Khao Manee",
    "name_el": "Κάο Μανί",
    "type": "cat",
    "origin": "Thailand",
    "originCode": "TH",
    "images": [],
    "size": "medium",
    "lifespan": "10-12 years",
    "temperament_en": ["Affectionate", "Vocal", "Intelligent", "Playful", "Social"],
    "temperament_el": ["Στοργική", "Φωνακλού", "Έξυπνη", "Παιχνιδιάρα", "Κοινωνική"],
    "description_en": "The Khao Manee is an ancient Thai breed with a pure white coat and striking eyes—often blue, gold, or odd-eyed (one of each). The name means 'white gem'. They were treasured by Thai royalty. Khao Manees are affectionate, vocal, and intelligent. They bond strongly with their owners and enjoy being the center of attention. They are active and playful. The breed is still rare outside Thailand.",
    "description_el": "Η Κάο Μανί είναι αρχαία ταϊλανδέζικη ράτσα με αγνό λευκό τρίχωμα και εντυπωσιακά μάτια—συχνά μπλε, χρυσά ή odd-eyed (ένα από κάθε χρώμα). Το όνομα σημαίνει 'λευκό πετράδι'. Λάτρευαν από την ταϊλανδέζικη βασιλεία. Οι Κάο Μανί είναι στοργικές, φωνητικές και έξυπνες. Δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες τους και απολαμβάνουν να είναι στο κέντρο της προσοχής. Είναι δραστήριες και παιχνιδιάρες. Η ράτσα εξακολουθεί να είναι σπάνια εκτός Ταϊλάνδης.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 5, "trainability": 5, "cost_index": 5 },
    "cost_annual_usd": "$1,800-2,500",
    "care_en": "Khao Manee have short coats needing minimal grooming. They are active and need play and mental stimulation. They are very social—do not leave alone for long. Odd-eyed cats may have deafness on the blue-eyed side; monitor hearing. Keep indoors. They enjoy interactive play and learning.",
    "care_el": "Οι Κάο Μανί έχουν κοντά τριχώματα που χρειάζονται ελάχιστη περιποίηση. Είναι δραστήριες και χρειάζονται παιχνίδι και πνευματικό ερέθισμα. Είναι πολύ κοινωνικές—μην τις αφήνετε μόνες για μεγάλο διάστημα. Οι γάτες με διαφορετικά μάτια μπορεί να έχουν κώφωση στην πλευρά με μπλε μάτι· παρακολουθήστε την ακοή. Κρατήστε τις σε εσωτερικούς χώρους. Απολαμβάνουν το διαδραστικό παιχνίδι και τη μάθηση.",
    "health_en": "Odd-eyed white cats can have congenital deafness (often on the blue-eyed side). Otherwise Khao Manee are generally healthy. Small gene pool in some regions may increase certain risks. Choose breeders who health-test. Regular veterinary care recommended.",
    "health_el": "Οι λευκές γάτες με διαφορετικά μάτια μπορεί να έχουν εκ γενετής κώφωση (συχνά στην πλευρά με μπλε μάτι). Διαφορετικά οι Κάο Μανί είναι γενικά υγιείς. Ο μικρός γονιδιακός pool σε ορισμένες περιοχές μπορεί να αυξήσει ορισμένους κινδύνους. Επιλέξτε εκτροφείς που ελέγχουν την υγεία. Συνιστάται τακτική κτηνιατρική φροντίδα."
  },
  {
    "id": "korat",
    "slug": "korat",
    "name_en": "Korat",
    "name_el": "Κοράτ",
    "type": "cat",
    "origin": "Thailand",
    "originCode": "TH",
    "images": [],
    "size": "medium",
    "lifespan": "15-20 years",
    "temperament_en": ["Loyal", "Gentle", "Intelligent", "Reserved", "Affectionate"],
    "temperament_el": ["Πιστή", "Ήπια", "Έξυπνη", "Προφυλακτική", "Στοργική"],
    "description_en": "The Korat is an ancient Thai breed with a silver-blue coat and large green eyes. In Thailand they are considered symbols of good fortune. Korats are medium-sized, muscular cats with a heart-shaped face. They are loyal and form strong bonds with their families but can be reserved with strangers. They are gentle, intelligent, and sensitive to their environment. They prefer calm households.",
    "description_el": "Η Κοράτ είναι αρχαία ταϊλανδέζικη ράτσα με ασημί-μπλε τρίχωμα και μεγάλα πράσινα μάτια. Στην Ταϊλάνδη θεωρούνται σύμβολα καλής τύχης. Οι Κοράτ είναι γάτες μεσαίου μεγέθους, μυϊκές με σχήμα προσώπου σαν καρδιά. Είναι πιστές και δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους αλλά μπορεί να είναι επιφυλακτικές με αγνώστους. Είναι ήπιες, έξυπνες και ευαίσθητες στο περιβάλλον τους. Προτιμούν ήρεμα νοικοκυριά.",
    "characteristics": { "energy": 3, "grooming": 1, "friendliness": 4, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Korats have short coats needing minimal grooming. They are sensitive—avoid loud environments and provide safe spaces. They bond deeply with their people. Moderate activity; enjoy play but not hyper. Keep indoors. They may be shy with guests; allow them to approach on their terms.",
    "care_el": "Οι Κοράτ έχουν κοντά τριχώματα που χρειάζονται ελάχιστη περιποίηση. Είναι ευαίσθητες—αποφεύγετε θορυβώδη περιβάλλοντα και παρέχετε ασφαλή χώρους. Δημιουργούν βαθιούς δεσμούς με τους ανθρώπους τους. Μέτρια δραστηριότητα· απολαμβάνουν το παιχνίδι αλλά δεν είναι υπερκινητικές. Κρατήστε τις σε εσωτερικούς χώρους. Μπορεί να είναι ντροπαλές με τους επισκέπτες· επιτρέψτε τους να προσεγγίσουν με τους δικούς τους όρους.",
    "health_en": "Korats are generally healthy and long-lived. GM1 and GM2 gangliosidosis have been reported in some lines; reputable breeders test. No other major breed-specific issues. Sensitive to anesthesia in some individuals. Regular veterinary care recommended.",
    "health_el": "Οι Κοράτ είναι γενικά υγιείς και μακρόβιες. Οι γαγγλιοσιδώσεις GM1 και GM2 έχουν αναφερθεί σε ορισμένες σειρές· οι αξιόπιστοι εκτροφείς ελέγχουν. Δεν υπάρχουν άλλα σοβαρά ειδικά για τη ράτσα ζητήματα. Ευαισθησία σε αναισθησία σε ορισμένα άτομα. Συνιστάται τακτική κτηνιατρική φροντίδα."
  },
  {
    "id": "kurilian-bobtail",
    "slug": "kurilian-bobtail",
    "name_en": "Kurilian Bobtail",
    "name_el": "Κουριλιανή Μπομπτέιλ",
    "type": "cat",
    "origin": "Russia",
    "originCode": "RU",
    "images": [],
    "size": "medium",
    "lifespan": "15-20 years",
    "temperament_en": ["Friendly", "Calm", "Intelligent", "Adaptable", "Loyal"],
    "temperament_el": ["Φιλική", "Ήρεμη", "Έξυπνη", "Προσαρμοστική", "Πιστή"],
    "description_en": "The Kurilian Bobtail is a natural breed from Russia's Kuril Islands with a short, pom-pom or curved tail. They have a robust build and can be short or longhaired. Kurilian Bobtails are friendly, calm, and intelligent. They are good hunters and adaptable to different environments. They bond with their families and get along with children and other pets. The tail is flexible and unique to each cat.",
    "description_el": "Η Κουριλιανή Μπομπτέιλ είναι φυσική ράτσα από τα νησιά Κουρίλ της Ρωσίας με κοντή, pom-pom ή κυρτή ουρά. Έχουν εύρωστη σωματότυπο και μπορεί να είναι κοντό ή μακρύτριχες. Οι Κουριλιανές Μπομπτέιλ είναι φιλικές, ήρεμες και έξυπνες. Είναι καλές κυνηγόγατες και προσαρμόζονται σε διαφορετικά περιβάλλοντα. Δημιουργούν δεσμούς με τις οικογένειές τους και τα πάνε καλά με παιδιά και άλλα κατοικίδια. Η ουρά είναι ευέλικτη και μοναδική σε κάθε γάτα.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Kurilian Bobtails need weekly brushing; longhair variety more often. They are active and enjoy play and climbing. They adapt to indoor life with enrichment. Provide scratching posts and toys. They are generally low-maintenance and easygoing. Keep indoors or in secure outdoor enclosure.",
    "care_el": "Οι Κουριλιανές Μπομπτέιλ χρειάζονται εβδομαδιαίο βούρτσισμα· η μακρύτριχη ποικιλία πιο συχνά. Είναι δραστήριες και απολαμβάνουν το παιχνίδι και την αναρρίχηση. Προσαρμόζονται στη ζωή σε εσωτερικούς χώρους με εμπλουτισμό. Παρέχετε ξυστρά και παιχνίδια. Είναι γενικά εύκολες στη συντήρηση και χαλαρές. Κρατήστε τις σε εσωτερικούς χώρους ή σε ασφαλές εξωτερικό χώρο.",
    "health_en": "Kurilian Bobtails are generally healthy. The bobtail is a natural mutation not associated with spinal defects. No major breed-specific health issues reported. Good longevity. Regular veterinary care and preventive care recommended.",
    "health_el": "Οι Κουριλιανές Μπομπτέιλ είναι γενικά υγιείς. Η κοντή ουρά είναι φυσική μετάλλαξη που δεν σχετίζεται με σπονδυλικά ελαττώματα. Δεν έχουν αναφερθεί σοβαρά ειδικά για τη ράτσα υγειονομικά ζητήματα. Καλή μακροζωία. Συνιστώνται τακτική κτηνιατρική φροντίδα και προληπτική φροντίδα."
  },
  {
    "id": "laperm",
    "slug": "laperm",
    "name_en": "LaPerm",
    "name_el": "Λα Περμ",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Affectionate", "Curious", "Gentle", "Playful", "Social"],
    "temperament_el": ["Στοργική", "Περίεργη", "Ήπια", "Παιχνιδιάρα", "Κοινωνική"],
    "description_en": "The LaPerm has a unique curly or wavy coat that can be short or long. The breed arose from a spontaneous mutation in Oregon in 1982. LaPerms are affectionate, curious cats that love to be with their people. They have a medium build and can be any color. They are gentle and get along well with children and other pets. The coat varies in curl intensity and may change with seasons.",
    "description_el": "Η Λα Περμ έχει μοναδικό σγουρό ή κυματιστό τρίχωμα που μπορεί να είναι κοντό ή μακρύ. Η ράτσα προέκυψε από αυθόρμητη μετάλλαξη στο Όρεγκον το 1982. Οι Λα Περμ είναι στοργικές, περίεργες γάτες που αγαπούν να είναι με τους ανθρώπους τους. Έχουν μέτρια σωματότυπο και μπορεί να είναι οποιοδήποτε χρώμα. Είναι ήπιες και τα πάνε καλά με παιδιά και άλλα κατοικίδια. Το τρίχωμα ποικίλλει σε ένταση σγουριών και μπορεί να αλλάζει με τις εποχές.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "LaPerms need regular grooming to prevent matting—brush several times per week. The curl can be delicate; use gentle combs. They are active and enjoy play. They are people-oriented and prefer company. Keep indoors. The coat may need more care when long.",
    "care_el": "Οι Λα Περμ χρειάζονται τακτική περιποίηση για πρόληψη μπερδέματος—βουρτσίζετε αρκετές φορές την εβδομάδα. Το σγουρί μπορεί να είναι εύθραυστο· χρησιμοποιείτε απαλά χτένια. Είναι δραστήριες και απολαμβάνουν το παιχνίδι. Είναι προσανατολισμένες στους ανθρώπους και προτιμούν συντροφιά. Κρατήστε τις σε εσωτερικούς χώρους. Το τρίχωμα μπορεί να χρειάζεται περισσότερη φροντίδα όταν είναι μακρύ.",
    "health_en": "LaPerms are generally healthy. No known breed-specific genetic disorders. The curly coat mutation does not affect health. Regular veterinary care recommended. Generally robust and long-lived.",
    "health_el": "Οι Λα Περμ είναι γενικά υγιείς. Δεν υπάρχουν γνωστές ειδικές για τη ράτσα γενετικές διαταραχές. Η μετάλλαξη του σγουρού τριχώματος δεν επηρεάζει την υγεία. Συνιστάται τακτική κτηνιατρική φροντίδα. Γενικά εύρωστες και μακρόβιες."
  },
  {
    "id": "lykoi",
    "slug": "lykoi",
    "name_en": "Lykoi",
    "name_el": "Λύκοι",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Active", "Loyal", "Curious", "Playful", "Intelligent"],
    "temperament_el": ["Δραστήρια", "Πιστή", "Περίεργη", "Παιχνιδιάρα", "Έξυπνη"],
    "description_en": "The Lykoi, or 'werewolf cat', has a unique appearance due to a natural mutation causing partial hairlessness and a roan pattern—they lack undercoat in places, giving a patchy, wolf-like look. They originated from natural mutations in domestic shorthairs. Lykois are active, loyal, and curious. They bond strongly with their owners and have a high prey drive. Their appearance can change with shedding cycles.",
    "description_el": "Η Λύκοι, ή 'γάτα λυκάνθρωπος', έχει μοναδική εμφάνιση λόγω φυσικής μετάλλαξης που προκαλεί μερική ατριχία και ροάν σχέδιο—στερώνται υποτρίχωμα σε σημεία, δίνοντας ανομοιόμορφη, λυκική εμφάνιση. Προέκυψαν από φυσικές μεταλλάξεις σε οικόσιτες κοντότριχες. Οι Λύκοι είναι δραστήριες, πιστές και περίεργες. Δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες τους και έχουν υψηλό ένστικτο θηρεύματος. Η εμφάνισή τους μπορεί να αλλάζει με κύκλους πέσιμο τριχών.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 4, "trainability": 4, "cost_index": 5 },
    "cost_annual_usd": "$1,800-2,500",
    "care_en": "Lykoi need minimal grooming; skin may be oily in areas with less hair—occasional bath or wipe. They sunburn easily; keep indoors or protect from sun. They are very active and need play and mental stimulation. Provide warm spots when they shed. Nail and ear care as needed.",
    "care_el": "Οι Λύκοι χρειάζονται ελάχιστη περιποίηση· το δέρμα μπορεί να είναι λιπαρό σε περιοχές με λιγότερα τρίχωμα—περιστασιακό μπάνιο ή σκούπισμα. Κάνουν εύκολα ηλιακό έγκαυμα· κρατήστε τις σε εσωτερικούς χώρους ή προστατέψτε από τον ήλιο. Είναι πολύ δραστήριες και χρειάζονται παιχνίδι και πνευματικό ερέθισμα. Παρέχετε ζεστά σημεία όταν ρίχνουν τρίχωμα. Φροντίδα νυχιών και αυτιών όταν χρειάζεται.",
    "health_en": "Lykoi are generally healthy. The mutation does not cause known health problems. Skin should be monitored for sun damage and dryness. No major breed-specific issues reported. Ensure breeder health testing. Regular veterinary care recommended.",
    "health_el": "Οι Λύκοι είναι γενικά υγιείς. Η μετάλλαξη δεν προκαλεί γνωστά υγειονομικά προβλήματα. Το δέρμα πρέπει να παρακολουθείται για ηλιακή βλάβη και ξηρότητα. Δεν έχουν αναφερθεί σοβαρά ειδικά για τη ράτσα ζητήματα. Βεβαιωθείτε για έλεγχο υγείας από τον εκτροφέα. Συνιστάται τακτική κτηνιατρική φροντίδα."
  },
  {
    "id": "manx",
    "slug": "manx",
    "name_en": "Manx",
    "name_el": "Μανξ",
    "type": "cat",
    "origin": "Isle of Man",
    "originCode": "IM",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Playful", "Loyal", "Intelligent", "Calm", "Adaptable"],
    "temperament_el": ["Παιχνιδιάρα", "Πιστή", "Έξυπνη", "Ήρεμη", "Προσαρμοστική"],
    "description_en": "The Manx is known for being tailless or having a very short tail, originating from the Isle of Man. They have a rounded appearance, double coat, and sturdy build. Manx cats are playful, loyal, and intelligent—they often enjoy fetching and can be quite dog-like. They are good jumpers and climbers despite the lack of tail. They bond closely with their families.",
    "description_el": "Η Μανξ είναι γνωστή για την απουσία ουράς ή την πολύ κοντή ουρά, με καταγωγή από το Νησί του Μαν. Έχουν στρογγυλή εμφάνιση, διπλό τρίχωμα και εύρωστη σωματότυπο. Οι γάτες Μανξ είναι παιχνιδιάρες, πιστές και έξυπνες—συχνά απολαμβάνουν το φέτσ και μπορεί να είναι αρκετά σαν σκύλος. Είναι καλές στο άλμα και την αναρρίχηση παρά την έλλειψη ουράς. Δημιουργούν στενούς δεσμούς με τις οικογένειές τους.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Manx need weekly brushing. They are active and need play and climbing. Avoid breeding two tailless Manx together (risk of Manx syndrome). Keep indoors. They adapt well to family life. Provide scratching posts and toys.",
    "care_el": "Οι Μανξ χρειάζονται εβδομαδιαίο βούρτσισμα. Είναι δραστήριες και χρειάζονται παιχνίδι και αναρρίχηση. Αποφεύγετε την εκτροφή δύο αούρων Μανξ μαζί (κίνδυνος συνδρόμου Manx). Κρατήστε τις σε εσωτερικούς χώρους. Προσαρμόζονται καλά στην οικογενειακή ζωή. Παρέχετε ξυστρά και παιχνίδια.",
    "health_en": "Manx syndrome (spinal/neurological defects) can occur when two tailless cats are bred—reputable breeders avoid this. Arthritis in tail area possible in stumpy/longy. Otherwise generally healthy. Choose breeders who test and avoid at-risk matings.",
    "health_el": "Το σύνδρομο Manx (σπονδυλικά/νευρολογικά ελαττώματα) μπορεί να εμφανιστεί όταν εκτρέφονται δύο αούρες γάτες—οι αξιόπιστοι εκτροφείς το αποφεύγουν. Η αρθρίτιδα στην περιοχή της ουράς πιθανή σε stumpy/longy. Διαφορετικά γενικά υγιείς. Επιλέξτε εκτροφείς που ελέγχουν και αποφεύγουν ζευγαρώματα υψηλού κινδύνου."
  },
  {
    "id": "munchkin",
    "slug": "munchkin",
    "name_en": "Munchkin",
    "name_el": "Μάντσκιν",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Playful", "Friendly", "Curious", "Outgoing", "Affectionate"],
    "temperament_el": ["Παιχνιδιάρα", "Φιλική", "Περίεργη", "Εξωστρεφής", "Στοργική"],
    "description_en": "The Munchkin is known for its short legs due to a natural genetic mutation. They have a normal-sized body with noticeably shorter legs. Munchkins are playful, friendly, and curious—they run and play actively despite their stature. They come in all coat lengths and colors. They are outgoing and get along well with families and other pets. They sit up on their haunches in a characteristic 'rabbit sit'.",
    "description_el": "Η Μάντσκιν είναι γνωστή για τα κοντά της πόδια λόγω φυσικής γενετικής μετάλλαξης. Έχουν σώμα κανονικού μεγέθους με αισθητά κοντότερα πόδια. Οι Μάντσκιν είναι παιχνιδιάρες, φιλικές και περίεργες—τρέχουν και παίζουν ενεργά παρά το μέγεθός τους. Έρχονται σε όλα τα μήκη και χρώματα τριχώματος. Είναι εξωστρεφείς και τα πάνε καλά με οικογένειες και άλλα κατοικίδια. Κάθονται στα πίσω πόδια τους με χαρακτηριστικό 'κάθισμα κουνελιού'.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Munchkins need grooming based on coat length—shorthair weekly, longhair more often. They are active and need play; they can jump but not as high. Keep furniture and food accessible. They are social and prefer company. Keep indoors. Monitor for lordosis or pectus excavatum in some lines.",
    "care_el": "Οι Μάντσκιν χρειάζονται περιποίηση ανάλογα με το μήκος τριχώματος—κοντότριχη εβδομαδιαίως, μακρύτριχη πιο συχνά. Είναι δραστήριες και χρειάζονται παιχνίδι· μπορούν να πηδήξουν αλλά όχι τόσο ψηλά. Κρατήστε έπιπλα και τροφή προσβάσιμα. Είναι κοινωνικές και προτιμούν συντροφιά. Κρατήστε τις σε εσωτερικούς χώρους. Παρακολουθήστε για lordώση ή pectus excavatum σε ορισμένες σειρές.",
    "health_en": "Munchkins can be prone to lordosis (curvature of spine) and pectus excavatum in some lines; choose breeders who screen. Osteoarthritis may occur earlier in life due to short legs. Otherwise generally healthy. No evidence that short legs cause widespread mobility problems when bred responsibly.",
    "health_el": "Οι Μάντσκιν μπορεί να είναι επιρρεπείς σε lordώση (καμπούρα σπονδύλων) και pectus excavatum σε ορισμένες σειρές· επιλέξτε εκτροφείς που ελέγχουν. Η οστεοαρθρίτιδα μπορεί να εμφανιστεί νωρίτερα στη ζωή λόγω των κοντών ποδιών. Διαφορετικά γενικά υγιείς. Δεν υπάρχουν στοιχεία ότι τα κοντά πόδια προκαλούν ευρεία προβλήματα κινητικότητας όταν εκτρέφονται υπεύθυνα."
  },
  {
    "id": "nebelung",
    "slug": "nebelung",
    "name_en": "Nebelung",
    "name_el": "Νεμπελούνγκ",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "15-18 years",
    "temperament_en": ["Gentle", "Reserved", "Loyal", "Quiet", "Affectionate"],
    "temperament_el": ["Ήπια", "Προφυλακτική", "Πιστή", "Ήσυχη", "Στοργική"],
    "description_en": "The Nebelung is the longhaired version of the Russian Blue—a medium-sized cat with a silvery-blue semi-long coat and green eyes. The breed was developed in the 1980s in the US. Nebelungs are gentle, reserved with strangers but devoted to their families. They are quiet and prefer calm environments. They are loyal and form strong bonds with their owners. The coat is soft and requires regular grooming.",
    "description_el": "Η Νεμπελούνγκ είναι η μακρύτριχη εκδοχή της Ρωσικής Μπλε—γάτα μεσαίου μεγέθους με ασημί-μπλε ημι-μακρύ τρίχωμα και πράσινα μάτια. Η ράτσα αναπτύχθηκε τη δεκαετία του 1980 στις ΗΠΑ. Οι Νεμπελούνγκ είναι ήπιες, επιφυλακτικές με αγνώστους αλλά αφοσιωμένες στις οικογένειές τους. Είναι ήσυχες και προτιμούν ήρεμα περιβάλλοντα. Είναι πιστές και δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες τους. Το τρίχωμα είναι μαλακό και απαιτεί τακτική περιποίηση.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 4, "trainability": 3, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Nebelungs need regular brushing 2-3 times per week to prevent matting. They are sensitive and prefer quiet households. They bond with one or two people. Provide safe spaces. They enjoy play but are not hyperactive. Keep indoors. Socialize gently from a young age.",
    "care_el": "Οι Νεμπελούνγκ χρειάζονται τακτικό βούρτσισμα 2-3 φορές την εβδομάδα για πρόληψη μπερδέματος. Είναι ευαίσθητες και προτιμούν ήσυχα νοικοκυριά. Δημιουργούν δεσμούς με ένα ή δύο άτομα. Παρέχετε ασφαλή χώρους. Απολαμβάνουν το παιχνίδι αλλά δεν είναι υπερκινητικές. Κρατήστε τις σε εσωτερικούς χώρους. Κοινωνικοποιήστε απαλά από μικρή ηλικία.",
    "health_en": "Nebelungs are generally healthy like Russian Blues. No major breed-specific issues. They may be sensitive to stress. Regular veterinary care and dental care recommended. Good longevity with proper care.",
    "health_el": "Οι Νεμπελούνγκ είναι γενικά υγιείς όπως οι Ρωσικές Μπλε. Δεν υπάρχουν σοβαρά ειδικά για τη ράτσα ζητήματα. Μπορεί να είναι ευαίσθητες στο άγχος. Συνιστώνται τακτική κτηνιατρική φροντίδα και οδοντική φροντίδα. Καλή μακροζωία με σωστή φροντίδα."
  },
  {
    "id": "ocicat",
    "slug": "ocicat",
    "name_en": "Ocicat",
    "name_el": "Οσικάτ",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-18 years",
    "temperament_en": ["Active", "Friendly", "Intelligent", "Outgoing", "Playful"],
    "temperament_el": ["Δραστήρια", "Φιλική", "Έξυπνη", "Εξωστρεφής", "Παιχνιδιάρα"],
    "description_en": "The Ocicat was bred to look like a small wild ocelot but has no wild blood—it is a mix of Siamese, Abyssinian, and American Shorthair. They have a spotted coat in various colors. Ocicats are active, friendly, and intelligent. They are outgoing and get along with everyone including dogs. They enjoy learning tricks and walking on a leash. They are people-oriented and do not like to be left alone.",
    "description_el": "Η Οσικάτ εκτράφηκε να μοιάζει με μικρή άγρια οσελότα αλλά δεν έχει άγριο αίμα—είναι μείγμα Σιαμέζα, Αβυσσινιανής και Αμερικανικής Κοντότριχης. Έχουν ριγέ τρίχωμα σε διάφορα χρώματα. Οι Οσικάτ είναι δραστήριες, φιλικές και έξυπνες. Είναι εξωστρεφείς και τα πάνε καλά με όλους συμπεριλαμβανομένων των σκύλων. Απολαμβάνουν να μαθαίνουν κόλπα και να περπατούν με λουρί. Είναι προσανατολισμένες στους ανθρώπους και δεν τους αρέσει να μένουν μόνες.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Ocicats have short coats needing minimal grooming. They are very active and need daily play and mental stimulation. They enjoy puzzle toys and learning. They can be trained to walk on a leash. Do not leave alone for long. Provide climbing structures and interactive toys. Keep indoors.",
    "care_el": "Οι Οσικάτ έχουν κοντά τριχώματα που χρειάζονται ελάχιστη περιποίηση. Είναι πολύ δραστήριες και χρειάζονται καθημερινό παιχνίδι και πνευματικό ερέθισμα. Απολαμβάνουν παιχνίδια παζλ και μάθηση. Μπορούν να εκπαιδευτούν να περπατούν με λουρί. Μην τις αφήνετε μόνες για μεγάλο διάστημα. Παρέχετε δομές αναρρίχησης και διαδραστικά παιχνίδια. Κρατήστε τις σε εσωτερικούς χώρους.",
    "health_en": "Ocicats may be prone to hypertrophic cardiomyopathy and renal amyloidosis in some lines. Reputable breeders screen. Generally healthy and long-lived. Dental care important. No wild blood means no hybrid health concerns.",
    "health_el": "Οι Οσικάτ μπορεί να είναι επιρρεπείς σε υπερτροφική μυοκαρδιοπάθεια και νεφρική αμυλοείδωση σε ορισμένες σειρές. Οι αξιόπιστοι εκτροφείς ελέγχουν. Γενικά υγιείς και μακρόβιες. Η οδοντική φροντίδα είναι σημαντική. Η απουσία άγριου αίματος σημαίνει απουσία υβριδικών υγειονομικών ανησυχιών."
  },
  {
    "id": "oriental-longhair",
    "slug": "oriental-longhair",
    "name_en": "Oriental Longhair",
    "name_el": "Ανατολική Μακρύτριχη",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Vocal", "Affectionate", "Intelligent", "Active", "Social"],
    "temperament_el": ["Φωνακλού", "Στοργική", "Έξυπνη", "Δραστήρια", "Κοινωνική"],
    "description_en": "The Oriental Longhair is the longhaired version of the Oriental Shorthair—same sleek body, large ears, and wedge-shaped head but with a flowing coat. They come in over 300 color and pattern combinations. Orientals are vocal, affectionate, and intelligent. They are active and need attention and play. They bond strongly with their owners and do not like to be left alone.",
    "description_el": "Η Ανατολική Μακρύτριχη είναι η μακρύτριχη εκδοχή της Ανατολικής Κοντότριχης—ίδιο γλαφυρό σώμα, μεγάλα αυτιά και σφηνοειδές κεφάλι αλλά με ρέον τρίχωμα. Έρχονται σε πάνω από 300 συνδυασμούς χρωμάτων και σχεδίων. Οι Ανατολικές είναι φωνητικές, στοργικές και έξυπνες. Είναι δραστήριες και χρειάζονται προσοχή και παιχνίδι. Δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες τους και δεν τους αρέσει να μένουν μόνες.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Oriental Longhairs need brushing 2-3 times per week; the coat is fine and can mat. They have high social and mental needs. Provide play, puzzle toys, and companionship. They can be trained. Do not leave alone for long. Keep indoors.",
    "care_el": "Οι Ανατολικές Μακρύτριχες χρειάζονται βούρτσισμα 2-3 φορές την εβδομάδα· το τρίχωμα είναι λεπτό και μπορεί να μπερδεύεται. Έχουν υψηλές κοινωνικές και πνευματικές ανάγκες. Παρέχετε παιχνίδι, παιχνίδια παζλ και συντροφιά. Μπορούν να εκπαιδευτούν. Μην τις αφήνετε μόνες για μεγάλο διάστημα. Κρατήστε τις σε εσωτερικούς χώρους.",
    "health_en": "Oriental Longhairs share Oriental Shorthair health profile: possible amyloidosis, respiratory issues in some lines. Generally healthy. Dental care important. Reputable breeders screen. Good longevity with proper care.",
    "health_el": "Οι Ανατολικές Μακρύτριχες μοιράζονται το υγειονομικό προφίλ Ανατολικής Κοντότριχης: πιθανή αμυλοείδωση, αναπνευστικά ζητήματα σε ορισμένες σειρές. Γενικά υγιείς. Η οδοντική φροντίδα είναι σημαντική. Οι αξιόπιστοι εκτροφείς ελέγχουν. Καλή μακροζωία με σωστή φροντίδα."
  },
  {
    "id": "oriental-shorthair",
    "slug": "oriental-shorthair",
    "name_en": "Oriental Shorthair",
    "name_el": "Ανατολική Κοντότριχη",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Vocal", "Affectionate", "Intelligent", "Active", "Curious"],
    "temperament_el": ["Φωνακλού", "Στοργική", "Έξυπνη", "Δραστήρια", "Περίεργη"],
    "description_en": "The Oriental Shorthair is essentially a Siamese in non-pointed colors and patterns—sleek body, large ears, almond eyes, and a wide variety of solid, shaded, and tabby colors. They are vocal, affectionate, and highly intelligent. Orientals are active and need mental and physical stimulation. They bond strongly with their owners and want to be involved in everything. They do not like to be left alone.",
    "description_el": "Η Ανατολική Κοντότριχη είναι ουσιαστικά Σιαμέζα σε μη pointed χρώματα και σχέδια—γλαφυρό σώμα, μεγάλα αυτιά, αμυγδαλωτά μάτια και μεγάλη ποικιλία ομοιόχρωμων, σκιασμένων και ριγέ χρωμάτων. Είναι φωνητικές, στοργικές και εξαιρετικά έξυπνες. Οι Ανατολικές είναι δραστήριες και χρειάζονται πνευματικό και σωματικό ερέθισμα. Δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες τους και θέλουν να εμπλέκονται σε όλα. Δεν τους αρέσει να μένουν μόνες.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 5, "trainability": 5, "cost_index": 2 },
    "cost_annual_usd": "$600-900",
    "care_en": "Oriental Shorthairs have minimal grooming needs. They have high social and mental needs—play, puzzle toys, and companionship essential. They can be trained and enjoy leash walking. Do not leave alone for long. Provide vertical space and interactive toys. Keep indoors.",
    "care_el": "Οι Ανατολικές Κοντότριχες έχουν ελάχιστες ανάγκες περιποίησης. Έχουν υψηλές κοινωνικές και πνευματικές ανάγκες—παιχνίδι, παιχνίδια παζλ και συντροφιά απαραίτητα. Μπορούν να εκπαιδευτούν και απολαμβάνουν το περπάτημα με λουρί. Μην τις αφήνετε μόνες για μεγάλο διάστημα. Παρέχετε κάθετο χώρο και διαδραστικά παιχνίδια. Κρατήστε τις σε εσωτερικούς χώρους.",
    "health_en": "Oriental Shorthairs may be prone to amyloidosis, respiratory issues, and dental problems. Generally healthy and long-lived. Reputable breeders screen. Dental care important. Good overall health with proper care.",
    "health_el": "Οι Ανατολικές Κοντότριχες μπορεί να είναι επιρρεπείς σε αμυλοείδωση, αναπνευστικά ζητήματα και οδοντικά προβλήματα. Γενικά υγιείς και μακρόβιες. Οι αξιόπιστοι εκτροφείς ελέγχουν. Η οδοντική φροντίδα είναι σημαντική. Καλή συνολική υγεία με σωστή φροντίδα."
  },
  {
    "id": "peterbald",
    "slug": "peterbald",
    "name_en": "Peterbald",
    "name_el": "Πίτερμπαλντ",
    "type": "cat",
    "origin": "Russia",
    "originCode": "RU",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Affectionate", "Intelligent", "Curious", "Social", "Energetic"],
    "temperament_el": ["Στοργική", "Έξυπνη", "Περίεργη", "Κοινωνική", "Ενεργητική"],
    "description_en": "The Peterbald was developed in Russia by crossing Donskoy with Oriental Shorthair. They can be hairless, have a peach fuzz coat, or short coat. They have an elegant, slender build and large ears. Peterbalds are affectionate, intelligent, and curious. They are social and bond strongly with their families. They need warmth when hairless and are indoor-only cats. They are active and enjoy play.",
    "description_el": "Η Πίτερμπαλντ αναπτύχθηκε στη Ρωσία διασταυρώνοντας Ντόνσκoϊ με Ανατολική Κοντότριχη. Μπορεί να είναι ατρίχωστες, να έχουν τρίχωμα ροδάκινου ή κοντό τρίχωμα. Έχουν κομψή, λεπτή σωματότυπο και μεγάλα αυτιά. Οι Πίτερμπαλντ είναι στοργικές, έξυπνες και περίεργες. Είναι κοινωνικές και δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους. Χρειάζονται ζεστασιά όταν είναι ατρίχωστες και είναι γάτες μόνο εσωτερικού χώρου. Είναι δραστήριες και απολαμβάνουν το παιχνίδι.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 5, "trainability": 5, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Hairless Peterbalds need bathing and skin care; coated varieties need less. Protect from sun and cold. They are active and need play. Keep indoors. Nail and ear care regularly. Provide warm bedding. Skin can be oily in hairless cats.",
    "care_el": "Οι ατρίχωστες Πίτερμπαλντ χρειάζονται μπάνιο και δερματική φροντίδα· οι ποικιλίες με τρίχωμα χρειάζονται λιγότερο. Προστατέψτε από τον ήλιο και το κρύο. Είναι δραστήριες και χρειάζονται παιχνίδι. Κρατήστε τις σε εσωτερικούς χώρους. Τακτική φροντίδα νυχιών και αυτιών. Παρέχετε ζεστά κρεβάτια. Το δέρμα μπορεί να είναι λιπαρό σε ατρίχωστες γάτες.",
    "health_en": "Peterbalds are generally healthy. Skin care important for hairless—sunburn and dryness. Some may have dental issues. No major breed-specific genetic disorders. Regular veterinary care recommended. Sensitive to temperature extremes.",
    "health_el": "Οι Πίτερμπαλντ είναι γενικά υγιείς. Η δερματική φροντίδα είναι σημαντική για τις ατρίχωστες—ηλιακό έγκαυμα και ξηρότητα. Ορισμένες μπορεί να έχουν οδοντικά προβλήματα. Δεν υπάρχουν σοβαρές ειδικές για τη ράτσα γενετικές διαταραχές. Συνιστάται τακτική κτηνιατρική φροντίδα. Ευαισθησία σε ακραίες θερμοκρασίες."
  },
  {
    "id": "pixie-bob",
    "slug": "pixie-bob",
    "name_en": "Pixie-Bob",
    "name_el": "Πίξι-Μπομπ",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "13-15 years",
    "temperament_en": ["Loyal", "Gentle", "Dog-like", "Playful", "Calm"],
    "temperament_el": ["Πιστή", "Ήπια", "Σαν σκύλος", "Παιχνιδιάρα", "Ήρεμη"],
    "description_en": "The Pixie-Bob is bred to resemble the North American bobcat—with a short tail, spotted coat, and sturdy build. They are a natural-looking breed (no wild blood in certified lines). Pixie-Bobs are loyal, gentle, and often described as dog-like: they may learn to fetch, walk on a leash, and respond to their names. They are calm but enjoy play. They bond strongly with their families.",
    "description_el": "Η Πίξι-Μπομπ εκτρέφεται να μοιάζει με τη βορειοαμερικανική bobcat—με κοντή ουρά, ριγέ τρίχωμα και εύρωστη σωματότυπο. Είναι ράτσα με φυσική εμφάνιση (χωρίς άγριο αίμα σε πιστοποιημένες σειρές). Οι Πίξι-Μπομπ είναι πιστές, ήπιες και συχνά περιγράφονται ως σαν σκύλος: μπορεί να μάθουν φέτσ, να περπατούν με λουρί και να αντιδρούν στα ονόματά τους. Είναι ήρεμες αλλά απολαμβάνουν το παιχνίδι. Δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 5, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Pixie-Bobs need weekly brushing. They are active and enjoy play and climbing. They often enjoy fetch and leash walking. They bond with their families. Keep indoors or in secure enclosure. Provide scratching posts and toys. They are generally easygoing.",
    "care_el": "Οι Πίξι-Μπομπ χρειάζονται εβδομαδιαίο βούρτσισμα. Είναι δραστήριες και απολαμβάνουν το παιχνίδι και την αναρρίχηση. Συχνά απολαμβάνουν το φέτσ και το περπάτημα με λουρί. Δημιουργούν δεσμούς με τις οικογένειές τους. Κρατήστε τις σε εσωτερικούς χώρους ή σε ασφαλές χώρο. Παρέχετε ξυστρά και παιχνίδια. Είναι γενικά χαλαρές.",
    "health_en": "Pixie-Bobs are generally healthy. Hypertrophic cardiomyopathy has been reported; breeders may screen. No wild blood reduces hybrid health concerns. The short tail is natural. Regular veterinary care recommended. Good longevity.",
    "health_el": "Οι Πίξι-Μπομπ είναι γενικά υγιείς. Η υπερτροφική μυοκαρδιοπάθεια έχει αναφερθεί· οι εκτροφείς μπορεί να ελέγχουν. Η απουσία άγριου αίματος μειώνει τις υβριδικές υγειονομικές ανησυχίες. Η κοντή ουρά είναι φυσική. Συνιστάται τακτική κτηνιατρική φροντίδα. Καλή μακροζωία."
  },
  {
    "id": "ragamuffin",
    "slug": "ragamuffin",
    "name_en": "RagaMuffin",
    "name_el": "ΡάγαΜάφιν",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "12-16 years",
    "temperament_en": ["Docile", "Affectionate", "Gentle", "Calm", "Friendly"],
    "temperament_el": ["Πειθήνια", "Στοργική", "Ήπια", "Ήρεμη", "Φιλική"],
    "description_en": "The RagaMuffin is related to the Ragdoll but was developed with a broader gene pool and more coat colors and patterns. They are large, heavy-boned cats with a sweet expression and semi-long coat. RagaMuffins are docile, affectionate, and gentle—they go limp when held like Ragdolls. They are calm and get along well with children and other pets. They are people-oriented and enjoy being part of the family.",
    "description_el": "Η ΡάγαΜάφιν σχετίζεται με την Ράγκντολ αλλά αναπτύχθηκε με ευρύτερο γονιδιακό pool και περισσότερα χρώματα και σχέδια τριχώματος. Είναι μεγάλες, βαριόκοστες γάτες με γλυκιά έκφραση και ημι-μακρύ τρίχωμα. Οι ΡάγαΜάφιν είναι πειθήνιες, στοργικές και ήπιες—γίνονται πλαδαρές όταν τις κρατούν σαν τις Ράγκντολ. Είναι ήρεμες και τα πάνε καλά με παιδιά και άλλα κατοικίδια. Είναι προσανατολισμένες στους ανθρώπους και απολαμβάνουν να είναι μέρος της οικογένειας.",
    "characteristics": { "energy": 2, "grooming": 3, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "RagaMuffins need brushing 2-3 times per week to prevent matting. They are indoor cats and should not go outside unsupervised. They are not highly active but enjoy gentle play. They are social and prefer company. Provide comfortable resting spots. Monitor weight—they can gain easily.",
    "care_el": "Οι ΡάγαΜάφιν χρειάζονται βούρτσισμα 2-3 φορές την εβδομάδα για πρόληψη μπερδέματος. Είναι γάτες εσωτερικού χώρου και δεν πρέπει να βγαίνουν έξω χωρίς επίβλεψη. Δεν είναι ιδιαίτερα δραστήριες αλλά απολαμβάνουν απαλό παιχνίδι. Είναι κοινωνικές και προτιμούν συντροφιά. Παρέχετε άνετα σημεία ξεκούρασης. Παρακολουθήστε το βάρος—μπορούν να πάρουν εύκολα.",
    "health_en": "RagaMuffins may be prone to hypertrophic cardiomyopathy and polycystic kidney disease like Ragdolls. Reputable breeders screen. Obesity is a concern—monitor diet. Generally healthy with good longevity when from responsible breeders.",
    "health_el": "Οι ΡάγαΜάφιν μπορεί να είναι επιρρεπείς σε υπερτροφική μυοκαρδιοπάθεια και πολυκυστική νεφροπάθεια όπως οι Ράγκντολ. Οι αξιόπιστοι εκτροφείς ελέγχουν. Η παχυσαρκία είναι ανησυχία—παρακολουθήστε τη δίαιτα. Γενικά υγιείς με καλή μακροζωία όταν προέρχονται από υπεύθυνους εκτροφείς."
  },
  {
    "id": "russian-white",
    "slug": "russian-white",
    "name_en": "Russian White",
    "name_el": "Ρωσική Λευκή",
    "type": "cat",
    "origin": "Australia",
    "originCode": "AU",
    "images": [],
    "size": "medium",
    "lifespan": "15-20 years",
    "temperament_en": ["Gentle", "Reserved", "Loyal", "Quiet", "Affectionate"],
    "temperament_el": ["Ήπια", "Προφυλακτική", "Πιστή", "Ήσυχη", "Στοργική"],
    "description_en": "The Russian White was developed in Australia by crossing Russian Blues with white domestic cats. They have the same body type and temperament as the Russian Blue but with a pure white coat and green or blue-green eyes. Russian Whites are gentle, reserved with strangers but devoted to their families. They are quiet and prefer calm environments. They are recognized mainly in Australia.",
    "description_el": "Η Ρωσική Λευκή αναπτύχθηκε στην Αυστραλία διασταυρώνοντας Ρωσικές Μπλε με λευκές οικόσιτες γάτες. Έχουν το ίδιο σωματότυπο και temperament με τη Ρωσική Μπλε αλλά με αγνό λευκό τρίχωμα και πράσινα ή μπλε-πράσινα μάτια. Οι Ρωσικές Λευκές είναι ήπιες, επιφυλακτικές με αγνώστους αλλά αφοσιωμένες στις οικογένειές τους. Είναι ήσυχες και προτιμούν ήρεμα περιβάλλοντα. Αναγνωρίζονται κυρίως στην Αυστραλία.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Russian Whites need weekly brushing. They are sensitive and prefer quiet households. Provide safe spaces. They bond with their people. Moderate activity. Keep indoors. Socialize gently. They may be shy with guests.",
    "care_el": "Οι Ρωσικές Λευκές χρειάζονται εβδομαδιαίο βούρτσισμα. Είναι ευαίσθητες και προτιμούν ήσυχα νοικοκυριά. Παρέχετε ασφαλή χώρους. Δημιουργούν δεσμούς με τους ανθρώπους τους. Μέτρια δραστηριότητα. Κρατήστε τις σε εσωτερικούς χώρους. Κοινωνικοποιήστε απαλά. Μπορεί να είναι ντροπαλές με τους επισκέπτες.",
    "health_en": "Russian Whites are generally healthy like Russian Blues. No major breed-specific issues. May be sensitive to stress. Regular veterinary care recommended. Good longevity. Deafness possible in some white cats—breeders may screen.",
    "health_el": "Οι Ρωσικές Λευκές είναι γενικά υγιείς όπως οι Ρωσικές Μπλε. Δεν υπάρχουν σοβαρά ειδικά για τη ράτσα ζητήματα. Μπορεί να είναι ευαίσθητες στο άγχος. Συνιστάται τακτική κτηνιατρική φροντίδα. Καλή μακροζωία. Κώφωση πιθανή σε ορισμένες λευκές γάτες—οι εκτροφείς μπορεί να ελέγχουν."
  },
  {
    "id": "savannah",
    "slug": "savannah",
    "name_en": "Savannah",
    "name_el": "Σαβάνα",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "12-20 years",
    "temperament_en": ["Active", "Curious", "Intelligent", "Loyal", "Energetic"],
    "temperament_el": ["Δραστήρια", "Περίεργη", "Έξυπνη", "Πιστή", "Ενεργητική"],
    "description_en": "The Savannah is a hybrid of the serval and domestic cat, resulting in a tall, spotted cat with large ears. Early generations (F1-F2) are larger and more exotic; later generations are more domestic in size and temperament. Savannahs are active, curious, and intelligent. They often enjoy water and can be trained to walk on a leash. They need experienced owners and plenty of space and enrichment. Some regions restrict ownership of early generations.",
    "description_el": "Η Σαβάνα είναι υβρίδιο της serval και οικόσιτης γάτας, με αποτέλεσμα ψηλή, ριγέ γάτα με μεγάλα αυτιά. Οι πρώιμες γενιές (F1-F2) είναι μεγαλύτερες και πιο εξωτικές· οι μεταγενέστερες γενιές είναι πιο οικόσιτες σε μέγεθος και temperament. Οι Σαβάνα είναι δραστήριες, περίεργες και έξυπνες. Συχνά απολαμβάνουν το νερό και μπορούν να εκπαιδευτούν να περπατούν με λουρί. Χρειάζονται έμπειρους ιδιοκτήτες και αρκετό χώρο και εμπλουτισμό. Ορισμένες περιοχές περιορίζουν την κατοχή πρώιμων γενεών.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 5, "cost_index": 5 },
    "cost_annual_usd": "$1,800-2,500",
    "care_en": "Savannahs have short coats needing minimal grooming. They require extensive daily play, large cat trees, and mental stimulation. Many need leash walking or secure outdoor enclosure. High protein diet often recommended. Not suitable for small apartments or first-time cat owners. Check local laws on hybrid ownership.",
    "care_el": "Οι Σαβάνα έχουν κοντά τριχώματα που χρειάζονται ελάχιστη περιποίηση. Απαιτούν εκτενή καθημερινό παιχνίδι, μεγάλα δέντρα γάτας και πνευματικό ερέθισμα. Πολλές χρειάζονται περπάτημα με λουρί ή ασφαλές εξωτερικό χώρο. Δίαιτα υψηλής πρωτεΐνης συχνά συνιστάται. Δεν είναι κατάλληλες για μικρά διαμερίσματα ή πρωτοεμφανιζόμενους ιδιοκτήτες γατών. Ελέγξτε τους τοπικούς νόμους για κατοχή υβριδίων.",
    "health_en": "Savannahs are generally healthy. Hybrid vigor may apply in later generations. Some may have sensitive digestion; high-quality diet important. Check breeder health testing. Local regulations may require permits or restrict early-generation ownership.",
    "health_el": "Οι Σαβάνα είναι γενικά υγιείς. Το υβριδικό σθένος μπορεί να ισχύει σε μεταγενέστερες γενιές. Ορισμένες μπορεί να έχουν ευαίσθητη πέψη· η υψηλής ποιότητας δίαιτα είναι σημαντική. Ελέγξτε τον έλεγχο υγείας του εκτροφέα. Οι τοπικοί κανονισμοί μπορεί να απαιτούν άδειες ή να περιορίζουν την κατοχή πρώιμων γενεών."
  },
  {
    "id": "selkirk-rex",
    "slug": "selkirk-rex",
    "name_en": "Selkirk Rex",
    "name_el": "Σέλκιρκ Ρεξ",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Patient", "Affectionate", "Calm", "Playful", "Friendly"],
    "temperament_el": ["Υπομονετική", "Στοργική", "Ήρεμη", "Παιχνιδιάρα", "Φιλική"],
    "description_en": "The Selkirk Rex has a distinct curly coat that can be short or long—unlike other rex breeds, they have all three hair types (guard, awn, down), so the coat is full but curly. The breed arose from a single kitten in Montana in 1987. Selkirk Rex cats are patient, affectionate, and calm. They get along well with children and other pets. They have a round, solid build and a sweet expression.",
    "description_el": "Η Σέλκιρκ Ρεξ έχει ξεχωριστό σγουρό τρίχωμα που μπορεί να είναι κοντό ή μακρύ—σε αντίθεση με άλλες ράτσες rex, έχουν και τα τρία είδη τριχών (αμυντικές, ενδιάμεσες, υποτρίχωμα), επομένως το τρίχωμα είναι πλήρες αλλά σγουρό. Η ράτσα προέκυψε από ένα μόνο γατάκι στο Μοντάνα το 1987. Οι γάτες Σέλκιρκ Ρεξ είναι υπομονετικές, στοργικές και ήρεμες. Τα πάνε καλά με παιδιά και άλλα κατοικίδια. Έχουν στρογγυλή, εύρωστη σωματότυπο και γλυκιά έκφραση.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Selkirk Rex need regular grooming—the curly coat can mat, especially in longhair. Brush several times per week. They are calm but enjoy play. They are patient and tolerant. Keep indoors. The coat may need gentle handling to avoid damaging curls.",
    "care_el": "Οι Σέλκιρκ Ρεξ χρειάζονται τακτική περιποίηση—το σγουρό τρίχωμα μπορεί να μπερδεύεται, ειδικά στη μακρύτριχη. Βουρτσίζετε αρκετές φορές την εβδομάδα. Είναι ήρεμες αλλά απολαμβάνουν το παιχνίδι. Είναι υπομονετικές και ανεκτικές. Κρατήστε τις σε εσωτερικούς χώρους. Το τρίχωμα μπορεί να χρειάζεται απαλό χειρισμό για να μην καταστραφούν τα σγουριά.",
    "health_en": "Selkirk Rex are generally healthy. Hypertrophic cardiomyopathy has been reported in some lines; breeders may screen. Polycystic kidney disease possible (Persian in ancestry). No other major breed-specific issues. Regular veterinary care recommended.",
    "health_el": "Οι Σέλκιρκ Ρεξ είναι γενικά υγιείς. Η υπερτροφική μυοκαρδιοπάθεια έχει αναφερθεί σε ορισμένες σειρές· οι εκτροφείς μπορεί να ελέγχουν. Η πολυκυστική νεφροπάθεια πιθανή (Περσική στην καταγωγή). Δεν υπάρχουν άλλα σοβαρά ειδικά για τη ράτσα ζητήματα. Συνιστάται τακτική κτηνιατρική φροντίδα."
  },
  {
    "id": "serengeti",
    "slug": "serengeti",
    "name_en": "Serengeti",
    "name_el": "Σεγκενέτι",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Active", "Curious", "Friendly", "Intelligent", "Outgoing"],
    "temperament_el": ["Δραστήρια", "Περίεργη", "Φιλική", "Έξυπνη", "Εξωστρεφής"],
    "description_en": "The Serengeti was developed by crossing Bengal and Oriental Shorthair to create a wild-looking spotted cat without wild genes. They have long legs, large ears, and a spotted or marbled coat. Serengetis are active, curious, and friendly. They are outgoing and get along with families and other pets. They are intelligent and enjoy play and interaction. They have a sleek, athletic build.",
    "description_el": "Η Σεγκενέτι αναπτύχθηκε διασταυρώνοντας Βεγγάλη και Ανατολική Κοντότριχη για να δημιουργήσει ριγέ γάτα με άγρια εμφάνιση χωρίς άγρια γονίδια. Έχουν μακριά πόδια, μεγάλα αυτιά και ριγέ ή μαρμαρωτό τρίχωμα. Οι Σεγκενέτι είναι δραστήριες, περίεργες και φιλικές. Είναι εξωστρεφείς και τα πάνε καλά με οικογένειες και άλλα κατοικίδια. Είναι έξυπνες και απολαμβάνουν το παιχνίδι και την αλληλεπίδραση. Έχουν γλαφυρή, αθλητική σωματότυπο.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 5, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Serengetis have short coats needing minimal grooming. They are very active and need daily play and climbing. Provide puzzle toys and interactive play. They can learn tricks and may enjoy leash walking. Keep indoors. They bond with their families and prefer company.",
    "care_el": "Οι Σεγκενέτι έχουν κοντά τριχώματα που χρειάζονται ελάχιστη περιποίηση. Είναι πολύ δραστήριες και χρειάζονται καθημερινό παιχνίδι και αναρρίχηση. Παρέχετε παιχνίδια παζλ και διαδραστικό παιχνίδι. Μπορούν να μάθουν κόλπα και μπορεί να απολαμβάνουν το περπάτημα με λουρί. Κρατήστε τις σε εσωτερικούς χώρους. Δημιουργούν δεσμούς με τις οικογένειές τους και προτιμούν συντροφιά.",
    "health_en": "Serengetis are generally healthy. No wild blood reduces hybrid concerns. May inherit Bengal or Oriental health considerations in some lines. Regular veterinary care recommended. Generally robust breed.",
    "health_el": "Οι Σεγκενέτι είναι γενικά υγιείς. Η απουσία άγριου αίματος μειώνει τις υβριδικές ανησυχίες. Μπορεί να κληρονομήσουν υγειονομικές επιλογές Βεγγάλης ή Ανατολικής σε ορισμένες σειρές. Συνιστάται τακτική κτηνιατρική φροντίδα. Γενικά εύρωστη ράτσα."
  },
  {
    "id": "siberian",
    "slug": "siberian",
    "name_en": "Siberian",
    "name_el": "Σιβηρική",
    "type": "cat",
    "origin": "Russia",
    "originCode": "RU",
    "images": [],
    "size": "large",
    "lifespan": "12-15 years",
    "temperament_en": ["Friendly", "Playful", "Loyal", "Calm", "Affectionate"],
    "temperament_el": ["Φιλική", "Παιχνιδιάρα", "Πιστή", "Ήρεμη", "Στοργική"],
    "description_en": "The Siberian is a natural Russian breed with a long, dense triple coat that is water-resistant. They are large, muscular cats that developed in the harsh climate of Siberia. Siberians are friendly, playful, and loyal. They are often considered hypoallergenic—some allergy sufferers react less to them due to lower levels of the Fel d 1 protein. They get along well with children and other pets. They are agile and enjoy climbing.",
    "description_el": "Η Σιβηρική είναι φυσική ρωσική ράτσα με μακρύ, πυκνό τριπλό τρίχωμα που είναι αδιάβροχο. Είναι μεγάλες, μυϊκές γάτες που αναπτύχθηκαν στο σκληρό κλίμα της Σιβηρίας. Οι Σιβηρικές είναι φιλικές, παιχνιδιάρες και πιστές. Συχνά θεωρούνται υποαλλεργιογόνες—ορισμένοι αλλεργικοί αντιδρούν λιγότερο σε αυτές λόγω χαμηλότερων επιπέδων της πρωτεΐνης Fel d 1. Τα πάνε καλά με παιδιά και άλλα κατοικίδια. Είναι ευκίνητες και απολαμβάνουν την αναρρίχηση.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Siberians need regular brushing 2-3 times per week; more during shedding season. The coat can mat if neglected. They are active and need play and climbing. They enjoy water sometimes. Keep indoors. Provide sturdy cat trees. They bond with their families.",
    "care_el": "Οι Σιβηρικές χρειάζονται τακτικό βούρτσισμα 2-3 φορές την εβδομάδα· περισσότερο κατά την εποχή πέσιμο τριχών. Το τρίχωμα μπορεί να μπερδεύεται αν αμεληθεί. Είναι δραστήριες και χρειάζονται παιχνίδι και αναρρίχηση. Απολαμβάνουν το νερό μερικές φορές. Κρατήστε τις σε εσωτερικούς χώρους. Παρέχετε γερά δέντρα γάτας. Δημιουργούν δεσμούς με τις οικογένειές τους.",
    "health_en": "Siberians are generally healthy. Hypertrophic cardiomyopathy has been reported; breeders may screen. No major breed-specific issues. Some claim hypoallergenic qualities—individual reactions vary. Regular veterinary care recommended. Good longevity.",
    "health_el": "Οι Σιβηρικές είναι γενικά υγιείς. Η υπερτροφική μυοκαρδιοπάθεια έχει αναφερθεί· οι εκτροφείς μπορεί να ελέγχουν. Δεν υπάρχουν σοβαρά ειδικά για τη ράτσα ζητήματα. Ορισμένοι ισχυρίζονται υποαλλεργιογόνα χαρακτηριστικά—οι ατομικές αντιδράσεις ποικίλλουν. Συνιστάται τακτική κτηνιατρική φροντίδα. Καλή μακροζωία."
  },
  {
    "id": "singapura",
    "slug": "singapura",
    "name_en": "Singapura",
    "name_el": "Σινγαπούρα",
    "type": "cat",
    "origin": "Singapore",
    "originCode": "SG",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Curious", "Affectionate", "Playful", "Active", "Social"],
    "temperament_el": ["Περίεργη", "Στοργική", "Παιχνιδιάρα", "Δραστήρια", "Κοινωνική"],
    "description_en": "The Singapura is one of the smallest cat breeds, with a ticked sepia coat and large eyes. They are believed to have originated from Singapore. Singapuras are curious, affectionate, and playful. They are active and love to climb and explore. They have a big personality in a small package and bond closely with their owners. They are social and enjoy being part of family activities.",
    "description_el": "Η Σινγαπούρα είναι μία από τις μικρότερες ράτσες γατών, με ριγέ σέπια τρίχωμα και μεγάλα μάτια. Πιστεύεται ότι κατάγονται από τη Σιγκαπούρη. Οι Σινγαπούρα είναι περίεργες, στοργικές και παιχνιδιάρες. Είναι δραστήριες και αγαπούν την αναρρίχηση και την εξερεύνηση. Έχουν μεγάλη προσωπικότητα σε μικρό πακέτο και δημιουργούν στενούς δεσμούς με τους ιδιοκτήτες τους. Είναι κοινωνικές και απολαμβάνουν να είναι μέρος των οικογενειακών δραστηριοτήτων.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 5, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Singapuras have short coats needing minimal grooming. They are active and need play and climbing—provide cat trees and toys. They are social and prefer company. Keep indoors—they are small and vulnerable. They enjoy interactive play and learning.",
    "care_el": "Οι Σινγαπούρα έχουν κοντά τριχώματα που χρειάζονται ελάχιστη περιποίηση. Είναι δραστήριες και χρειάζονται παιχνίδι και αναρρίχηση—παρέχετε δέντρα γάτας και παιχνίδια. Είναι κοινωνικές και προτιμούν συντροφιά. Κρατήστε τις σε εσωτερικούς χώρους—είναι μικρές και ευάλωτες. Απολαμβάνουν το διαδραστικό παιχνίδι και τη μάθηση.",
    "health_en": "Singapuras may be prone to uterine inertia (difficulty in labor) in some lines. Otherwise generally healthy. Small size is natural. Regular veterinary care recommended. Choose breeders who prioritize health.",
    "health_el": "Οι Σινγαπούρα μπορεί να είναι επιρρεπείς σε μητρική αδράνεια (δυσκολία στον τοκετό) σε ορισμένες σειρές. Διαφορετικά γενικά υγιείς. Το μικρό μέγεθος είναι φυσικό. Συνιστάται τακτική κτηνιατρική φροντίδα. Επιλέξτε εκτροφείς που δίνουν προτεραιότητα στην υγεία."
  },
  {
    "id": "snowshoe",
    "slug": "snowshoe",
    "name_en": "Snowshoe",
    "name_el": "Σνόουσοου",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "14-19 years",
    "temperament_en": ["Friendly", "Affectionate", "Playful", "Calm", "Social"],
    "temperament_el": ["Φιλική", "Στοργική", "Παιχνιδιάρα", "Ήρεμη", "Κοινωνική"],
    "description_en": "The Snowshoe is a breed with white feet (boots) and a colorpoint pattern, created by crossing Siamese with American Shorthair. They have blue eyes and a medium build. Snowshoes are friendly, affectionate, and playful but calmer than the typical Siamese. They are social and get along with families and other pets. They are vocal but with a softer voice. They bond strongly with their owners.",
    "description_el": "Η Σνόουσοου είναι ράτσα με λευκά πόδια (μπότες) και σχέδιο colorpoint, δημιουργημένη διασταυρώνοντας Σιαμέζα με Αμερικανική Κοντότριχη. Έχουν μπλε μάτια και μέτρια σωματότυπο. Οι Σνόουσοου είναι φιλικές, στοργικές και παιχνιδιάρες αλλά πιο ήρεμες από την τυπική Σιαμέζα. Είναι κοινωνικές και τα πάνε καλά με οικογένειες και άλλα κατοικίδια. Είναι φωνητικές αλλά με πιο απαλή φωνή. Δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες τους.",
    "characteristics": { "energy": 4, "grooming": 1, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Snowshoes have short coats needing minimal grooming. They are active but not hyper—enjoy play and interaction. They are social and prefer company. Keep indoors. They can learn tricks. Provide toys and climbing. They bond with their families.",
    "care_el": "Οι Σνόουσοου έχουν κοντά τριχώματα που χρειάζονται ελάχιστη περιποίηση. Είναι δραστήριες αλλά όχι υπερκινητικές—απολαμβάνουν το παιχνίδι και την αλληλεπίδραση. Είναι κοινωνικές και προτιμούν συντροφιά. Κρατήστε τις σε εσωτερικούς χώρους. Μπορούν να μάθουν κόλπα. Παρέχετε παιχνίδια και αναρρίχηση. Δημιουργούν δεσμούς με τις οικογένειές τους.",
    "health_en": "Snowshoes may share some Siamese health considerations but are generally healthy. No major breed-specific issues. Good longevity. Regular veterinary care and dental care recommended. Reputable breeders screen for genetic conditions.",
    "health_el": "Οι Σνόουσοου μπορεί να μοιράζονται ορισμένες υγειονομικές επιλογές Σιαμέζα αλλά είναι γενικά υγιείς. Δεν υπάρχουν σοβαρά ειδικά για τη ράτσα ζητήματα. Καλή μακροζωία. Συνιστώνται τακτική κτηνιατρική φροντίδα και οδοντική φροντίδα. Οι αξιόπιστοι εκτροφείς ελέγχουν για γενετικές παθήσεις."
  },
  {
    "id": "sokoke",
    "slug": "sokoke",
    "name_en": "Sokoke",
    "name_el": "Σοκόκε",
    "type": "cat",
    "origin": "Kenya",
    "originCode": "KE",
    "images": [],
    "size": "medium",
    "lifespan": "15-20 years",
    "temperament_en": ["Active", "Intelligent", "Curious", "Loyal", "Vocal"],
    "temperament_el": ["Δραστήρια", "Έξυπνη", "Περίεργη", "Πιστή", "Φωνακλού"],
    "description_en": "The Sokoke is a rare natural breed from the Sokoke forest in Kenya. They have a distinctive blotched tabby coat that resembles tree bark. Sokokes are active, intelligent, and curious. They bond strongly with their owners and can be reserved with strangers. They are vocal and communicative. They are agile and enjoy climbing. The breed is very rare outside its development in Europe and the US.",
    "description_el": "Η Σοκόκε είναι σπάνια φυσική ράτσα από το δάσος Σοκόκε στην Κένυα. Έχουν χαρακτηριστικό μπλοτσ τάμπι τρίχωμα που μοιάζει με φλοιό δέντρου. Οι Σοκόκε είναι δραστήριες, έξυπνες και περίεργες. Δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες τους και μπορεί να είναι επιφυλακτικές με αγνώστους. Είναι φωνητικές και επικοινωνιακές. Είναι ευκίνητες και απολαμβάνουν την αναρρίχηση. Η ράτσα είναι πολύ σπάνια εκτός της ανάπτυξής της στην Ευρώπη και τις ΗΠΑ.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 4, "trainability": 4, "cost_index": 5 },
    "cost_annual_usd": "$1,800-2,500",
    "care_en": "Sokokes have short coats needing minimal grooming. They are very active and need play, climbing, and mental stimulation. They bond with their people and prefer company. Keep indoors. Provide cat trees and interactive toys. They may be shy with guests.",
    "care_el": "Οι Σοκόκε έχουν κοντά τριχώματα που χρειάζονται ελάχιστη περιποίηση. Είναι πολύ δραστήριες και χρειάζονται παιχνίδι, αναρρίχηση και πνευματικό ερέθισμα. Δημιουργούν δεσμούς με τους ανθρώπους τους και προτιμούν συντροφιά. Κρατήστε τις σε εσωτερικούς χώρους. Παρέχετε δέντρα γάτας και διαδραστικά παιχνίδια. Μπορεί να είναι ντροπαλές με τους επισκέπτες.",
    "health_en": "Sokokes are generally healthy with good longevity. No major breed-specific health issues reported. Small gene pool may require careful breeding. Regular veterinary care recommended. Rare breed—choose responsible breeders.",
    "health_el": "Οι Σοκόκε είναι γενικά υγιείς με καλή μακροζωία. Δεν έχουν αναφερθεί σοβαρά ειδικά για τη ράτσα υγειονομικά ζητήματα. Ο μικρός γονιδιακός pool μπορεί να απαιτεί προσεκτική εκτροφή. Συνιστάται τακτική κτηνιατρική φροντίδα. Σπάνια ράτσα—επιλέξτε υπεύθυνους εκτροφείς."
  },
  {
    "id": "somali",
    "slug": "somali",
    "name_en": "Somali",
    "name_el": "Σομαλή",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-16 years",
    "temperament_en": ["Playful", "Curious", "Affectionate", "Active", "Intelligent"],
    "temperament_el": ["Παιχνιδιάρα", "Περίεργη", "Στοργική", "Δραστήρια", "Έξυπνη"],
    "description_en": "The Somali is the longhaired version of the Abyssinian—same ticked coat pattern and personality but with a full, fluffy tail and ruff. They have a warm, ruddy or red coat. Somalis are playful, curious, and affectionate. They are active and love to climb and explore. They are intelligent and can get into mischief if not given enough stimulation. They bond with their families and enjoy being involved in everything.",
    "description_el": "Η Σομαλή είναι η μακρύτριχη εκδοχή της Αβυσσινιανής—ίδιο ριγέ σχέδιο τριχώματος και προσωπικότητα αλλά με πλήρη, φουντωτή ουρά και λαιμόκολλα. Έχουν ζεστό, κοκκινωπό ή κόκκινο τρίχωμα. Οι Σομαλές είναι παιχνιδιάρες, περίεργες και στοργικές. Είναι δραστήριες και αγαπούν την αναρρίχηση και την εξερεύνηση. Είναι έξυπνες και μπορούν να ασχοληθούν με αταξίες αν δεν τους δοθεί αρκετό ερέθισμα. Δημιουργούν δεσμούς με τις οικογένειές τους και απολαμβάνουν να εμπλέκονται σε όλα.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Somalis need brushing 2-3 times per week to prevent matting. They are very active and need play, climbing, and puzzle toys. They can be trained and enjoy learning. Do not leave alone for long. Keep indoors. Provide vertical space and interactive play.",
    "care_el": "Οι Σομαλές χρειάζονται βούρτσισμα 2-3 φορές την εβδομάδα για πρόληψη μπερδέματος. Είναι πολύ δραστήριες και χρειάζονται παιχνίδι, αναρρίχηση και παιχνίδια παζλ. Μπορούν να εκπαιδευτούν και απολαμβάνουν τη μάθηση. Μην τις αφήνετε μόνες για μεγάλο διάστημα. Κρατήστε τις σε εσωτερικούς χώρους. Παρέχετε κάθετο χώρο και διαδραστικό παιχνίδι.",
    "health_en": "Somalis may be prone to pyruvate kinase deficiency (PKD), progressive retinal atrophy, and renal amyloidosis like Abyssinians. Reputable breeders screen. Dental issues possible. Generally healthy with good care. Good longevity.",
    "health_el": "Οι Σομαλές μπορεί να είναι επιρρεπείς σε έλλειψη πυρουβατική κινάσης (PKD), προοδευτική ατροφία αμφιβληστροειδούς και νεφρική αμυλοείδωση όπως οι Αβυσσινιανές. Οι αξιόπιστοι εκτροφείς ελέγχουν. Οδοντικά ζητήματα πιθανά. Γενικά υγιείς με καλή φροντίδα. Καλή μακροζωία."
  },
  {
    "id": "thai",
    "slug": "thai",
    "name_en": "Thai",
    "name_el": "Ταϊλανδέζικη",
    "type": "cat",
    "origin": "Thailand",
    "originCode": "TH",
    "images": [],
    "size": "medium",
    "lifespan": "15-20 years",
    "temperament_en": ["Vocal", "Affectionate", "Social", "Intelligent", "Playful"],
    "temperament_el": ["Φωνακλού", "Στοργική", "Κοινωνική", "Έξυπνη", "Παιχνιδιάρα"],
    "description_en": "The Thai (formerly called Old-Style Siamese or Traditional Siamese) is the traditional type of Siamese with a more moderate body—not as extreme as the modern wedge-headed Siamese. They have the same color-point pattern and blue eyes. Thais are vocal, affectionate, and social. They are intelligent and enjoy interaction. They bond strongly with their owners and prefer not to be left alone. They are recognized as a separate breed in some registries.",
    "description_el": "Η Ταϊλανδέζικη (παλαιότερα ονομαζόταν Παλαιοστυλ Σιαμέζα ή Παραδοσιακή Σιαμέζα) είναι ο παραδοσιακός τύπος Σιαμέζα με πιο μέτριο σώμα—όχι τόσο ακραίο όσο η μοντέρνα σφηνοκέφαλη Σιαμέζα. Έχουν το ίδιο σχέδιο color-point και μπλε μάτια. Οι Ταϊλανδέζικες είναι φωνητικές, στοργικές και κοινωνικές. Είναι έξυπνες και απολαμβάνουν την αλληλεπίδραση. Δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες τους και προτιμούν να μην μένουν μόνες. Αναγνωρίζονται ως ξεχωριστή ράτσα σε ορισμένα μητρώα.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 5, "trainability": 5, "cost_index": 2 },
    "cost_annual_usd": "$600-900",
    "care_en": "Thais have minimal grooming needs. They have high social and mental needs—play, puzzle toys, companionship. They can be trained. Do not leave alone for long. Provide vertical space and interactive toys. Keep indoors.",
    "care_el": "Οι Ταϊλανδέζικες έχουν ελάχιστες ανάγκες περιποίησης. Έχουν υψηλές κοινωνικές και πνευματικές ανάγκες—παιχνίδι, παιχνίδια παζλ, συντροφιά. Μπορούν να εκπαιδευτούν. Μην τις αφήνετε μόνες για μεγάλο διάστημα. Παρέχετε κάθετο χώρο και διαδραστικά παιχνίδια. Κρατήστε τις σε εσωτερικούς χώρους.",
    "health_en": "Thais share Siamese health profile: possible respiratory issues, PRA, amyloidosis. Generally long-lived. The more moderate build may reduce some brachycephalic-related issues. Dental care important. Reputable breeders screen.",
    "health_el": "Οι Ταϊλανδέζικες μοιράζονται το υγειονομικό προφίλ Σιαμέζα: πιθανά αναπνευστικά προβλήματα, PRA, αμυλοείδωση. Γενικά μακρόβιες. Το πιο μέτριο σωματότυπο μπορεί να μειώσει ορισμένα βραχυκεφαλικά ζητήματα. Η οδοντική φροντίδα είναι σημαντική. Οι αξιόπιστοι εκτροφείς ελέγχουν."
  },
  {
    "id": "tonkinese",
    "slug": "tonkinese",
    "name_en": "Tonkinese",
    "name_el": "Τονκινέζικη",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "15-18 years",
    "temperament_en": ["Affectionate", "Playful", "Vocal", "Social", "Intelligent"],
    "temperament_el": ["Στοργική", "Παιχνιδιάρα", "Φωνακλού", "Κοινωνική", "Έξυπνη"],
    "description_en": "The Tonkinese is a cross between Siamese and Burmese, combining the best of both: the colorpoints and voice of the Siamese with the solid build and sweet nature of the Burmese. They have aqua or blue-green eyes and a mink-style coat. Tonkinese are affectionate, playful, and vocal but less intense than pure Siamese. They are social and get along with everyone. They bond strongly with their families.",
    "description_el": "Η Τονκινέζικη είναι διασταύρωση Σιαμέζα και Βιρμανέζικης, συνδυάζοντας το καλύτερο και των δύο: τα colorpoint και τη φωνή της Σιαμέζα με την εύρωστη σωματότυπο και τη γλυκιά φύση της Βιρμανέζικης. Έχουν γαλανοπράσινα ή μπλε-πράσινα μάτια και τρίχωμα στυλ mink. Οι Τονκινέζικες είναι στοργικές, παιχνιδιάρες και φωνητικές αλλά λιγότερο έντονες από την καθαρή Σιαμέζα. Είναι κοινωνικές και τα πάνε καλά με όλους. Δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Tonkinese have minimal grooming needs. They are active and need play and mental stimulation. They are very social—do not leave alone for long. They can be trained and enjoy tricks. Provide climbing and interactive toys. Keep indoors.",
    "care_el": "Οι Τονκινέζικες έχουν ελάχιστες ανάγκες περιποίησης. Είναι δραστήριες και χρειάζονται παιχνίδι και πνευματικό ερέθισμα. Είναι πολύ κοινωνικές—μην τις αφήνετε μόνες για μεγάλο διάστημα. Μπορούν να εκπαιδευτούν και απολαμβάνουν κόλπα. Παρέχετε αναρρίχηση και διαδραστικά παιχνίδια. Κρατήστε τις σε εσωτερικούς χώρους.",
    "health_en": "Tonkinese may inherit conditions from either parent: respiratory issues, amyloidosis from Siamese; craniofacial issues from Burmese in some lines. Generally healthy and long-lived. Reputable breeders screen. Dental care important.",
    "health_el": "Οι Τονκινέζικες μπορεί να κληρονομήσουν παθήσεις από οποιονδήποτε γονέα: αναπνευστικά ζητήματα, αμυλοείδωση από Σιαμέζα· κρανιοπροσωπικά ζητήματα από Βιρμανέζικη σε ορισμένες σειρές. Γενικά υγιείς και μακρόβιες. Οι αξιόπιστοι εκτροφείς ελέγχουν. Η οδοντική φροντίδα είναι σημαντική."
  },
  {
    "id": "toyger",
    "slug": "toyger",
    "name_en": "Toyger",
    "name_el": "Τόιγκερ",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Friendly", "Playful", "Outgoing", "Affectionate", "Calm"],
    "temperament_el": ["Φιλική", "Παιχνιδιάρα", "Εξωστρεφής", "Στοργική", "Ήρεμη"],
    "description_en": "The Toyger was bred to resemble a miniature tiger—with bold vertical stripes, round markings on the head, and an athletic build. Developed from Bengals and domestic tabbies, they have no wild blood. Toygers are friendly, playful, and outgoing. They are affectionate and get along with families and other pets. They are calm but enjoy play. The breed is still developing toward the ideal 'tiger' look.",
    "description_el": "Η Τόιγκερ εκτράφηκε να μοιάζει με μικροσκοπική τίγρη—με έντονες κάθετες ρίγες, στρογγυλά σημάδια στο κεφάλι και αθλητική σωματότυπο. Αναπτύχθηκε από Βεγγάλες και οικόσιτες ριγέ, δεν έχουν άγριο αίμα. Οι Τόιγκερ είναι φιλικές, παιχνιδιάρες και εξωστρεφείς. Είναι στοργικές και τα πάνε καλά με οικογένειες και άλλα κατοικίδια. Είναι ήρεμες αλλά απολαμβάνουν το παιχνίδι. Η ράτσα εξακολουθεί να αναπτύσσεται προς το ιδανικό 'τίγρης' look.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Toygers have short coats needing minimal grooming. They are active and enjoy play and climbing. They are social and prefer company. Keep indoors. Provide cat trees and toys. They bond with their families. Generally easygoing.",
    "care_el": "Οι Τόιγκερ έχουν κοντά τριχώματα που χρειάζονται ελάχιστη περιποίηση. Είναι δραστήριες και απολαμβάνουν το παιχνίδι και την αναρρίχηση. Είναι κοινωνικές και προτιμούν συντροφιά. Κρατήστε τις σε εσωτερικούς χώρους. Παρέχετε δέντρα γάτας και παιχνίδια. Δημιουργούν δεσμούς με τις οικογένειές τους. Γενικά χαλαρές.",
    "health_en": "Toygers are generally healthy. No wild blood. May share some Bengal health considerations in some lines. Heart murmur reported in some; breeders may screen. Regular veterinary care recommended. Good longevity.",
    "health_el": "Οι Τόιγκερ είναι γενικά υγιείς. Χωρίς άγριο αίμα. Μπορεί να μοιράζονται ορισμένες υγειονομικές επιλογές Βεγγάλης σε ορισμένες σειρές. Καρδιακός φύσημα αναφέρθηκε σε ορισμένες· οι εκτροφείς μπορεί να ελέγχουν. Συνιστάται τακτική κτηνιατρική φροντίδα. Καλή μακροζωία."
  },
  {
    "id": "turkish-angora",
    "slug": "turkish-angora",
    "name_en": "Turkish Angora",
    "name_el": "Τουρκική Αγκόρα",
    "type": "cat",
    "origin": "Turkey",
    "originCode": "TR",
    "images": [],
    "size": "medium",
    "lifespan": "12-18 years",
    "temperament_en": ["Playful", "Intelligent", "Affectionate", "Vocal", "Active"],
    "temperament_el": ["Παιχνιδιάρα", "Έξυπνη", "Στοργική", "Φωνακλού", "Δραστήρια"],
    "description_en": "The Turkish Angora is an ancient natural breed from Turkey with a silky, semi-long coat. They are most known in white with blue, amber, or odd eyes but come in many colors. Turkish Angoras are playful, intelligent, and affectionate. They are active and love to be the center of attention. They are vocal and communicative. They often enjoy water. They bond strongly with their owners. Odd-eyed white cats may have deafness on the blue-eyed side.",
    "description_el": "Η Τουρκική Αγκόρα είναι αρχαία φυσική ράτσα από την Τουρκία με μεταξένιο, ημι-μακρύ τρίχωμα. Είναι πιο γνωστές σε λευκό με μπλε, κεχριμπαρένια ή διαφορετικά μάτια αλλά έρχονται σε πολλά χρώματα. Οι Τουρκικές Αγκόρα είναι παιχνιδιάρες, έξυπνες και στοργικές. Είναι δραστήριες και αγαπούν να είναι στο κέντρο της προσοχής. Είναι φωνητικές και επικοινωνιακές. Συχνά απολαμβάνουν το νερό. Δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες τους. Οι λευκές γάτες με διαφορετικά μάτια μπορεί να έχουν κώφωση στην πλευρά με μπλε μάτι.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Turkish Angoras need brushing 2-3 times per week; the coat is silky and less prone to matting. They are very active and need play and mental stimulation. They enjoy water—some like to play in sinks. They are social and prefer company. Keep indoors. Check hearing in odd-eyed whites.",
    "care_el": "Οι Τουρκικές Αγκόρα χρειάζονται βούρτσισμα 2-3 φορές την εβδομάδα· το τρίχωμα είναι μεταξένιο και λιγότερο επιρρεπές σε μπέρδεμα. Είναι πολύ δραστήριες και χρειάζονται παιχνίδι και πνευματικό ερέθισμα. Απολαμβάνουν το νερό—ορισμένες αρέσκονται να παίζουν σε νεροχύτες. Είναι κοινωνικές και προτιμούν συντροφιά. Κρατήστε τις σε εσωτερικούς χώρους. Ελέγξτε την ακοή σε λευκές με διαφορετικά μάτια.",
    "health_en": "Turkish Angoras may be prone to hypertrophic cardiomyopathy. Ataxia has been reported in some lines (hereditary). Odd-eyed white cats can have congenital deafness. Otherwise generally healthy. Reputable breeders screen. Good longevity with care.",
    "health_el": "Οι Τουρκικές Αγκόρα μπορεί να είναι επιρρεπείς σε υπερτροφική μυοκαρδιοπάθεια. Η αταξία έχει αναφερθεί σε ορισμένες σειρές (κληρονομική). Οι λευκές γάτες με διαφορετικά μάτια μπορεί να έχουν εκ γενετής κώφωση. Διαφορετικά γενικά υγιείς. Οι αξιόπιστοι εκτροφείς ελέγχουν. Καλή μακροζωία με φροντίδα."
  },
  {
    "id": "turkish-van",
    "slug": "turkish-van",
    "name_en": "Turkish Van",
    "name_el": "Τουρκική Βαν",
    "type": "cat",
    "origin": "Turkey",
    "originCode": "TR",
    "images": [],
    "size": "large",
    "lifespan": "12-17 years",
    "temperament_en": ["Active", "Intelligent", "Playful", "Independent", "Friendly"],
    "temperament_el": ["Δραστήρια", "Έξυπνη", "Παιχνιδιάρα", "Ανεξάρτητη", "Φιλική"],
    "description_en": "The Turkish Van is known for its love of water and distinctive pattern—white body with colored head and tail (van pattern). They have a semi-long, water-resistant coat. Turkish Vans are active, intelligent, and playful. They are strong swimmers and often enjoy playing in water. They are more independent than some breeds but bond with their families. They have a sturdy, large build. They are sometimes called 'swimming cats'.",
    "description_el": "Η Τουρκική Βαν είναι γνωστή για την αγάπη της για το νερό και το χαρακτηριστικό σχέδιο—λευκό σώμα με χρωματιστό κεφάλι και ουρά (σχέδιο van). Έχουν ημι-μακρύ, αδιάβροχο τρίχωμα. Οι Τουρκικές Βαν είναι δραστήριες, έξυπνες και παιχνιδιάρες. Είναι δυνατές κολυμβήτριες και συχνά απολαμβάνουν να παίζουν στο νερό. Είναι πιο ανεξάρτητες από ορισμένες ράτσες αλλά δημιουργούν δεσμούς με τις οικογένειές τους. Έχουν εύρωστη, μεγάλη σωματότυπο. Μερικές φορές ονομάζονται 'γάτες που κολυμπούν'.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 4, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "Turkish Vans need brushing 2-3 times per week. They are very active and need play and climbing. Many enjoy water play—supervised access to sinks or shallow water. They need space. Keep indoors or in secure enclosure. Provide sturdy cat trees. They bond with their people but can be independent.",
    "care_el": "Οι Τουρκικές Βαν χρειάζονται βούρτσισμα 2-3 φορές την εβδομάδα. Είναι πολύ δραστήριες και χρειάζονται παιχνίδι και αναρρίχηση. Πολλές απολαμβάνουν το παιχνίδι με νερό—επιβλεπόμενη πρόσβαση σε νεροχύτες ή ρηχό νερό. Χρειάζονται χώρο. Κρατήστε τις σε εσωτερικούς χώρους ή σε ασφαλές χώρο. Παρέχετε γερά δέντρα γάτας. Δημιουργούν δεσμούς με τους ανθρώπους τους αλλά μπορεί να είναι ανεξάρτητες.",
    "health_en": "Turkish Vans are generally healthy. No major breed-specific issues. Some may have hereditary heart conditions—breeders may screen. Good longevity. Regular veterinary care recommended. Robust breed.",
    "health_el": "Οι Τουρκικές Βαν είναι γενικά υγιείς. Δεν υπάρχουν σοβαρά ειδικά για τη ράτσα ζητήματα. Ορισμένες μπορεί να έχουν κληρονομικές καρδιακές παθήσεις—οι εκτροφείς μπορεί να ελέγχουν. Καλή μακροζωία. Συνιστάται τακτική κτηνιατρική φροντίδα. Εύρωστη ράτσα."
  },
  {
    "id": "ukrainian-levkoy",
    "slug": "ukrainian-levkoy",
    "name_en": "Ukrainian Levkoy",
    "name_el": "Ουκρανική Λέβκοϊ",
    "type": "cat",
    "origin": "Ukraine",
    "originCode": "UA",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Gentle", "Affectionate", "Calm", "Social", "Loyal"],
    "temperament_el": ["Ήπια", "Στοργική", "Ήρεμη", "Κοινωνική", "Πιστή"],
    "description_en": "The Ukrainian Levkoy is a hairless breed with folded ears, created by crossing Donskoy with Scottish Fold. They have a slender build, wrinkled skin, and inward-folding ears. Ukrainian Levkoys are gentle, affectionate, and calm. They are social and bond with their families. They need warmth and are indoor-only cats. They are still rare outside Ukraine and Eastern Europe.",
    "description_el": "Η Ουκρανική Λέβκοϊ είναι ράτσα χωρίς τρίχωμα με διπλωμένα αυτιά, δημιουργημένη διασταυρώνοντας Ντόνσκoϊ με Σκωτσέζικη Φολντ. Έχουν λεπτή σωματότυπο, ζαρωμένο δέρμα και αυτιά που διπλώνουν προς τα μέσα. Οι Ουκρανικές Λέβκοϊ είναι ήπιες, στοργικές και ήρεμες. Είναι κοινωνικές και δημιουργούν δεσμούς με τις οικογένειές τους. Χρειάζονται ζεστασιά και είναι γάτες μόνο εσωτερικού χώρου. Εξακολουθούν να είναι σπάνιες εκτός Ουκρανίας και Ανατολικής Ευρώπης.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Ukrainian Levkoys need bathing and skin care like other hairless breeds. Protect from sun and cold. Handle folded ears gently. Keep indoors. Provide warm bedding. Nail and ear care regularly. They are calm and do not need excessive exercise.",
    "care_el": "Οι Ουκρανικές Λέβκοϊ χρειάζονται μπάνιο και δερματική φροντίδα όπως άλλες ατρίχωστες ράτσες. Προστατέψτε από τον ήλιο και το κρύο. Χειριστείτε τα διπλωμένα αυτιά απαλά. Κρατήστε τις σε εσωτερικούς χώρους. Παρέχετε ζεστά κρεβάτια. Τακτική φροντίδα νυχιών και αυτιών. Είναι ήρεμες και δεν χρειάζονται υπερβολική άσκηση.",
    "health_en": "Ukrainian Levkoys may inherit osteochondrodysplasia from Scottish Fold ancestry—folded ears are linked to cartilage issues; choose breeders who prioritize health. Skin care essential. Otherwise generally healthy. Regular veterinary care recommended.",
    "health_el": "Οι Ουκρανικές Λέβκοϊ μπορεί να κληρονομήσουν οστεοχονδροδυσπλασία από την καταγωγή Σκωτσέζικης Φολντ—τα διπλωμένα αυτιά συνδέονται με προβλήματα χόνδρου· επιλέξτε εκτροφείς που δίνουν προτεραιότητα στην υγεία. Η δερματική φροντίδα είναι απαραίτητη. Διαφορετικά γενικά υγιείς. Συνιστάται τακτική κτηνιατρική φροντίδα."
  },
  {
    "id": "york-chocolate",
    "slug": "york-chocolate",
    "name_en": "York Chocolate",
    "name_el": "Γιορκ Σοκολατέ",
    "type": "cat",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "13-15 years",
    "temperament_en": ["Affectionate", "Playful", "Gentle", "Social", "Curious"],
    "temperament_el": ["Στοργική", "Παιχνιδιάρα", "Ήπια", "Κοινωνική", "Περίεργη"],
    "description_en": "The York Chocolate was developed in New York state from a longhaired black cat and has a semi-long coat in chocolate, lilac, or chocolate-and-white. They have a medium to large build and a sweet expression. York Chocolates are affectionate, playful, and gentle. They are social and get along with families and other pets. They are curious and enjoy being involved. The breed is relatively rare.",
    "description_el": "Η Γιορκ Σοκολατέ αναπτύχθηκε στην πολιτεία της Νέας Υόρκης από μακρύτριχη μαύρη γάτα και έχει ημι-μακρύ τρίχωμα σε σοκολατί, λιλά ή σοκολατί-και-λευκό. Έχουν μέτρια έως μεγάλη σωματότυπο και γλυκιά έκφραση. Οι Γιορκ Σοκολατέ είναι στοργικές, παιχνιδιάρες και ήπιες. Είναι κοινωνικές και τα πάνε καλά με οικογένειες και άλλα κατοικίδια. Είναι περίεργες και απολαμβάνουν να εμπλέκονται. Η ράτσα είναι σχετικά σπάνια.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$900-1,200",
    "care_en": "York Chocolates need brushing 2-3 times per week to prevent matting. They are active and enjoy play. They are social and prefer company. Keep indoors. Provide toys and climbing. They bond with their families. Generally easygoing.",
    "care_el": "Οι Γιορκ Σοκολατέ χρειάζονται βούρτσισμα 2-3 φορές την εβδομάδα για πρόληψη μπερδέματος. Είναι δραστήριες και απολαμβάνουν το παιχνίδι. Είναι κοινωνικές και προτιμούν συντροφιά. Κρατήστε τις σε εσωτερικούς χώρους. Παρέχετε παιχνίδια και αναρρίχηση. Δημιουργούν δεσμούς με τις οικογένειές τους. Γενικά χαλαρές.",
    "health_en": "York Chocolates are generally healthy. No major breed-specific issues reported. Small gene pool—choose responsible breeders. Regular veterinary care recommended. Good longevity with proper care.",
    "health_el": "Οι Γιορκ Σοκολατέ είναι γενικά υγιείς. Δεν έχουν αναφερθεί σοβαρά ειδικά για τη ράτσα ζητήματα. Μικρός γονιδιακός pool—επιλέξτε υπεύθυνους εκτροφείς. Συνιστάται τακτική κτηνιατρική φροντίδα. Καλή μακροζωία με σωστή φροντίδα."
  }
]
