[
  {
    "id": "bichon-frise",
    "slug": "bichon-frise",
    "name_en": "Bichon Frise",
    "name_el": "Μπισόν Φριζέ",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "small",
    "lifespan": "14-15 years",
    "temperament_en": ["Cheerful", "Playful", "Affectionate", "Gentle", "Curious"],
    "temperament_el": ["Χαρούμενος", "Παιχνιδιάρης", "Στοργικός", "Ήπιος", "Περίεργος"],
    "description_en": "The Bichon Frise is a small, cheerful companion breed with a fluffy white coat and dark, expressive eyes. Originally from the Mediterranean, they became favorites of French and Spanish nobility. Bichons are playful, affectionate dogs that thrive on human company and adapt well to apartment living. Their hypoallergenic coat and merry disposition make them popular family pets.",
    "description_el": "Το Bichon Frise είναι μια μικρή, εύθυμη ράτσα συντρόφου με χνουδωτό λευκό τρίχωμα και σκούρα, εκφραστικά μάτια. Καταγόταν από τη Μεσόγειο και έγιναν αγαπημένα της γαλλικής και ισπανικής αριστοκρατίας. Είναι παιχνιδιάρικα, στοργικά σκυλιά που ευδοκιμούν με την ανθρώπινη συντροφιά και προσαρμόζονται καλά στη διαβίωση σε διαμέρισμα.",
    "characteristics": { "energy": 3, "grooming": 5, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Bichon Frise requires regular professional grooming every 4-6 weeks and daily brushing to prevent matting. They need moderate daily exercise and enjoy playtime and short walks. They bond closely with their families and can develop separation anxiety if left alone too long. Dental care is important for small breeds.",
    "care_el": "Το Bichon Frise απαιτεί τακτική επαγγελματική περιποίηση κάθε 4-6 εβδομάδες και καθημερινό βούρτσισμα. Χρειάζονται μέτρια καθημερινή άσκηση. Η φροντίδα των δοντιών είναι σημαντική για τις μικρές ράτσες.",
    "health_en": "Bichon Frise may be prone to patellar luxation, bladder stones, allergies, and cataracts. Some lines have hip dysplasia or heart issues. Regular grooming helps spot skin problems early. A responsible breeder will screen for common conditions.",
    "health_el": "Το Bichon Frise μπορεί να είναι επιρρεπές σε εξάρθρωση επιγονατίδας, λίθους κύστης, αλλεργίες και καταρράκτη. Οι τακτικοί έλεγχοι και η περιποίηση βοηθούν στην πρόωρη ανίχνευση προβλημάτων."
  },
  {
    "id": "bolognese",
    "slug": "bolognese",
    "name_en": "Bolognese",
    "name_el": "Μπολονέζε",
    "type": "dog",
    "origin": "Italy",
    "originCode": "IT",
    "images": [],
    "size": "small",
    "lifespan": "12-14 years",
    "temperament_en": ["Devoted", "Calm", "Gentle", "Reserved", "Playful"],
    "temperament_el": ["Αφοσιωμένος", "Ήρεμος", "Ήπιος", "Συνεσταλμένος", "Παιχνιδιάρης"],
    "description_en": "The Bolognese is a small Italian companion dog with a distinctive fluffy white coat. Bred in Bologna for centuries, they were treasured by nobility across Europe. Bolognese are devoted, calm dogs that form strong bonds with their owners. They are gentle with children and get along well with other pets. Their low-shedding coat and adaptable nature suit many homes.",
    "description_el": "Το Bolognese είναι ένα μικρό ιταλικό σκυλί συντρόφου με χαρακτηριστικό χνουδωτό λευκό τρίχωμα. Εκτράφηκε στη Μπολόνια για αιώνες και τιμήθηκε από την αριστοκρατία σε όλη την Ευρώπη. Είναι αφοσιωμένα, ήρεμα σκυλιά που δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες τους.",
    "characteristics": { "energy": 2, "grooming": 4, "friendliness": 4, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Bolognese need regular brushing to prevent mats in their long coat; many owners opt for professional grooming. They require moderate daily exercise and enjoy short walks and indoor play. They are sensitive and respond best to gentle, positive training. They do not like to be left alone for long periods.",
    "care_el": "Το Bolognese χρειάζεται τακτικό βούρτσισμα για να αποφευχθούν οι κόμποι. Χρειάζονται μέτρια καθημερινή άσκηση. Απαντούν καλύτερα σε ήπια, θετική εκπαίδευση. Δεν πρέπει να μένουν μόνα για μεγάλες περιόδους.",
    "health_en": "Bolognese are generally healthy but can be prone to patellar luxation, eye conditions, and dental issues. Some may have skin sensitivities. Regular vet checkups and good dental care support longevity. Choose a breeder who screens for hereditary conditions.",
    "health_el": "Το Bolognese είναι γενικά υγιή αλλά μπορεί να είναι επιρρεπές σε εξάρθρωση επιγονατίδας και οφθαλμολογικά θέματα. Οι τακτικοί κτηνιατρικοί έλεγχοι και η καλή φροντίδα δοντιών υποστηρίζουν τη μακροζωία."
  },
  {
    "id": "boston-terrier",
    "slug": "boston-terrier",
    "name_en": "Boston Terrier",
    "name_el": "Μπόστον Τεριέ",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "small",
    "lifespan": "11-13 years",
    "temperament_en": ["Friendly", "Lively", "Intelligent", "Affectionate", "Comical"],
    "temperament_el": ["Φιλικός", "Ζωηρός", "Έξυπνος", "Στοργικός", "Κωμικός"],
    "description_en": "The Boston Terrier is an American breed developed in Boston in the late 19th century. Known as the 'American Gentleman' for their tuxedo-like markings, they are friendly, lively companions. Boston Terriers are intelligent and eager to please, making them relatively easy to train. They get along well with children, other dogs, and even cats. Their compact size and moderate exercise needs suit urban living.",
    "description_el": "Το Boston Terrier είναι αμερικανική ράτσα που αναπτύχθηκε στη Βοστόνη στα τέλη του 19ου αιώνα. Γνωστό ως ο 'Αμερικανός Τζέντλεμαν' για τα σημάδια που μοιάζουν με smoking, είναι φιλικοί, ζωηροί σύντροφοι. Είναι έξυπνα και πρόθυμα να ευχαριστούν. Το συμπαγές μέγεθός τους τα καθιστά κατάλληλα για αστική διαβίωση.",
    "characteristics": { "energy": 3, "grooming": 1, "friendliness": 5, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Boston Terriers need daily walks and play but are sensitive to extreme heat and cold due to their short muzzle. Their smooth coat requires minimal grooming. Keep facial wrinkles clean and dry to prevent infection. They can snore and may have flatulence. Avoid overfeeding to prevent obesity.",
    "care_el": "Τα Boston Terrier χρειάζονται καθημερινές βόλτες και παιχνίδι αλλά είναι ευαίσθητα σε ακραίες θερμοκρασίες. Το λείο τρίχωμά τους απαιτεί ελάχιστη περιποίηση. Οι ρυτίδες του προσώπου πρέπει να μένουν καθαρές και ξηρές.",
    "health_en": "Boston Terriers are brachycephalic and can have breathing difficulties, especially in heat. They may be prone to patellar luxation, cataracts, and heart murmurs. Eye injuries are possible due to prominent eyes. Choose a breeder who prioritizes healthy airways and eyes.",
    "health_el": "Τα Boston Terrier είναι βραχυκεφαλικά και μπορεί να έχουν αναπνευστικές δυσκολίες. Μπορεί να είναι επιρρεπή σε εξάρθρωση επιγονατίδας και παθήσεις ματιών. Η επιλογή εκτροφέα που δίνει προτεραιότητα στην υγεία είναι σημαντική."
  },
  {
    "id": "brussels-griffon",
    "slug": "brussels-griffon",
    "name_en": "Brussels Griffon",
    "name_el": "Μπρισσέλ Γκριφόν",
    "type": "dog",
    "origin": "Belgium",
    "originCode": "BE",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Alert", "Curious", "Loyal", "Sensitive", "Comical"],
    "temperament_el": ["Επαγρύπνος", "Περίεργος", "Πιστός", "Ευαίσθητος", "Κωμικός"],
    "description_en": "The Brussels Griffon is a small Belgian breed with a distinctive human-like expression. They come in rough (wire-haired) and smooth coats. Griffons are alert, curious, and deeply loyal to their families. They can be reserved with strangers and may not tolerate rough handling. Their big personality fits in a tiny package, and they thrive as devoted companions.",
    "description_el": "Το Brussels Griffon είναι μικρή βελγική ράτσα με χαρακτηριστική ανθρώπινη έκφραση. Έρχονται σε τραχύ (συρτό) και λείο τρίχωμα. Είναι επαγρύπνων, περίεργα και βαθιά πιστά. Μπορεί να είναι επιφυλακτικά με αγνώστους. Η μεγάλη προσωπικότητά τους ταιριάζει σε μικρό πακέτο.",
    "characteristics": { "energy": 3, "grooming": 3, "friendliness": 3, "trainability": 3, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Brussels Griffons need regular brushing; rough-coated dogs may need hand-stripping or clipping. They require moderate daily exercise and mental stimulation. They are sensitive and do best with positive, patient training. Dental care is important. They bond strongly and prefer not to be left alone for long.",
    "care_el": "Τα Brussels Griffon χρειάζονται τακτικό βούρτσισμα· τα τραχύτριχα μπορεί να χρειάζονται hand-stripping. Χρειάζονται μέτρια άσκηση και νοητική διέγερση. Η φροντίδα δοντιών είναι σημαντική.",
    "health_en": "Brussels Griffons can be prone to eye problems (including lens luxation and cataracts), patellar luxation, and respiratory issues due to short muzzle. Syringomyelia may occur in some lines. Regular vet checkups and eye screenings are recommended. Avoid breeding dogs with exaggerated features.",
    "health_el": "Τα Brussels Griffon μπορεί να είναι επιρρεπή σε προβλήματα ματιών, εξάρθρωση επιγονατίδας και αναπνευστικά θέματα. Οι τακτικοί κτηνιατρικοί και οφθαλμολογικοί έλεγχοι συνιστώνται."
  },
  {
    "id": "cavalier-king-charles-spaniel",
    "slug": "cavalier-king-charles-spaniel",
    "name_en": "Cavalier King Charles Spaniel",
    "name_el": "Καβαλιέ Κινγκ Τσάρλς Σπάνιελ",
    "type": "dog",
    "origin": "United Kingdom",
    "originCode": "GB",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Affectionate", "Gentle", "Friendly", "Graceful", "Adaptable"],
    "temperament_el": ["Στοργικός", "Ήπιος", "Φιλικός", "Κομψός", "Προσαρμοστικός"],
    "description_en": "The Cavalier King Charles Spaniel is a small, graceful spaniel bred to be the ideal lap dog and companion. They combine the elegance of a toy breed with the sporting spirit of a spaniel. Cavaliers are affectionate, gentle, and get along with everyone—children, other pets, and strangers. They are adaptable to various living situations and thrive on human companionship.",
    "description_el": "Το Cavalier King Charles Spaniel είναι μικρό, κομψό σπάνιελ εκτρεφόμενο ως ιδανικό σκυλί αγκαλιάς και σύντροφος. Συνδυάζει την κομψότητα μιας toy ράτσας με το πνεύμα σπάνιελ. Είναι στοργικά, ήπια και τα πάνε καλά με όλους. Προσαρμόζονται σε διάφορες συνθήκες διαβίωσης.",
    "characteristics": { "energy": 3, "grooming": 3, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Cavaliers need daily walks and enjoy playtime; they also love to cuddle. Their silky coat requires regular brushing a few times per week. Ear cleaning is important to prevent infections. They are eager to please and train well with positive methods. They should not be left alone for extended periods.",
    "care_el": "Τα Cavalier χρειάζονται καθημερινές βόλτες και απολαμβάνουν το παιχνίδι. Το μεταξωτό τρίχωμά τους απαιτεί τακτικό βούρτσισμα. Ο καθαρισμός των αυτιών είναι σημαντικός. Εκπαιδεύονται εύκολα με θετικές μεθόδους.",
    "health_en": "Cavalier King Charles Spaniels are prone to mitral valve disease (heart condition), which is very common in the breed. Syringomyelia (Chiari-like malformation) is another serious concern. Patellar luxation and eye conditions may occur. Responsible breeders screen for heart and neurological issues. Regular vet checkups are essential.",
    "health_el": "Τα Cavalier King Charles Spaniel είναι επιρρεπή σε νόσο της μιτροειδούς βαλβίδας. Η συριγγομυελία είναι επίσης σοβαρή ανησυχία. Οι υπεύθυνοι εκτροφείς ελέγχουν για καρδιακά και νευρολογικά θέματα. Οι τακτικοί κτηνιατρικοί έλεγχοι είναι απαραίτητοι."
  },
  {
    "id": "chinese-crested",
    "slug": "chinese-crested",
    "name_en": "Chinese Crested",
    "name_el": "Κινέζικο Κρεστέντ",
    "type": "dog",
    "origin": "China",
    "originCode": "CN",
    "images": [],
    "size": "small",
    "lifespan": "13-18 years",
    "temperament_en": ["Affectionate", "Playful", "Alert", "Lively", "Graceful"],
    "temperament_el": ["Στοργικός", "Παιχνιδιάρης", "Επαγρύπνος", "Ζωηρός", "Κομψός"],
    "description_en": "The Chinese Crested comes in two varieties: Hairless (with hair on head, tail, and feet) and Powderpuff (fully coated). They are affectionate, playful companions that bond deeply with their owners. Despite the name, their exact origin is debated; they became popular as ship dogs. They are alert, lively, and often good with children and other pets when socialized.",
    "description_el": "Το Chinese Crested έρχεται σε δύο ποικιλίες: Άτριχο (με τρίχωμα στο κεφάλι, την ουρά και τα πόδια) και Powderpuff (πλήρως τριχωτό). Είναι στοργικά, παιχνιδιάρικα σκυλιά που δένονται βαθιά με τους ιδιοκτήτες τους. Είναι επαγρύπνων, ζωηρά και συχνά καλά με παιδιά και άλλα κατοικίδια.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 4, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Hairless Chinese Crested need sunscreen and moisturizer on exposed skin; they can get sunburned or chilled. Powderpuff variety needs regular brushing. Both need dental care as they are prone to tooth loss. They enjoy moderate exercise and indoor play. They are sensitive to cold and heat.",
    "care_el": "Το άτριχο Chinese Crested χρειάζεται αντιηλιακό και ενυδατικό στο δέρμα. Η ποικιλία Powderpuff χρειάζεται τακτικό βούρτσισμα. Η φροντίδα δοντιών είναι σημαντική. Είναι ευαίσθητα στο κρύο και τη ζέστη.",
    "health_en": "Chinese Crested may be prone to dental problems (early tooth loss), skin issues (acne, sunburn in hairless), patellar luxation, and Legg-Calve-Perthes disease. Eye conditions and allergies occur in some. Regular dental care and skin protection are important. Reputable breeders screen for genetic conditions.",
    "health_el": "Το Chinese Crested μπορεί να είναι επιρρεπές σε οδοντικά προβλήματα, δερματικά θέματα, εξάρθρωση επιγονατίδας και νόσο Legg-Calve-Perthes. Η τακτική φροντίδα δοντιών και η προστασία του δέρματος είναι σημαντικές."
  },
  {
    "id": "coton-de-tulear",
    "slug": "coton-de-tulear",
    "name_en": "Coton de Tulear",
    "name_el": "Κοτόν ντε Τουλεάρ",
    "type": "dog",
    "origin": "Madagascar",
    "originCode": "MG",
    "images": [],
    "size": "small",
    "lifespan": "15-19 years",
    "temperament_en": ["Happy", "Playful", "Affectionate", "Intelligent", "Adaptable"],
    "temperament_el": ["Χαρούμενος", "Παιχνιδιάρης", "Στοργικός", "Έξυπνος", "Προσαρμοστικός"],
    "description_en": "The Coton de Tulear is the national dog of Madagascar, named for the city of Tulear and their cotton-like coat. They are happy, playful dogs known for their clownish behavior and affectionate nature. Cotons get along well with children and other pets. They are intelligent and trainable, though they can have a stubborn streak. Their soft, cotton-like coat is low-shedding but requires regular grooming.",
    "description_el": "Το Coton de Tulear είναι το εθνικό σκυλί της Μαδαγασκάρης, ονομασμένο από την πόλη Tulear και το βαμβακένιο τρίχωμά τους. Είναι χαρούμενα, παιχνιδιάρικα σκυλιά γνωστά για την κωμική συμπεριφορά και τη στοργική φύση τους. Είναι έξυπνα και εκπαιδεύσιμα. Το μαλακό τρίχωμά τους απαιτεί τακτική περιποίηση.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Coton de Tulear need regular brushing to prevent matting; many owners use professional groomers. They require moderate daily exercise and enjoy play and walks. They are social and do not like being left alone for long. Positive, patient training works best. Dental care is important.",
    "care_el": "Το Coton de Tulear χρειάζεται τακτικό βούρτσισμα για να αποφευχθούν οι κόμποι. Χρειάζονται μέτρια καθημερινή άσκηση. Είναι κοινωνικά και δεν πρέπει να μένουν μόνα για πολύ. Η θετική, υπομονετική εκπαίδευση λειτουργεί καλύτερα.",
    "health_en": "Coton de Tulear are generally healthy and long-lived. They may be prone to patellar luxation, hip dysplasia, and eye conditions. Some have cardiac concerns. Dental disease is common in small breeds. Regular vet checkups and good dental care support their long lifespan.",
    "health_el": "Το Coton de Tulear είναι γενικά υγιή και μακρόβια. Μπορεί να είναι επιρρεπές σε εξάρθρωση επιγονατίδας και οφθαλμολογικά θέματα. Η τακτική φροντίδα δοντιών και οι κτηνιατρικοί έλεγχοι υποστηρίζουν τη μακρά ζωή τους."
  },
  {
    "id": "english-toy-spaniel",
    "slug": "english-toy-spaniel",
    "name_en": "English Toy Spaniel (King Charles Spaniel)",
    "name_el": "Αγγλικό Toy Σπάνιελ (King Charles Spaniel)",
    "type": "dog",
    "origin": "United Kingdom",
    "originCode": "GB",
    "images": [],
    "size": "small",
    "lifespan": "10-12 years",
    "temperament_en": ["Gentle", "Affectionate", "Reserved", "Calm", "Loyal"],
    "temperament_el": ["Ήπιος", "Στοργικός", "Συνεσταλμένος", "Ήρεμος", "Πιστός"],
    "description_en": "The English Toy Spaniel, also known as the King Charles Spaniel, is a small, gentle companion with a domed head and pushed-in nose. They were favored by British royalty and appear in many historical paintings. These spaniels are calm, affectionate, and devoted to their families. They can be reserved with strangers and prefer a quiet, predictable environment. They are less active than the Cavalier but equally loving.",
    "description_el": "Το English Toy Spaniel, γνωστό και ως King Charles Spaniel, είναι μικρός, ήπιος σύντροφος με θολωτό κεφάλι και πλακωμένη μύτη. Ήταν αγαπημένα της βρετανικής βασιλικής οικογένειας. Είναι ήρεμα, στοργικά και αφοσιωμένα. Μπορεί να είναι συνεσταλμένα με αγνώστους και προτιμούν ήρεμο περιβάλλον.",
    "characteristics": { "energy": 2, "grooming": 3, "friendliness": 4, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "English Toy Spaniels need moderate daily exercise—short walks and indoor play suffice. Their silky coat requires regular brushing. They are brachycephalic and sensitive to heat; avoid strenuous exercise in warm weather. They respond well to gentle, positive training. They thrive as lap dogs and companions.",
    "care_el": "Τα English Toy Spaniel χρειάζονται μέτρια καθημερινή άσκηση. Το μεταξωτό τρίχωμά τους απαιτεί τακτικό βούρτσισμα. Είναι βραχυκεφαλικά και ευαίσθητα στη ζέστη. Απαντούν καλά σε ήπια εκπαίδευση.",
    "health_en": "English Toy Spaniels are brachycephalic and can have breathing issues and heat sensitivity. They may be prone to heart disease (mitral valve), eye problems, patellar luxation, and syringomyelia. Ear infections can occur. Choose a breeder who prioritizes health and avoids extreme features. Regular vet checkups are important.",
    "health_el": "Τα English Toy Spaniel είναι βραχυκεφαλικά και μπορεί να έχουν αναπνευστικά θέματα. Μπορεί να είναι επιρρεπή σε καρδιακές παθήσεις και προβλήματα ματιών. Η επιλογή εκτροφέα που δίνει προτεραιότητα στην υγεία είναι σημαντική."
  },
  {
    "id": "french-bulldog",
    "slug": "french-bulldog",
    "name_en": "French Bulldog",
    "name_el": "Γαλλικό Μπουλντόγκ",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "small",
    "lifespan": "10-12 years",
    "temperament_en": ["Playful", "Adaptable", "Smart", "Affectionate", "Easygoing"],
    "temperament_el": ["Παιχνιδιάρης", "Προσαρμοστικός", "Έξυπνος", "Στοργικός", "Άνετος"],
    "description_en": "The French Bulldog is a small, muscular companion with bat-like ears and a flat face. Developed in France from English Bulldog ancestors, they became favorites of Parisian society. Frenchies are playful, affectionate, and adaptable—they do well in apartments and love to be with their people. They are generally good with children and other pets. Their expressive faces and clownish behavior have made them one of the most popular breeds worldwide.",
    "description_el": "Το Γαλλικό Μπουλντόγκ είναι μικρός, μυώδης σύντροφος με αυτιά σαν νυχτερίδα και επίπεδο πρόσωπο. Αναπτύχθηκε στη Γαλλία από αγγλικούς προγόνους Μπουλντόγκ. Είναι παιχνιδιάρικα, στοργικά και προσαρμοστικά. Τα πάνε καλά σε διαμερίσματα και αγαπούν την παρέα των ανθρώπων τους. Η εκφραστική όψη και η κωμική συμπεριφορά τους τα έχουν κάνει από τις πιο δημοφιλείς ράτσες.",
    "characteristics": { "energy": 2, "grooming": 1, "friendliness": 5, "trainability": 3, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "French Bulldogs need moderate exercise but must avoid overheating—they are brachycephalic and cannot cool efficiently. Short walks in cool weather are best. Their short coat is easy to maintain. Clean facial folds regularly. They can snore and may have flatulence. Many cannot swim due to their build. Weight management is important.",
    "care_el": "Τα Γαλλικά Μπουλντόγκ χρειάζονται μέτρια άσκηση αλλά πρέπει να αποφεύγουν την υπερθέρμανση. Το κοντό τρίχωμά τους είναι εύκολο στη συντήρηση. Οι ρυτίδες του προσώπου πρέπει να καθαρίζονται τακτικά. Η διαχείριση βάρους είναι σημαντική.",
    "health_en": "French Bulldogs face significant health challenges: brachycephalic syndrome, spinal issues (hemivertebrae), hip dysplasia, and skin fold infections. Many require cesarean delivery. Allergies and eye problems are common. Heat stroke is a serious risk. Choose a breeder who prioritizes health and avoids extreme conformation. Pet insurance is often recommended.",
    "health_el": "Τα Γαλλικά Μπουλντόγκ αντιμετωπίζουν σημαντικές υγειονομικές προκλήσεις: βραχυκεφαλικό σύνδρομο, σπονδυλικές παθήσεις, δυσπλασία ισχίου. Η θερμοπληξία είναι σοβαρός κίνδυνος. Η επιλογή εκτροφέα που δίνει προτεραιότητα στην υγεία είναι απαραίτητη."
  },
  {
    "id": "havanese",
    "slug": "havanese",
    "name_en": "Havanese",
    "name_el": "Χαβανέζε",
    "type": "dog",
    "origin": "Cuba",
    "originCode": "CU",
    "images": [],
    "size": "small",
    "lifespan": "14-16 years",
    "temperament_en": ["Intelligent", "Affectionate", "Playful", "Friendly", "Trainable"],
    "temperament_el": ["Έξυπνος", "Στοργικός", "Παιχνιδιάρης", "Φιλικός", "Εκπαιδεύσιμος"],
    "description_en": "The Havanese is the national dog of Cuba, descended from Bichon-type dogs brought by Spanish settlers. They have a long, silky coat that can be left flowing or clipped. Havanese are intelligent, affectionate, and playful—they love to perform tricks and be the center of attention. They get along well with children, other dogs, and cats. They are adaptable and do well in various living situations.",
    "description_el": "Το Havanese είναι το εθνικό σκυλί της Κούβας, κατάγεται από σκυλιά τύπου Bichon που έφεραν οι Ισπανοί άποικοι. Έχουν μακρύ, μεταξωτό τρίχωμα. Είναι έξυπνα, στοργικά και παιχνιδιάρικα. Τα πάνε καλά με παιδιά και άλλα κατοικίδια. Είναι προσαρμοστικά και τα πάνε καλά σε διάφορες συνθήκες διαβίωσης.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Havanese need regular brushing to prevent mats; many owners keep the coat clipped for easier care. They require daily exercise and mental stimulation—they excel at tricks and agility. They are highly trainable and eager to please. They bond closely and can develop separation anxiety. Dental care is important.",
    "care_el": "Το Havanese χρειάζεται τακτικό βούρτσισμα για να αποφευχθούν οι κόμποι. Χρειάζονται καθημερινή άσκηση και νοητική διέγερση. Είναι πολύ εκπαιδεύσιμα και πρόθυμα να ευχαριστούν. Η φροντίδα δοντιών είναι σημαντική.",
    "health_en": "Havanese are generally healthy but can be prone to patellar luxation, hip dysplasia, cataracts, and deafness (especially in white dogs). Liver shunts and heart conditions occur in some lines. Regular vet checkups and screenings by responsible breeders help maintain health. They are typically long-lived with good care.",
    "health_el": "Το Havanese είναι γενικά υγιή αλλά μπορεί να είναι επιρρεπές σε εξάρθρωση επιγονατίδας και οφθαλμολογικά θέματα. Οι τακτικοί κτηνιατρικοί έλεγχοι και η καλή φροντίδα υποστηρίζουν τη μακρά ζωή τους."
  },
  {
    "id": "italian-greyhound",
    "slug": "italian-greyhound",
    "name_en": "Italian Greyhound",
    "name_el": "Ιταλικό Γκρέιχαουντ",
    "type": "dog",
    "origin": "Italy",
    "originCode": "IT",
    "images": [],
    "size": "small",
    "lifespan": "14-15 years",
    "temperament_en": ["Affectionate", "Playful", "Alert", "Gentle", "Sensitive"],
    "temperament_el": ["Στοργικός", "Παιχνιδιάρης", "Επαγρύπνος", "Ήπιος", "Ευαίσθητος"],
    "description_en": "The Italian Greyhound is the smallest of the sighthounds, with a sleek, elegant build and fine coat. They have been cherished as companions for centuries, appearing in Renaissance art. Italian Greyhounds are affectionate, playful, and bond closely with their owners. They enjoy short bursts of speed but are also content to curl up on the couch. They can be sensitive and reserved with strangers. Their thin coat and low body fat mean they need protection from cold.",
    "description_el": "Το Italian Greyhound είναι το μικρότερο από τα sighthounds, με λεπτή, κομψή σωματική διάπλαση. Είναι αγαπημένα ως σύντροφοι εδώ και αιώνες. Είναι στοργικά, παιχνιδιάρικα και δένονται στενά με τους ιδιοκτήτες τους. Μπορεί να είναι ευαίσθητα και συνεσταλμένα με αγνώστους. Χρειάζονται προστασία από το κρύο.",
    "characteristics": { "energy": 3, "grooming": 1, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Italian Greyhounds need daily exercise—short runs in a safe area or brisk walks. They are prone to leg fractures from jumping or rough play, so supervise around furniture and with children. They get cold easily; sweaters or coats in winter are often needed. Their short coat is minimal maintenance. They are sensitive and respond best to gentle training.",
    "care_el": "Τα Italian Greyhound χρειάζονται καθημερινή άσκηση. Είναι επιρρεπή σε κάταγματα από πήδημα, οπότε απαιτείται επίβλεψη. Κρυώνουν εύκολα· συχνά χρειάζονται ζακέτες το χειμώνα. Το κοντό τρίχωμά τους απαιτεί ελάχιστη συντήρηση.",
    "health_en": "Italian Greyhounds can be prone to leg fractures due to fine bones, dental problems, hypothyroidism, and patellar luxation. Eye conditions and autoimmune issues occur in some. They may be sensitive to anesthesia. Provide soft bedding and avoid situations where they might jump from heights. Regular dental care is important.",
    "health_el": "Τα Italian Greyhound μπορεί να είναι επιρρεπή σε κάταγματα λόγω λεπτών οστών, οδοντικά προβλήματα και εξάρθρωση επιγονατίδας. Η τακτική φροντίδα δοντιών και η αποφυγή πηδημάτων από ύψος είναι σημαντικές."
  },
  {
    "id": "japanese-chin",
    "slug": "japanese-chin",
    "name_en": "Japanese Chin",
    "name_el": "Ιαπωνικό Τσιν",
    "type": "dog",
    "origin": "Japan",
    "originCode": "JP",
    "images": [],
    "size": "small",
    "lifespan": "10-12 years",
    "temperament_en": ["Gentle", "Affectionate", "Dignified", "Loyal", "Cat-like"],
    "temperament_el": ["Ήπιος", "Στοργικός", "Αξιοπρεπής", "Πιστός", "Σαν γάτα"],
    "description_en": "The Japanese Chin is a small, aristocratic toy breed with a distinctive pushed-in face and feathered coat. They were treasured by Japanese and Chinese royalty. Chins are gentle, affectionate, and often described as cat-like—they may climb furniture and groom themselves. They are dignified and loyal, forming strong bonds with their owners. They tend to be reserved with strangers and prefer calm households.",
    "description_el": "Το Japanese Chin είναι μικρή αριστοκρατική toy ράτσα με χαρακτηριστικό πλακωμένο πρόσωπο και φτερωτό τρίχωμα. Είναι ήπια, στοργικά και συχνά περιγράφονται ως σαν γάτα. Είναι αξιοπρεπή και πιστά. Τείνουν να είναι συνεσταλμένα με αγνώστους και προτιμούν ήρεμα νοικοκυριά.",
    "characteristics": { "energy": 2, "grooming": 3, "friendliness": 4, "trainability": 3, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Japanese Chin need moderate exercise—short walks and indoor play. Their silky coat requires regular brushing. They are brachycephalic and sensitive to heat; avoid exertion in warm weather. They can be stubborn; patient, positive training works best. They are indoor dogs and should be protected from extreme temperatures.",
    "care_el": "Τα Japanese Chin χρειάζονται μέτρια άσκηση. Το μεταξωτό τρίχωμά τους απαιτεί τακτικό βούρτσισμα. Είναι βραχυκεφαλικά και ευαίσθητα στη ζέστη. Μπορεί να είναι πεισματάρικα· η υπομονετική εκπαίδευση λειτουργεί καλύτερα.",
    "health_en": "Japanese Chin are brachycephalic and can have breathing difficulties and heat sensitivity. They may be prone to patellar luxation, heart murmurs, eye problems (including cataracts), and reverse sneezing. Dental issues are common. Choose a breeder who prioritizes healthy airways. Regular vet checkups are recommended.",
    "health_el": "Τα Japanese Chin είναι βραχυκεφαλικά και μπορεί να έχουν αναπνευστικές δυσκολίες. Μπορεί να είναι επιρρεπή σε εξάρθρωση επιγονατίδας και προβλήματα ματιών. Η επιλογή εκτροφέα που δίνει προτεραιότητα στην υγεία συνιστάται."
  },
  {
    "id": "lhasa-apso",
    "slug": "lhasa-apso",
    "name_en": "Lhasa Apso",
    "name_el": "Λάσα Αψό",
    "type": "dog",
    "origin": "China",
    "originCode": "CN",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Confident", "Loyal", "Alert", "Independent", "Playful"],
    "temperament_el": ["Σίγουρος", "Πιστός", "Επαγρύπνος", "Ανεξάρτητος", "Παιχνιδιάρης"],
    "description_en": "The Lhasa Apso is an ancient breed from Tibet, originally kept in monasteries as indoor watchdogs. They have a long, flowing coat and a confident, independent personality. Lhasas are loyal to their families and can be wary of strangers—they make good alert dogs. They are playful and affectionate with those they trust. Their name means 'bark lion sentinel dog' in Tibetan.",
    "description_el": "Το Lhasa Apso είναι αρχαία ράτσα από το Θιβέτ, αρχικά διατηρούταν στα μοναστήρια ως σκύλοι φύλαξης. Έχουν μακρύ, ρέον τρίχωμα και σίγουρη, ανεξάρτητη προσωπικότητα. Είναι πιστά στις οικογένειές τους και μπορεί να είναι επιφυλακτικά με αγνώστους. Είναι παιχνιδιάρικα και στοργικά με όσους εμπιστεύονται.",
    "characteristics": { "energy": 3, "grooming": 5, "friendliness": 3, "trainability": 3, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Lhasa Apso require daily brushing to prevent matting; many owners keep the coat clipped for easier care. They need moderate daily exercise. They can be independent and stubborn; consistent, patient training is important. Early socialization helps them accept strangers. They are alert and may bark at sounds.",
    "care_el": "Το Lhasa Apso απαιτεί καθημερινό βούρτσισμα για να αποφευχθούν οι κόμποι. Χρειάζονται μέτρια καθημερινή άσκηση. Μπορεί να είναι ανεξάρτητα και πεισματάρικα. Η πρώιμη κοινωνικοποίηση βοηθά. Είναι επαγρύπνων και μπορεί να γαβγίζουν σε ήχους.",
    "health_en": "Lhasa Apso may be prone to eye problems (including progressive retinal atrophy and dry eye), kidney issues, and hip dysplasia. Skin allergies and ear infections can occur. Patellar luxation is seen in some. Regular grooming helps spot skin and eye issues. Choose a breeder who screens for hereditary conditions.",
    "health_el": "Το Lhasa Apso μπορεί να είναι επιρρεπές σε προβλήματα ματιών, νεφρικά θέματα και δυσπλασία ισχίου. Οι τακτικοί έλεγχοι και η περιποίηση βοηθούν στην πρόωρη ανίχνευση προβλημάτων."
  },
  {
    "id": "lowchen",
    "slug": "lowchen",
    "name_en": "Löwchen (Little Lion Dog)",
    "name_el": "Λέβχεν (Μικρό Λιοντάρι)",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "small",
    "lifespan": "13-15 years",
    "temperament_en": ["Affectionate", "Intelligent", "Playful", "Confident", "Trainable"],
    "temperament_el": ["Στοργικός", "Έξυπνος", "Παιχνιδιάρης", "Σίγουρος", "Εκπαιδεύσιμος"],
    "description_en": "The Löwchen, or Little Lion Dog, is a small companion breed traditionally clipped in a lion trim (shaved body, full mane and tail). They have been rare for much of their history. Löwchens are affectionate, intelligent, and playful—they bond closely with their families and get along well with children and other pets. They are confident and trainable, often excelling in obedience and agility.",
    "description_el": "Το Löwchen, ή Μικρό Λιοντάρι, είναι μικρή ράτσα συντρόφου που παραδοσιακά κουρεύεται σε λεοντή τριμ. Είναι στοργικά, έξυπνα και παιχνιδιάρικα. Δένονται στενά με τις οικογένειές τους. Είναι σίγουρα και εκπαιδεύσιμα, συχνά διαπρέπουν στην υπακοή και την ευκινησία.",
    "characteristics": { "energy": 3, "grooming": 5, "friendliness": 5, "trainability": 5, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Löwchens need regular grooming—either the traditional lion clip every few weeks or regular brushing if the coat is left long. They require moderate daily exercise and enjoy play and training. They are intelligent and need mental stimulation. They thrive on companionship and do not like to be left alone for long.",
    "care_el": "Τα Löwchen χρειάζονται τακτική περιποίηση—είτε το παραδοσιακό λεοντή κούρεμα είτε τακτικό βούρτσισμα. Χρειάζονται μέτρια καθημερινή άσκηση και νοητική διέγερση. Ευδοκιμούν με τη συντροφιά και δεν πρέπει να μένουν μόνα για πολύ.",
    "health_en": "Löwchens are generally healthy but can be prone to patellar luxation, hip dysplasia, and eye conditions. Some lines may have cardiac concerns. Progressive retinal atrophy has been reported. Responsible breeders screen for genetic conditions. Regular vet checkups and good care support a long, healthy life.",
    "health_el": "Τα Löwchen είναι γενικά υγιή αλλά μπορεί να είναι επιρρεπή σε εξάρθρωση επιγονατίδας και οφθαλμολογικά θέματα. Οι υπεύθυνοι εκτροφείς ελέγχουν για γενετικές παθήσεις."
  },
  {
    "id": "maltese",
    "slug": "maltese",
    "name_en": "Maltese",
    "name_el": "Μαλτέζικο",
    "type": "dog",
    "origin": "Malta",
    "originCode": "MT",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Gentle", "Playful", "Affectionate", "Fearless", "Lively"],
    "temperament_el": ["Ήπιος", "Παιχνιδιάρης", "Στοργικός", "Ατρόμητος", "Ζωηρός"],
    "description_en": "The Maltese is one of the oldest toy breeds, with a history spanning over 2,000 years. They have a long, silky white coat and a gentle, playful nature. Maltese are affectionate and bond closely with their owners; they can be fearless despite their small size. They get along well with children and other pets when socialized. They are adaptable and do well in apartments.",
    "description_el": "Το Μαλτέζικο είναι μία από τις παλαιότερες toy ράτσες, με ιστορία πάνω από 2.000 χρόνια. Έχουν μακρύ, μεταξωτό λευκό τρίχωμα και ήπια, παιχνιδιάρικη φύση. Είναι στοργικά και δένονται στενά με τους ιδιοκτήτες τους. Τα πάνε καλά με παιδιά και άλλα κατοικίδια. Είναι προσαρμοστικά και τα πάνε καλά σε διαμερίσματα.",
    "characteristics": { "energy": 3, "grooming": 5, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Maltese require daily brushing to prevent mats in their long coat; many owners keep them in a shorter 'puppy clip' for ease. They need moderate daily exercise. They can develop tear staining; keeping the face clean and dry helps. Dental care is important for small breeds. They are sensitive and respond best to gentle training.",
    "care_el": "Το Μαλτέζικο απαιτεί καθημερινό βούρτσισμα για να αποφευχθούν οι κόμποι. Χρειάζονται μέτρια καθημερινή άσκηση. Μπορεί να αναπτύξουν κηλίδες από δάκρυα· ο καθαρισμός του προσώπου βοηθά. Η φροντίδα δοντιών είναι σημαντική.",
    "health_en": "Maltese may be prone to patellar luxation, dental problems, hypoglycemia (especially in puppies), and eye conditions. Some have heart murmurs or liver shunts. White coat and skin can be sensitive to sun. Regular dental care and vet checkups are important. Choose a breeder who screens for hereditary conditions.",
    "health_el": "Το Μαλτέζικο μπορεί να είναι επιρρεπές σε εξάρθρωση επιγονατίδας, οδοντικά προβλήματα και οφθαλμολογικά θέματα. Η τακτική φροντίδα δοντιών και οι κτηνιατρικοί έλεγχοι είναι σημαντικοί."
  },
  {
    "id": "papillon",
    "slug": "papillon",
    "name_en": "Papillon",
    "name_el": "Παπιγιόν",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "small",
    "lifespan": "13-15 years",
    "temperament_en": ["Friendly", "Energetic", "Intelligent", "Happy", "Trainable"],
    "temperament_el": ["Φιλικός", "Ενεργητικός", "Έξυπνος", "Χαρούμενος", "Εκπαιδεύσιμος"],
    "description_en": "The Papillon is a small toy breed named for their butterfly-like ears (papillon means butterfly in French). They are one of the oldest toy breeds, appearing in European art for centuries. Papillons are friendly, energetic, and highly intelligent—they excel in obedience and agility. They are happy, outgoing dogs that get along well with people and other pets. Their fine-boned, elegant build and flowing coat give them a distinctive appearance.",
    "description_el": "Το Papillon είναι μικρή toy ράτσα ονομασμένη από τα αυτιά που μοιάζουν με πεταλούδα. Είναι μία από τις παλαιότερες toy ράτσες. Είναι φιλικά, ενεργητικά και πολύ έξυπνα—διαπρέπουν στην υπακοή και την ευκινησία. Είναι χαρούμενα, εξωστρεφή σκυλιά. Η λεπτή σωματική διάπλαση και το ρέον τρίχωμά τους τα καθιστούν ξεχωριστά.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Papillons need daily exercise and mental stimulation—they enjoy walks, play, and training. Their long, silky coat requires regular brushing. They are highly trainable and thrive on learning new tricks. They can be fragile; supervise with small children and prevent jumping from heights. Dental care is important.",
    "care_el": "Τα Papillon χρειάζονται καθημερινή άσκηση και νοητική διέγερση. Το μακρύ, μεταξωτό τρίχωμά τους απαιτεί τακτικό βούρτσισμα. Είναι πολύ εκπαιδεύσιμα. Μπορεί να είναι εύθραυστα· απαιτείται επίβλεψη με μικρά παιδιά. Η φροντίδα δοντιών είναι σημαντική.",
    "health_en": "Papillons may be prone to patellar luxation, dental problems, progressive retinal atrophy, and fontanels (soft spots on the skull that may not close). Some have allergies or collapsing trachea. They can be sensitive to anesthesia. Regular dental care and vet checkups are recommended. Avoid breeding dogs with open fontanels.",
    "health_el": "Τα Papillon μπορεί να είναι επιρρεπή σε εξάρθρωση επιγονατίδας, οδοντικά προβλήματα και προοδευτική ατροφία αμφιβληστροειδούς. Η τακτική φροντίδα δοντιών και οι κτηνιατρικοί έλεγχοι συνιστώνται."
  },
  {
    "id": "pekingese",
    "slug": "pekingese",
    "name_en": "Pekingese",
    "name_el": "Πεκινέζε",
    "type": "dog",
    "origin": "China",
    "originCode": "CN",
    "images": [],
    "size": "small",
    "lifespan": "12-14 years",
    "temperament_en": ["Loyal", "Affectionate", "Dignified", "Independent", "Brave"],
    "temperament_el": ["Πιστός", "Στοργικός", "Αξιοπρεπής", "Ανεξάρτητος", "Γενναίος"],
    "description_en": "The Pekingese is an ancient Chinese breed once reserved for imperial palaces—commoners had to bow to them. They have a long, flowing coat, flat face, and sturdy build. Pekingese are loyal, affectionate, and dignified with a strong independent streak. They are brave despite their size and can be stubborn. They bond closely with their owners and can be reserved with strangers. They prefer calm environments.",
    "description_el": "Το Pekingese είναι αρχαία κινεζική ράτσα που κάποτε ήταν αποκλειστικά για τα αυτοκρατορικά παλάτια. Έχουν μακρύ, ρέον τρίχωμα και επίπεδο πρόσωπο. Είναι πιστά, στοργικά και αξιοπρεπή με ισχυρή ανεξαρτησία. Είναι γενναία παρά το μέγεθός τους και μπορεί να είναι πεισματάρικα. Δένονται στενά με τους ιδιοκτήτες τους.",
    "characteristics": { "energy": 2, "grooming": 5, "friendliness": 3, "trainability": 2, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Pekingese require daily brushing and regular grooming; their long coat mats easily. They need moderate exercise but are brachycephalic—avoid heat and strenuous activity. They can be stubborn; patient, consistent training works best. Clean facial folds regularly. They are sensitive to heat and prefer cooler temperatures.",
    "care_el": "Το Pekingese απαιτεί καθημερινό βούρτσισμα και τακτική περιποίηση. Χρειάζονται μέτρια άσκηση αλλά είναι βραχυκεφαλικά—αποφεύγετε τη ζέστη. Μπορεί να είναι πεισματάρικα. Οι ρυτίδες του προσώπου πρέπει να καθαρίζονται τακτικά. Είναι ευαίσθητα στη ζέστη.",
    "health_en": "Pekingese are brachycephalic and can have serious breathing difficulties, eye problems (including ulcers due to prominent eyes), and spinal issues (intervertebral disc disease). They may overheat easily. Patellar luxation and heart conditions occur. Skin fold infections are common. Choose a breeder who prioritizes health and avoids extreme conformation. Regular vet checkups are essential.",
    "health_el": "Τα Pekingese είναι βραχυκεφαλικά και μπορεί να έχουν σοβαρές αναπνευστικές δυσκολίες και προβλήματα ματιών. Η θερμοπληξία είναι κίνδυνος. Η επιλογή εκτροφέα που δίνει προτεραιότητα στην υγεία είναι απαραίτητη."
  },
  {
    "id": "pug",
    "slug": "pug",
    "name_en": "Pug",
    "name_el": "Παγκ",
    "type": "dog",
    "origin": "China",
    "originCode": "CN",
    "images": [],
    "size": "small",
    "lifespan": "13-15 years",
    "temperament_en": ["Charming", "Mischievous", "Loving", "Stubborn", "Sociable"],
    "temperament_el": ["Γοητευτικός", "Παιχνιδιάρης", "Αγαπητός", "Πεισματάρης", "Κοινωνικός"],
    "description_en": "The Pug is a small, sturdy breed with a wrinkled face, curly tail, and distinctive expression. They were bred as companions for Chinese emperors and later became favorites of European royalty. Pugs are charming, mischievous, and loving—they thrive on human attention and get along with almost everyone. They are sociable and generally good with children and other pets. They can be stubborn but are eager to please when motivated. Their compact size and moderate exercise needs suit many lifestyles.",
    "description_el": "Το Παγκ είναι μικρή, στέρεη ράτσα με ζαρωμένο πρόσωπο και σγουρή ουρά. Εκτράφηκαν ως σύντροφοι των κινεζικών αυτοκρατόρων. Είναι γοητευτικά, παιχνιδιάρικα και αγαπητά—ευδοκιμούν με την ανθρώπινη προσοχή. Είναι κοινωνικά και γενικά καλά με παιδιά και άλλα κατοικίδια. Το συμπαγές μέγεθός τους τα καθιστά κατάλληλα για πολλούς τρόπους ζωής.",
    "characteristics": { "energy": 2, "grooming": 2, "friendliness": 5, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Pugs need moderate exercise but must avoid overheating—they are brachycephalic. Short walks in cool weather are best. Clean facial wrinkles daily to prevent infection. They shed quite a bit despite short coat. They can snore and may have flatulence. Weight management is critical; obesity worsens breathing and joint issues. They should not be overexerted or left in heat.",
    "care_el": "Τα Παγκ χρειάζονται μέτρια άσκηση αλλά πρέπει να αποφεύγουν την υπερθέρμανση. Οι ρυτίδες του προσώπου πρέπει να καθαρίζονται καθημερινά. Χάνουν αρκετό τρίχωμα. Η διαχείριση βάρους είναι κρίσιμη. Δεν πρέπει να κάνουν υπερβολική άσκηση ή να μένουν στη ζέστη.",
    "health_en": "Pugs face significant health challenges: brachycephalic syndrome (breathing difficulties), eye problems (ulcers, proptosis), hip dysplasia, and patellar luxation. They overheat easily and are at risk for heat stroke. Obesity is common and worsens other issues. Many have skin fold infections. Choose a breeder who prioritizes healthy airways and eyes. Regular vet care is essential.",
    "health_el": "Τα Παγκ αντιμετωπίζουν σημαντικές υγειονομικές προκλήσεις: βραχυκεφαλικό σύνδρομο, προβλήματα ματιών και κίνδυνο θερμοπληξίας. Η παχυσαρκία είναι συχνή. Η επιλογή εκτροφέα που δίνει προτεραιότητα στην υγεία είναι απαραίτητη."
  },
  {
    "id": "tibetan-spaniel",
    "slug": "tibetan-spaniel",
    "name_en": "Tibetan Spaniel",
    "name_el": "Θιβετιανό Σπάνιελ",
    "type": "dog",
    "origin": "China",
    "originCode": "CN",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Alert", "Intelligent", "Independent", "Affectionate", "Reserved"],
    "temperament_el": ["Επαγρύπνος", "Έξυπνος", "Ανεξάρτητος", "Στοργικός", "Συνεσταλμένος"],
    "description_en": "The Tibetan Spaniel is a small breed from the monasteries of Tibet, where they served as watchdogs—perching on walls to alert monks. Despite the name, they are not true spaniels. They have a medium-length coat with a mane and are alert, intelligent, and independent. Tibetan Spaniels are affectionate with their families but can be reserved with strangers. They are adaptable and do well in various living situations.",
    "description_el": "Το Tibetan Spaniel είναι μικρή ράτσα από τα μοναστήρια του Θιβέτ, όπου υπηρετούσαν ως σκύλοι φύλαξης. Έχουν τρίχωμα μέσου μήκους με χαίτη και είναι επαγρύπνων, έξυπνα και ανεξάρτητα. Είναι στοργικά με τις οικογένειές τους αλλά μπορεί να είναι συνεσταλμένα με αγνώστους. Είναι προσαρμοστικά.",
    "characteristics": { "energy": 3, "grooming": 3, "friendliness": 4, "trainability": 3, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Tibetan Spaniels need regular brushing; their coat is not as high-maintenance as some long-coated breeds. They require moderate daily exercise and enjoy walks and play. They can be independent; patient, positive training works best. They are alert and may bark. Early socialization helps them accept new people and situations.",
    "care_el": "Τα Tibetan Spaniel χρειάζονται τακτικό βούρτσισμα. Χρειάζονται μέτρια καθημερινή άσκηση. Μπορεί να είναι ανεξάρτητα· η υπομονετική εκπαίδευση λειτουργεί καλύτερα. Είναι επαγρύπνων. Η πρώιμη κοινωνικοποίηση βοηθά.",
    "health_en": "Tibetan Spaniels may be prone to patellar luxation, eye conditions (including progressive retinal atrophy), and heart murmurs. Some have allergies or skin issues. They are generally healthy and long-lived with good care. Regular vet checkups and screenings by responsible breeders help maintain health.",
    "health_el": "Το Tibetan Spaniel μπορεί να είναι επιρρεπές σε εξάρθρωση επιγονατίδας και οφθαλμολογικά θέματα. Είναι γενικά υγιή και μακρόβια με καλή φροντίδα."
  },
  {
    "id": "tibetan-terrier",
    "slug": "tibetan-terrier",
    "name_en": "Tibetan Terrier",
    "name_el": "Θιβετιανό Τεριέ",
    "type": "dog",
    "origin": "China",
    "originCode": "CN",
    "images": [],
    "size": "small",
    "lifespan": "15-16 years",
    "temperament_en": ["Affectionate", "Loyal", "Sensitive", "Intelligent", "Reserved"],
    "temperament_el": ["Στοργικός", "Πιστός", "Ευαίσθητος", "Έξυπνος", "Συνεσταλμένος"],
    "description_en": "The Tibetan Terrier is a medium-sized (within the small range) breed from Tibet, used as companions and good-luck charms by monks—they were never sold, only given as gifts. Despite the name, they are not true terriers. They have a long, double coat that can be wavy or straight. Tibetan Terriers are affectionate, loyal, and sensitive; they bond deeply with their families. They can be reserved with strangers and are intelligent and trainable with positive methods.",
    "description_el": "Το Tibetan Terrier είναι ράτσα από το Θιβέτ, χρησιμοποιούνταν ως σύντροφοι και γούρι από τους μοναχούς. Παρά το όνομά τους, δεν είναι αληθινά τεριέ. Έχουν μακρύ, διπλό τρίχωμα. Είναι στοργικά, πιστά και ευαίσθητα· δένονται βαθιά με τις οικογένειές τους. Μπορεί να είναι συνεσταλμένα με αγνώστους. Είναι έξυπνα και εκπαιδεύσιμα με θετικές μεθόδους.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 4, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Tibetan Terriers need regular brushing to prevent matting; their long coat requires commitment. They need moderate daily exercise and enjoy walks and play. They are sensitive and do not respond well to harsh methods; positive, patient training is best. They can be reserved; early socialization helps. They are generally healthy and long-lived.",
    "care_el": "Το Tibetan Terrier χρειάζεται τακτικό βούρτσισμα για να αποφευχθούν οι κόμποι. Χρειάζονται μέτρια καθημερινή άσκηση. Είναι ευαίσθητα· η θετική, υπομονετική εκπαίδευση είναι η καλύτερη. Η πρώιμη κοινωνικοποίηση βοηθά. Είναι γενικά υγιή και μακρόβια.",
    "health_en": "Tibetan Terriers may be prone to hip dysplasia, patellar luxation, eye conditions (including lens luxation and cataracts), and cardiac issues. Some have allergies. They are generally robust and long-lived. Responsible breeders screen for hip and eye conditions. Regular vet checkups support a long, healthy life.",
    "health_el": "Το Tibetan Terrier μπορεί να είναι επιρρεπές σε δυσπλασία ισχίου, εξάρθρωση επιγονατίδας και οφθαλμολογικά θέματα. Είναι γενικά ανθεκτικά και μακρόβια. Οι υπεύθυνοι εκτροφείς ελέγχουν για ορθοπεδικά και οφθαλμολογικά θέματα."
  }
]
