[
  {
    "id": "american-english-coonhound",
    "slug": "american-english-coonhound",
    "name_en": "American English Coonhound",
    "name_el": "Αμερικανικός Αγγλικός Coonhound",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "11-12 years",
    "temperament_en": ["Friendly", "Energetic", "Determined", "Sociable", "Vocal"],
    "temperament_el": ["Φιλικός", "Ενεργητικός", "Αποφασιστικός", "Κοινωνικός", "Φωνακλάς"],
    "description_en": "The American English Coonhound (formerly the English Fox and Coonhound) is a versatile, athletic scent hound descended from English Foxhounds brought to America by early colonists, later crossed with other hound breeds to create a faster, more agile dog suited to the demanding terrain and varied game of the American South. Standing 56–66 cm and weighing 20–30 kg, they are lean, muscular dogs with a hard, protective coat in red-and-white ticked, blue-and-white ticked, tri-colored, or red patterns, and the long, pendulous ears characteristic of scent hounds. Originally bred to trail and tree raccoons by following their scent through forests, swamps, and over rough terrain, American English Coonhounds are known for their incredible stamina — they can run at high speeds for hours and are among the fastest of all coonhound breeds. They have a beautiful, melodious voice and are known for their distinctive baying and bugling when on a trail, with experienced hunters able to identify individual dogs by their unique voice. They are friendly, sociable, and pack-oriented dogs that get along well with other dogs and people, making them pleasant family companions when their considerable exercise needs are met.",
    "description_el": "Ο Αμερικανικός Αγγλικός Coonhound κατάγεται από Αγγλικά Foxhound που μεταφέρθηκαν στην Αμερική, διασταυρωμένα για ταχύτητα σε αμερικανικό έδαφος. 56–66 εκ. και 20–30 κιλά, αθλητικά με μακριά πέταλα αυτιά. Αναπτύχθηκε για ίχνος ρακούν — ανάμεσα στα ταχύτερα coonhound. Όμορφη, μελωδική φωνή — κυνηγοί αναγνωρίζουν μεμονωμένα σκυλιά. Φιλικά, κοινωνικά, αγελαιοκεντρικά — ευχάριστοι σύντροφοι όταν ασκούνται.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "American English Coonhounds need substantial daily exercise — at least 1 to 1.5 hours of vigorous activity including long runs, hikes, or structured hunting activities — and they have seemingly boundless energy and stamina that must be channeled appropriately. They should never be left off-leash in unfenced areas — once they pick up an interesting scent, they become single-minded in pursuit and may run for miles. Secure fencing must be high and reinforced, as they are determined escape artists when motivated by scent. Their short, hard coat is easy to maintain with weekly brushing. Their long, pendulous ears should be checked and cleaned weekly to prevent ear infections. Training requires patience and understanding of hound temperament — they are intelligent but follow their nose first and their owner second. Positive training with food rewards works best. They are very vocal dogs with loud, carrying bays, howls, and barks — they are not suitable for apartments or neighborhoods with noise-sensitive neighbors. They get along excellently with other dogs, as they were bred to work in packs.",
    "care_el": "Οι Coonhound χρειάζονται σημαντική καθημερινή άσκηση — 1–1,5 ώρες. Ποτέ χωρίς λουρί σε ανοιχτό χώρο — μονόμανοι στο ίχνος. Ασφαλής ψηλή περίφραξη. Εβδομαδιαίο βούρτσισμα. Τα αυτιά πρέπει να καθαρίζονται. Η εκπαίδευση απαιτεί υπομονή. Πολύ φωνακλά — δεν κατάλληλα για διαμέρισμα. Εξαιρετικά με άλλα σκυλιά.",
    "health_en": "American English Coonhounds are generally a healthy, robust breed with a typical lifespan of 11–12 years. Hip dysplasia can occur — OFA screening is recommended. Ear infections are common due to their long, pendulous ears that trap moisture and restrict airflow — regular ear cleaning is essential. Progressive retinal atrophy (PRA) and cataracts are eye conditions that should be monitored. Bloat (gastric dilatation-volvulus) is a risk in deep-chested breeds — feeding smaller meals and avoiding exercise around mealtimes is prudent. Hypothyroidism may develop. Polyradiculoneuritis (coonhound paralysis), a condition similar to Guillain-Barré syndrome in humans, can occur — typically after exposure to raccoon saliva. Elbow dysplasia has been reported. Obesity can be a concern if exercise is insufficient. Dental disease requires attention. Their strong work ethic and willingness to push through discomfort means injuries may go unnoticed initially. Responsible breeders screen for hips, eyes, and cardiac function.",
    "health_el": "Οι Coonhound είναι γενικά υγιής ράτσα με τυπική διάρκεια ζωής 11–12 χρόνια. Δυσπλασία ισχίου μπορεί να εμφανιστεί. Λοιμώξεις αυτιών κοινές. Οφθαλμικές παθήσεις πρέπει να ελέγχονται. Φούσκωμα (GDV) κίνδυνος. Η πολυριζονευρίτιδα (coonhound paralysis) μπορεί να εμφανιστεί. Η παχυσαρκία μπορεί να είναι ανησυχία. Οι εκτροφείς ελέγχουν ισχία, μάτια, καρδιά."
  },
  {
    "id": "american-foxhound",
    "slug": "american-foxhound",
    "name_en": "American Foxhound",
    "name_el": "Αμερικανικός Foxhound",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "11-13 years",
    "temperament_en": ["Independent", "Sweet-tempered", "Active", "Gentle", "Stubborn"],
    "temperament_el": ["Ανεξάρτητος", "Γλυκύς", "Δραστήριος", "Ήπιος", "Πεισματάρης"],
    "description_en": "The American Foxhound is one of America's oldest dog breeds and the state dog of Virginia, with origins tracing back to 1650 when Robert Brooke brought English Foxhounds to colonial Maryland. George Washington is considered a founding father of the breed — he maintained a kennel of foxhounds at Mount Vernon and crossed his English hounds with French hounds gifted by the Marquis de Lafayette, creating a leaner, faster, more agile hound suited to the vast American countryside. Standing 53–64 cm and weighing 25–32 kg, the American Foxhound is a tall, elegant, leggy hound — lighter-boned, longer-legged, and faster than its English cousin — with a short, hard coat, long ears, and large, soulful brown eyes. They possess an extraordinarily keen sense of smell and exceptional stamina, capable of running at speed over rough terrain for hours. Four distinct strains exist: field trial hounds, slow-trailing show hounds, drag hounds (racing), and pack hounds. They are sweet-tempered, gentle, easy-going dogs that are pack-oriented and get along wonderfully with other dogs, but their independent, scent-driven nature makes them challenging as household pets for inexperienced owners.",
    "description_el": "Ο Αμερικανικός Foxhound είναι μία από τις αρχαιότερες αμερικανικές ράτσες και σκυλί πολιτείας Βιρτζίνια. Ο George Washington θεωρείται ιδρυτής — διέσταυρε αγγλικά hounds με γαλλικά δώρα του Lafayette. 53–64 εκ. και 25–32 κιλά, κομψό, ελαφρύτερο και ταχύτερο από τον Αγγλικό ξάδελφο. Εξαιρετική οσφρητική ικανότητα. Τέσσερις τύποι υπάρχουν. Γλυκός χαρακτήρας, ήπιοι, αγελαιοκεντρικοί — αλλά η ανεξαρτησία τους τα κάνει δύσκολα για αρχάριους.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 4, "trainability": 2, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "American Foxhounds require extensive daily exercise — at least 1.5 to 2 hours of vigorous running, hiking, or hunting activities — and they were literally bred to run all day. Secure, high fencing is absolutely essential — they are scent-driven and will follow an interesting trail for miles without looking back. They should never be off-leash in unfenced areas. Their short, hard coat requires minimal grooming — just weekly brushing and occasional bathing. Their long ears should be cleaned weekly to prevent infections. Training is perhaps the greatest challenge — American Foxhounds are among the most independent of all dog breeds, bred to work independently following their nose rather than looking to a handler for direction. Positive methods with high-value food rewards can achieve basic obedience, but they will never be highly obedient recall dogs. They are vocal with a loud, carrying bay that can travel for miles — they are entirely unsuitable for apartments or suburban living. They do best in rural settings with active owners who hunt or participate in field trials. They are excellent with other dogs.",
    "care_el": "Οι Foxhound απαιτούν εκτενή άσκηση — 1,5–2 ώρες τρεξίματος. Ασφαλής ψηλή περίφραξη απολύτως απαραίτητη. Ποτέ χωρίς λουρί. Εβδομαδιαίο βούρτσισμα. Η εκπαίδευση μεγαλύτερη πρόκληση — εξαιρετικά ανεξάρτητα. Φωνακλά — ακατάλληλα για αστικές περιοχές. Καλύτερα σε αγροτικό περιβάλλον. Εξαιρετικά με άλλα σκυλιά.",
    "health_en": "American Foxhounds are generally a very healthy, robust breed with a typical lifespan of 11–13 years, their constitution strengthened by centuries of selective breeding for stamina and working ability. Hip dysplasia can occur though rates are lower than many breeds — screening is recommended. Ear infections are common due to their long, pendulous ears — regular cleaning is essential. Thrombocytopathy (a platelet function disorder causing excessive bleeding) has been documented in some lines — a blood test can identify affected dogs. Bloat (GDV) is a risk in deep-chested dogs. Hypothyroidism may develop. Eye conditions should be monitored. Dental disease requires attention. Obesity can occur in retired or under-exercised dogs. They can be sensitive to anesthesia. Their generally excellent health reflects a breeding tradition that has always prioritized working function over appearance. The American Foxhound is considered one of the healthiest AKC-recognized breeds. Responsible breeders screen for hips, eyes, and thrombocytopathy.",
    "health_el": "Οι Foxhound είναι γενικά πολύ υγιής ράτσα με τυπική διάρκεια ζωής 11–13 χρόνια. Δυσπλασία ισχίου σε χαμηλά ποσοστά. Λοιμώξεις αυτιών κοινές. Η θρομβοκυτοπάθεια τεκμηριώθηκε σε ορισμένες γραμμές. Φούσκωμα κίνδυνος. Η παχυσαρκία μπορεί να εμφανιστεί σε ανενεργά σκυλιά. Θεωρείται μία από τις πιο υγιείς ράτσες. Οι εκτροφείς ελέγχουν ισχία, μάτια, θρομβοκυτοπάθεια."
  },
  {
    "id": "basset-fauve-de-bretagne",
    "slug": "basset-fauve-de-bretagne",
    "name_en": "Basset Fauve de Bretagne",
    "name_el": "Μπασέ Φοβ ντε Βρετάνη",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "small",
    "lifespan": "12-14 years",
    "temperament_en": ["Cheerful", "Determined", "Friendly", "Lively", "Affectionate"],
    "temperament_el": ["Ευδιάθετος", "Αποφασιστικός", "Φιλικός", "Ζωντανός", "Στοργικός"],
    "description_en": "The Basset Fauve de Bretagne (Fawn Brittany Basset) is a charming, compact French scent hound from the Brittany region of northwest France, one of the oldest of the French basset breeds with origins tracing back to the 14th century. Standing just 32–38 cm and weighing 14–18 kg, they are the shorter-legged version of the larger Griffon Fauve de Bretagne — a reduction in height that was bred specifically to allow hunters on foot (rather than horseback) to keep up with the dogs while hunting rabbit and hare through the dense gorse and bramble of the Breton countryside. They have a distinctive rough, wiry, fawn-colored coat (ranging from golden wheat to brick red) that is harsh enough to protect them from thorns and briars, an alert foxy expression, and a compact, muscular build that belies their energy and determination. Unlike many basset breeds, the Fauve de Bretagne is notably light, agile, and athletic — they lack the exaggerated heaviness of the Basset Hound and are built for speed and endurance. They are cheerful, lively, affectionate dogs that make excellent family companions while retaining the strong scenting instincts and determination of a true working hound.",
    "description_el": "Το Basset Fauve de Bretagne είναι γαλλικό σκυλί μυρωδιάς από τη Βρετάνη, από τις αρχαιότερες γαλλικές ράτσες basset, 14ος αιώνας. 32–38 εκ. και 14–18 κιλά, κοντοπόδαρη εκδοχή του μεγαλύτερου Griffon Fauve — για πεζό κυνήγι σε θαμνώδη εκτάσεις. Τραχύ, σκληρό χρυσαφί τρίχωμα που προστατεύει από αγκάθια. Ελαφρύ, ευκίνητο — χωρίς την υπερβολική βαρύτητα του Basset Hound. Ευδιάθετα, ζωηρά, στοργικά — εξαιρετικοί οικογενειακοί σύντροφοι.",
    "characteristics": { "energy": 3, "grooming": 3, "friendliness": 5, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Basset Fauve de Bretagne need moderate daily exercise — about 45–60 minutes of walks, play, and scent-related activities — and they particularly enjoy nose work, scent trails, and games that engage their exceptional olfactory abilities. Their wiry coat requires regular hand-stripping or professional grooming every 3–4 months to maintain proper texture; between groomings, weekly brushing keeps the coat tidy. They are relatively easy to train for a hound breed — intelligent, food-motivated, and eager to please — though they retain the typical hound independence and may become selectively deaf when they pick up an interesting scent. Positive reinforcement with food rewards works excellently. They should not be trusted off-leash in unfenced areas due to their scenting instincts. They get along wonderfully with other dogs, children, and even cats when properly socialized, making them excellent family dogs. They are adaptable to apartment living with sufficient exercise. Their ears should be checked and cleaned regularly to prevent infections.",
    "care_el": "Τα Basset Fauve de Bretagne χρειάζονται μέτρια καθημερινή άσκηση — 45–60 λεπτά. Εξαιρετικά σε nose work. Τραχύ τρίχωμα απαιτεί hand-stripping κάθε 3–4 μήνες. Σχετικά εύκολα στην εκπαίδευση για hound. Θετική ενίσχυση εξαιρετική. Δεν πρέπει χωρίς λουρί. Εξαιρετικά με σκυλιά, παιδιά, γάτες. Προσαρμόζονται σε διαμέρισμα.",
    "health_en": "Basset Fauve de Bretagne are generally a healthy breed with a typical lifespan of 12–14 years. Ear infections are the most common health concern due to their pendulous ears — regular cleaning is essential. Progressive retinal atrophy (PRA) has been documented and a DNA test is available for the specific mutation found in this breed — all breeding dogs should be tested. Epilepsy has been reported in some lines. Hip dysplasia can occur though it is less common than in larger breeds. Patellar luxation may develop. Skin allergies and sensitivities can affect some individuals. Hypothyroidism may develop with age. Reproductive issues including difficult births have been occasionally reported. Back problems (intervertebral disc disease) are possible in any long-bodied breed, though the Fauve de Bretagne's lighter, more athletic build reduces this risk compared to heavier bassets. Dental disease requires regular attention. Responsible breeders screen for PRA (DNA test), hips, eyes, and patellae.",
    "health_el": "Τα Basset Fauve είναι γενικά υγιής ράτσα με τυπική διάρκεια ζωής 12–14 χρόνια. Λοιμώξεις αυτιών πιο κοινή ανησυχία. PRA τεκμηριώθηκε — DNA τεστ διαθέσιμο. Η επιληψία αναφέρθηκε. Δυσπλασία ισχίου μπορεί να εμφανιστεί. Αλλεργίες μπορεί να αναπτυχθούν. Προβλήματα πλάτης πιθανά αλλά λιγότερο από βαρύτερα basset. Οι εκτροφείς ελέγχουν PRA (DNA), ισχία, μάτια, επιγονατίδα."
  },
  {
    "id": "basset-hound",
    "slug": "basset-hound",
    "name_en": "Basset Hound",
    "name_el": "Μπασέ Χάουντ",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "medium",
    "lifespan": "10-12 years",
    "temperament_en": ["Gentle", "Devoted", "Peaceful", "Friendly", "Stubborn"],
    "temperament_el": ["Ήπιος", "Αφοσιωμένος", "Ειρηνικός", "Φιλικός", "Πεισματάρης"],
    "description_en": "The Basset Hound is one of the most recognizable and beloved dog breeds in the world, a short-legged scent hound developed in France (and later refined in England) specifically for hunting hare and rabbit by tracking them through dense undergrowth at a pace that hunters on foot could follow. The name comes from the French word 'bas' meaning 'low,' aptly describing their ground-hugging stature of 28–38 cm, though they weigh a substantial 20–34 kg due to their heavy bone structure — they have the densest bone per pound of any dog breed. Their extraordinarily long, velvety ears (which can reach past the tip of their nose) actually serve a functional purpose: they sweep scent particles from the ground up toward the nose, while their loose, wrinkled facial skin and heavy dewlaps trap scent close to the face. Their sense of smell is second only to the Bloodhound among all dog breeds, with approximately 220 million scent receptors. Basset Hounds have a gentle, amiable, and famously laid-back temperament — they are endlessly patient, wonderful with children, and get along with virtually everyone including other dogs and cats. Their sad, soulful expression with drooping eyes and long ears has made them cultural icons.",
    "description_el": "Το Basset Hound είναι μία από τις πιο αναγνωρίσιμες ράτσες, κοντοπόδαρο σκυλί μυρωδιάς από τη Γαλλία. Το όνομα από το γαλλικό 'bas' (χαμηλό) — 28–38 εκ. αλλά 20–34 κιλά με πυκνότατα οστά. Τα μακριά αυτιά σαρώνουν μυρωδιές από το έδαφος. Η οσφρητική ικανότητα δεύτερη μόνο μετά το Bloodhound — 220 εκατομμύρια υποδοχείς. Ήπιος, αξιαγάπητος χαρακτήρας — υπομονετικά, θαυμάσια με παιδιά. Η θλιμμένη, ψυχική έκφρασή τους τα έκανε πολιτιστικά εικονίδια.",
    "characteristics": { "energy": 2, "grooming": 2, "friendliness": 5, "trainability": 2, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Basset Hounds need moderate daily exercise — about 30–45 minutes of walks — but owners should be aware that while they love sniffing and exploring, they can be remarkably stubborn about returning home and may need patient encouragement. Obesity is one of the most serious concerns for this breed — Bassets are extremely food-motivated and will eat anything, and excess weight puts dangerous strain on their long spine and short legs. Strict portion control, limited treats, and regular weigh-ins are essential. Their long ears must be cleaned at least weekly to prevent chronic ear infections, and their facial wrinkles should also be wiped clean regularly. They drool, especially after drinking, and can be messy eaters. Training is a legendary challenge — Basset Hounds are intelligent but extraordinarily stubborn; they will comply when they see personal benefit, and food rewards are the only reliable motivator. They are gentle, patient, and excellent with children. They can be vocal with a deep, carrying bay that neighbors may not appreciate.",
    "care_el": "Τα Basset Hound χρειάζονται μέτρια καθημερινή άσκηση — 30–45 λεπτά. Η παχυσαρκία είναι σοβαρή ανησυχία — αυστηρός έλεγχος μερίδων. Τα αυτιά πρέπει να καθαρίζονται εβδομαδιαία. Σαλιώνουν. Η εκπαίδευση θρυλική πρόκληση — πεισματάρικα αλλά με κίνητρα φαγητού. Ήπια, υπομονετικά με παιδιά. Φωνακλά με βαθύ γάβγισμα.",
    "health_en": "Basset Hounds have a typical lifespan of 10–12 years and face several significant health concerns related to their exaggerated body structure. Hip and elbow dysplasia are common due to their heavy bone and short legs — OFA screening is recommended. Intervertebral disc disease (IVDD) is a serious risk due to their long spine — jumping should be discouraged and stairs minimized. Ear infections are chronic in many Bassets due to their extremely long, heavy ears that trap moisture. Glaucoma is a major eye concern — regular ophthalmologic exams are essential. Ectropion (drooping lower eyelids) is nearly universal in the breed and can cause chronic irritation. Bloat (GDV) is a life-threatening risk. Obesity is perhaps the single greatest health threat — it exacerbates joint problems, back issues, and metabolic conditions. Von Willebrand's disease (a clotting disorder) has been documented. Hypothyroidism is common. Panosteitis (growing pains) can affect young Bassets. Skin fold dermatitis may occur around the wrinkles. Responsible breeders screen for hips, elbows, eyes (glaucoma), thyroid, and bleeding disorders.",
    "health_el": "Τα Basset Hound έχουν τυπική διάρκεια ζωής 10–12 χρόνια. Δυσπλασία ισχίου/αγκώνα κοινές. Η IVDD σοβαρός κίνδυνος λόγω μακριάς σπονδυλικής στήλης. Λοιμώξεις αυτιών χρόνιες. Το γλαύκωμα μεγάλη ανησυχία. Εκτρόπιο σχεδόν καθολικό. Φούσκωμα απειλητικό. Η παχυσαρκία η μεγαλύτερη απειλή. Η νόσος von Willebrand τεκμηριώθηκε. Οι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, θυρεοειδή."
  },
  {
    "id": "bavarian-mountain-scent-hound",
    "slug": "bavarian-mountain-scent-hound",
    "name_en": "Bavarian Mountain Scent Hound",
    "name_el": "Βαυαρικός Ορεινός Σκύλος Μυρωδιάς",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "medium",
    "lifespan": "10-14 years",
    "temperament_en": ["Calm", "Devoted", "Reserved", "Persistent", "Reliable"],
    "temperament_el": ["Ήρεμος", "Αφοσιωμένος", "Συνεσταλμένος", "Περσιστεντικός", "Αξιόπιστος"],
    "description_en": "The Bavarian Mountain Scent Hound (Bayerischer Gebirgsschweißhund) is a specialized German tracking dog developed in the mid-19th century in the Bavarian Alps by crossing the Hanoverian Scenthound with lighter, more agile Alpine hunting dogs to create a supremely capable 'blood tracker' — a dog that can follow the cold scent trail of wounded deer, chamois, wild boar, and other large game across steep, rocky mountain terrain hours or even days after the animal has passed. Standing 44–52 cm and weighing 20–25 kg, they are medium-sized, athletic dogs with a close-fitting, dense coat in all shades of deer red (from pale fawn to dark brindle) — a color that provides natural camouflage in the autumn forest. Their tracking ability is legendary — they can distinguish and follow a specific individual animal's blood trail among dozens of other scent trails. In Central Europe, every responsible hunting territory is required by law (Schweißhundstation system) to have access to a trained tracking dog for recovering wounded game, and the Bavarian is the premier breed for this critical conservation role. They are calm, composed dogs at home that form an extraordinarily close bond with their handler — often described as a 'one-person dog.'",
    "description_el": "Ο Βαυαρικός Ορεινός Σκύλος Μυρωδιάς (Bayerischer Gebirgsschweißhund) είναι εξειδικευμένος ιχνηλάτης, αναπτυγμένος στις Βαυαρικές Άλπεις τον 19ο αιώνα. 44–52 εκ. και 20–25 κιλά, αθλητικό σε αποχρώσεις κόκκινου ελαφιού. Η ιχνηλατική ικανότητα θρυλική — ξεχωρίζουν ατομικά ίχνη μεταξύ δεκάδων. Κάθε κυνηγετική περιοχή απαιτεί εκπαιδευμένο σκυλί ανάκτησης. Ήρεμα στο σπίτι, εξαιρετικά δεμένα με τον handler — «σκυλί ενός ατόμου».",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 3, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Bavarian Mountain Scent Hounds need substantial daily exercise — at least 1 to 1.5 hours of vigorous walking, hiking, or structured tracking work — and they particularly thrive with regular scent work, trailing, and nose-related activities that engage their extraordinary olfactory abilities. They are calm and well-behaved in the home when their physical and mental needs are met. Their short, dense coat is easy to maintain with weekly brushing. They bond extremely closely with one person and can be reserved or aloof with others — they are not a breed that transfers easily between homes. Training should be calm, patient, and positive — they are sensitive and intelligent, working closely with their handler through partnership rather than strict obedience. Early socialization is important to prevent excessive wariness of strangers. They have strong prey drive and should be in secure fenced areas. They can be challenging as pure household pets — they truly need a working purpose or intensive scent activities to be fulfilled. They are generally good with children in their own family.",
    "care_el": "Οι Βαυαρικοί χρειάζονται σημαντική καθημερινή άσκηση — 1–1,5 ώρες. Ευδοκιμούν με εργασία μυρωδιάς. Ήρεμα στο σπίτι. Εβδομαδιαίο βούρτσισμα. Δένονται πολύ με ένα πρόσωπο. Η εκπαίδευση πρέπει να είναι ήρεμη και θετική. Πρώιμη κοινωνικοποίηση σημαντική. Χρειάζονται εργασιακό σκοπό. Γενικά καλά με παιδιά.",
    "health_en": "Bavarian Mountain Scent Hounds are generally a healthy, robust breed with a typical lifespan of 10–14 years. Hip dysplasia is the most significant orthopedic concern — screening is recommended. Elbow dysplasia may also occur. Ear infections can develop due to their pendulous ears — regular cleaning is important. Eye conditions should be monitored. Epilepsy has been reported in some lines. Hypothyroidism can develop. Allergies and skin conditions may affect some individuals. Bloat (GDV) is possible. The breed's overall health is generally excellent, benefiting from continued strict selection for working ability — in Germany, breeding dogs must pass demanding tracking tests before being approved for breeding, ensuring that only fit, healthy, working dogs contribute to the gene pool. The Klub für Bayerische Gebirgsschweißhunde maintains rigorous breeding standards including mandatory health evaluations. Responsible breeders screen for hips, elbows, eyes, and demonstrate working tracking ability.",
    "health_el": "Οι Βαυαρικοί είναι γενικά υγιής ράτσα με τυπική διάρκεια ζωής 10–14 χρόνια. Δυσπλασία ισχίου σημαντικότερη ανησυχία. Λοιμώξεις αυτιών μπορεί να αναπτυχθούν. Η επιληψία αναφέρθηκε. Η υγεία ωφελείται από αυστηρή επιλογή εργασίας — σκυλιά πρέπει να περάσουν δοκιμές ιχνηλάτησης. Ο Γερμανικός σύλλογος διατηρεί αυστηρά πρότυπα. Οι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια."
  },
  {
    "id": "black-and-tan-coonhound",
    "slug": "black-and-tan-coonhound",
    "name_en": "Black and Tan Coonhound",
    "name_el": "Μαύρο και Ταν Coonhound",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Easygoing", "Friendly", "Devoted", "Adaptable", "Vocal"],
    "temperament_el": ["Άνετος", "Φιλικός", "Αφοσιωμένος", "Προσαρμοστικός", "Φωνακλάς"],
    "description_en": "The Black and Tan Coonhound is the oldest of the American coonhound breeds, descended from the Talbot Hound and later the Bloodhound and Virginia Foxhound. Developed in the southern Appalachian Mountains for trailing and treeing raccoons, they were first recognized by the AKC in 1945 — the first of the coonhound breeds to receive recognition. Standing 58–69 cm and weighing 30–50 kg, they are large, powerful, athletic hounds with a distinctive glossy black coat with rich tan markings above the eyes, on the muzzle, chest, and legs — a pattern inherited from their Bloodhound ancestry. They have long, pendulous ears, deep-set brown eyes, and a deep, resonant bay that can carry for considerable distances — experienced coon hunters can distinguish individual dogs and even tell from the bay whether the dog is 'hot trailing,' 'cold trailing,' or has 'treed' the raccoon. Black and Tan Coonhounds are gentle, easygoing, and devoted family dogs off the trail, but when hunting they transform into determined, tenacious trackers that will follow a scent through any terrain or condition.",
    "description_el": "Το Black and Tan Coonhound είναι το αρχαιότερο αμερικανικό coonhound, κατάγεται από Bloodhound και Virginia Foxhound. Αναπτύχθηκε στα Απαλάχια για ίχνος ρακούν — πρώτο coonhound αναγνωρισμένο AKC (1945). 58–69 εκ. και 30–50 κιλά, με γυαλιστερό μαύρο τρίχωμα με καφέ σημάδια. Βαθιά, ηχηρή φωνή — κυνηγοί αναγνωρίζουν μεμονωμένα σκυλιά. Ήπια, άνετα οικογενειακά σκυλιά — αλλά αποφασισμένοι ιχνηλάτες στο πεδίο.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Black and Tan Coonhounds need substantial daily exercise — at least 1 to 1.5 hours of vigorous activity including long walks, hikes, running, or tracking work — and they have great stamina requiring meaningful physical outlets. Secure, high fencing is essential — they are determined scent followers and will escape to pursue interesting trails. They should never be off-leash in unfenced areas. Their short, dense coat requires minimal grooming — just weekly brushing. Their long ears must be cleaned at least weekly to prevent chronic infections. Training requires patience, consistency, and understanding of hound temperament — they are intelligent but scent-driven and can be stubborn. Food rewards and positive methods work best. They are vocal with a deep, carrying bay — not suitable for apartments or noise-sensitive neighborhoods. They are gentle, patient family dogs that are excellent with children and other dogs. They can drool, especially after drinking. They tend to be couch potatoes indoors when properly exercised.",
    "care_el": "Τα B&T Coonhound χρειάζονται σημαντική καθημερινή άσκηση — 1–1,5 ώρες. Ασφαλής ψηλή περίφραξη απαραίτητη. Ποτέ χωρίς λουρί. Εβδομαδιαίο βούρτσισμα. Αυτιά εβδομαδιαία. Η εκπαίδευση απαιτεί υπομονή. Φωνακλά. Ήπια, υπομονετικά με παιδιά. Τεμπέληδες στο σπίτι όταν ασκούνται.",
    "health_en": "Black and Tan Coonhounds are generally a healthy breed with a typical lifespan of 10–12 years. Hip dysplasia is a significant orthopedic concern in this large breed — OFA screening is strongly recommended. Ear infections are extremely common due to their heavy, pendulous ears — diligent ear cleaning is essential. Ectropion (drooping lower eyelids) is common in the breed and can cause chronic eye irritation and infections. Bloat (GDV) is a serious risk in large, deep-chested dogs — feeding smaller meals, avoiding exercise after eating, and gastropexy are recommended precautions. Hypothyroidism is common. Eye conditions including cataracts and progressive retinal atrophy should be monitored. Hemophilia B (a bleeding disorder) has been documented in some lines. Elbow dysplasia may occur. Obesity can be a concern, particularly in less active dogs. Polyradiculoneuritis (coonhound paralysis) can occur. Dental disease requires attention. Responsible breeders screen for hips, elbows, eyes, cardiac function, and thyroid.",
    "health_el": "Τα B&T Coonhound είναι γενικά υγιής ράτσα με τυπική διάρκεια ζωής 10–12 χρόνια. Δυσπλασία ισχίου σημαντική ανησυχία. Λοιμώξεις αυτιών εξαιρετικά κοινές. Εκτρόπιο κοινό. Φούσκωμα σοβαρός κίνδυνος. Ο υποθυρεοειδισμός κοινός. Η αιμοφιλία Β τεκμηριώθηκε. Η παχυσαρκία ανησυχία. Οι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, καρδιά, θυρεοειδή."
  },
  {
    "id": "bloodhound",
    "slug": "bloodhound",
    "name_en": "Bloodhound",
    "name_el": "Μπλάντχαουντ",
    "type": "dog",
    "origin": "Belgium",
    "originCode": "BE",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Gentle", "Determined", "Affectionate", "Patient", "Stubborn"],
    "temperament_el": ["Ήπιος", "Αποφασιστικός", "Στοργικός", "Υπομονετικός", "Πεισματάρης"],
    "description_en": "The Bloodhound (Chien de Saint-Hubert) is universally acknowledged as possessing the most acute sense of smell of any domestic animal, with approximately 300 million scent receptors (compared to about 5 million in humans) and a nasal epithelium of 59 square inches — about 40 times that of a human. Originating at the Abbey of Saint-Hubert in Belgium in the 7th century, where monks carefully bred them for tracking, the Bloodhound has been used for over 1,000 years to trail humans and game. Their tracking evidence is so reliable that it is admissible in court in many jurisdictions — the only dog breed with this distinction. Standing 58–69 cm and weighing 36–50 kg, Bloodhounds are large, powerful, and noble-looking hounds with iconic loose, wrinkled skin, enormous pendulous ears, and deep-set, diamond-shaped eyes that give them a dignified, melancholy expression. Every physical feature serves a scenting purpose: the long ears sweep scent from the ground, the loose skin folds trap odor particles, and the heavy dewlaps channel scent toward the nose. They can follow trails that are over 300 hours (12+ days) old and have tracked individuals for distances exceeding 200 km. Despite their formidable tracking abilities, Bloodhounds are exceptionally gentle, affectionate, and patient — they are wonderfully tolerant with children and have no aggression toward the people they track.",
    "description_el": "Το Bloodhound (Chien de Saint-Hubert) αναγνωρίζεται παγκοσμίως ως το ζώο με την πιο οξεία αίσθηση όσφρησης — 300 εκατομμύρια υποδοχείς. Κατάγεται από τη Μονή Saint-Hubert στο Βέλγιο, 7ος αιώνας. Τα στοιχεία ιχνηλάτησης είναι αποδεκτά σε δικαστήρια. 58–69 εκ. και 36–50 κιλά, με εικονικό χαλαρό δέρμα και μακριά αυτιά — κάθε χαρακτηριστικό υπηρετεί οσφρητικό σκοπό. Ακολουθούν ίχνη 12+ ημερών, αποστάσεις 200+ χλμ. Παρά τις ικανότητες, ήπια, στοργικά, υπομονετικά.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 5, "trainability": 2, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Bloodhounds need moderate to substantial daily exercise — at least 1 hour of walks and activities — and they particularly thrive with tracking, trailing, and search activities that engage their extraordinary nose. Secure, high fencing is absolutely essential — when a Bloodhound catches an interesting scent, nothing will stop them from following it. They should never be off-leash in unfenced areas. Their abundant skin folds, wrinkles, and long ears require diligent cleaning — ears should be cleaned several times per week, and facial wrinkles wiped daily to prevent bacterial and yeast infections. They are legendary droolers — towels should be kept handy, especially after eating and drinking. Training is a unique experience — they are gentle, sensitive, and respond to patient positive methods, but they are extraordinarily stubborn when their nose is engaged. Early socialization helps develop their naturally gentle temperament. They are wonderful with children but their large size means supervision is needed. They can be destructive chewers, especially as young dogs. They do best with experienced owners who understand hound temperament.",
    "care_el": "Τα Bloodhound χρειάζονται μέτρια-σημαντική καθημερινή άσκηση — τουλάχιστον 1 ώρα. Ευδοκιμούν με ιχνηλάτηση. Ασφαλής ψηλή περίφραξη απολύτως απαραίτητη. Πτυχές δέρματος και αυτιά πρέπει να καθαρίζονται τακτικά. Θρυλικά σαλιώνουν. Η εκπαίδευση απαιτεί υπομονή. Θαυμάσια με παιδιά. Καταστροφικοί μασητές νεαρά.",
    "health_en": "Bloodhounds have a relatively short lifespan of 10–12 years and face several significant health challenges. Bloat (gastric dilatation-volvulus) is the leading cause of death in the breed — prophylactic gastropexy is strongly recommended. Hip and elbow dysplasia are common — OFA screening is essential. Ectropion (drooping lower eyelids) and entropion (inward-rolling eyelids) are very common eye conditions that often require surgical correction. Ear infections are chronic in virtually all Bloodhounds due to their extremely long, heavy ears. Skin fold dermatitis requires diligent care of their abundant wrinkles. Hypothyroidism is common. Dilated cardiomyopathy (DCM) and other cardiac conditions should be monitored. Epilepsy has been documented. Cancer (various types) is a significant cause of mortality. Degenerative myelopathy has been reported. Their large size and heavy body contribute to orthopedic issues including cruciate ligament tears. Obesity exacerbates many conditions. Responsible breeders screen for hips, elbows, eyes, cardiac function, and thyroid, and discuss bloat prevention with puppy buyers.",
    "health_el": "Τα Bloodhound έχουν σχετικά σύντομη διάρκεια ζωής 10–12 χρόνια. Φούσκωμα (GDV) κύρια αιτία θανάτου — γαστροπηξία συνιστάται. Δυσπλασία ισχίου/αγκώνα κοινές. Εκτρόπιο/εντρόπιο πολύ κοινές οφθαλμικές παθήσεις. Λοιμώξεις αυτιών χρόνιες. Δερματίτιδα πτυχών. Ο υποθυρεοειδισμός κοινός. DCM πρέπει να ελέγχεται. Ο καρκίνος σημαντική αιτία θνησιμότητας. Οι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, καρδιά, θυρεοειδή."
  },
  {
    "id": "bluetick-coonhound",
    "slug": "bluetick-coonhound",
    "name_en": "Bluetick Coonhound",
    "name_el": "Μπλούτικ Coonhound",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "11-12 years",
    "temperament_en": ["Friendly", "Energetic", "Loyal", "Vocal", "Determined"],
    "temperament_el": ["Φιλικός", "Ενεργητικός", "Πιστός", "Φωνακλάς", "Αποφασιστικός"],
    "description_en": "The Bluetick Coonhound is a striking American scent hound named for its distinctive 'blue' coat — a heavily mottled (ticked) pattern of black hairs on a white background that creates a blue appearance, with black spots on the back, ears, and sides, and tan markings above the eyes and on the cheeks. Descended from French Grand Bleu de Gascogne hounds brought to Louisiana by early French settlers and later crossed with English Foxhounds, American Foxhounds, and the Black and Tan Virginia Foxhound, the Bluetick was developed specifically for trailing and treeing raccoons in the dense forests and swamps of the American South. Standing 51–69 cm and weighing 20–36 kg, they are large, muscular, and well-built dogs with a deep, resonant bay described by admirers as a 'bugle cry' that rings through the night during coon hunts. Blueticks are known for being 'cold-nosed' — meaning they can follow very old, faint scent trails that other hounds cannot detect — and are considered more methodical and persistent trackers than faster coonhound breeds. They are the state dog of Tennessee, and were famously depicted in the novel 'Where the Red Fern Grows.' At home, they are loyal, friendly, and affectionate family dogs that are surprisingly gentle and patient with children.",
    "description_el": "Το Bluetick Coonhound πήρε το όνομα από το χαρακτηριστικό 'μπλε' τρίχωμα — μαύρες τρίχες σε λευκό φόντο. Κατάγεται από Γαλλικά Grand Bleu de Gascogne διασταυρωμένα με Foxhound. 51–69 εκ. και 20–36 κιλά, με βαθύ, ηχηρό γάβγισμα. Γνωστά ως «κρύα μύτη» — ακολουθούν πολύ παλιά ίχνη. Σκυλί πολιτείας Tennessee. Πιστά, φιλικά, εκπληκτικά ήπια με παιδιά.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Bluetick Coonhounds need substantial daily exercise — at least 1 to 1.5 hours of vigorous activity — and they particularly excel with hunting, tracking, and scent-related activities. Secure, high fencing is essential — their powerful nose will lead them on adventures if they can escape. They should never be off-leash in unfenced areas. Their short, dense coat is easy to maintain with weekly brushing. Their pendulous ears require weekly cleaning to prevent infections. Training requires patience and understanding of hound temperament — they are intelligent but scent-driven and will prioritize their nose over commands. Positive training with food rewards works best. They are extremely vocal — their deep, baying bark is musically beautiful to coonhound enthusiasts but can be overwhelming for neighbors. They are not suited to apartment or suburban living. They are pack-oriented and do best with other dogs. They drool and can be messy. They are gentle and affectionate with children.",
    "care_el": "Τα Bluetick χρειάζονται σημαντική καθημερινή άσκηση — 1–1,5 ώρες. Ασφαλής ψηλή περίφραξη. Ποτέ χωρίς λουρί. Εβδομαδιαίο βούρτσισμα. Αυτιά εβδομαδιαία. Υπομονή στην εκπαίδευση. Εξαιρετικά φωνακλά — ακατάλληλα για πόλη. Αγελαιοκεντρικά. Ήπια με παιδιά.",
    "health_en": "Bluetick Coonhounds are generally a healthy, robust breed with a typical lifespan of 11–12 years. Hip dysplasia is the most significant orthopedic concern — OFA screening is recommended. Ear infections are very common due to their long, pendulous ears — diligent weekly cleaning is essential. Bloat (GDV) is a risk in deep-chested dogs — feeding smaller meals and avoiding exercise after eating is prudent. Lysosomal storage disease (Krabbe disease) is a fatal neurological condition documented in the breed — affected puppies typically show signs by 6 months. Eye conditions including cataracts and ectropion should be monitored. Hypothyroidism can develop. Polyradiculoneuritis (coonhound paralysis) can occur after exposure to raccoon saliva. Allergies and skin conditions may develop. Dental disease requires attention. Their robust health reflects continued breeding for hunting function. Responsible breeders screen for hips, eyes, cardiac function, and Krabbe disease.",
    "health_el": "Τα Bluetick είναι γενικά υγιής ράτσα με τυπική διάρκεια ζωής 11–12 χρόνια. Δυσπλασία ισχίου σημαντικότερη ανησυχία. Λοιμώξεις αυτιών πολύ κοινές. Φούσκωμα κίνδυνος. Η νόσος Krabbe (λυσοσωμική αποθήκευση) τεκμηριώθηκε — μοιραία. Οφθαλμικές παθήσεις πρέπει να ελέγχονται. Coonhound paralysis πιθανή. Οι εκτροφείς ελέγχουν ισχία, μάτια, καρδιά, Krabbe."
  },
  {
    "id": "dalmatian",
    "slug": "dalmatian",
    "name_en": "Dalmatian",
    "name_el": "Δαλματία",
    "type": "dog",
    "origin": "Croatia",
    "originCode": "HR",
    "images": [],
    "size": "large",
    "lifespan": "11-13 years",
    "temperament_en": ["Energetic", "Outgoing", "Intelligent", "Playful", "Sensitive"],
    "temperament_el": ["Ενεργητικός", "Εξωστρεφής", "Έξυπνος", "Παιχνιδιάρης", "Ευαίσθητος"],
    "description_en": "The Dalmatian is one of the most instantly recognizable dog breeds in the world, famous for its unique white coat adorned with round, well-defined spots in either black or liver (brown). The breed's precise origins are debated, but they are most associated with the historical Dalmatia region (modern Croatia), with depictions of spotted dogs appearing in Croatian church frescoes and chronicles from the 14th century. Dalmatians have served in an extraordinary variety of roles throughout history: coach dogs running alongside horse-drawn carriages (their unique affinity for horses is unmatched among breeds), circus performers, war sentinels, firehouse mascots (they ran alongside horse-drawn fire engines, clearing the path and guarding the equipment), hunting dogs, shepherd dogs, and vermin exterminators. Standing 48–61 cm and weighing 15–32 kg, they are elegant, athletic, muscular dogs built for endurance. Puppies are born completely white, with spots developing gradually over the first few weeks and continuing to develop throughout life. Dalmatians have a unique metabolic quirk — they are the only mammal other than humans and great apes that produce uric acid rather than allantoin as the end product of purine metabolism, which has significant health implications. They are energetic, outgoing, intelligent, and sensitive dogs that form strong bonds with their families.",
    "description_el": "Η Δαλματία είναι μία από τις πιο αναγνωρίσιμες ράτσες, με μοναδικό λευκό τρίχωμα με μαύρες ή καφέ κηλίδες. Η καταγωγή συνδέεται με τη Δαλματία (Κροατία), 14ος αιώνας. Υπηρέτησαν ως σκυλιά αμαξιού, μασκότ πυροσβεστικής, κυνηγετικά, τσίρκο. 48–61 εκ. και 15–32 κιλά. Τα κουτάβια γεννιούνται λευκά, οι κηλίδες εμφανίζονται σταδιακά. Μοναδική μεταβολική ιδιαιτερότητα — παράγουν ουρικό οξύ. Ενεργητικές, εξωστρεφείς, ευαίσθητες.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Dalmatians need extensive daily exercise — at least 1 to 2 hours of vigorous running, hiking, cycling, or active play — and they have seemingly boundless energy and stamina. They were bred to run alongside carriages for miles, and an under-exercised Dalmatian will become destructive and hyperactive. Their short coat sheds constantly and heavily — the stiff white hairs embed in fabric and are notoriously difficult to remove. Regular brushing helps but won't eliminate shedding. Training should be positive, consistent, and firm — Dalmatians are intelligent but can be willful. They are sensitive to harsh corrections. Early, extensive socialization is crucial as they can be reserved or nervous around strangers without it. A low-purine diet is strongly recommended to prevent urate stone formation due to their unique metabolism — many veterinarians recommend avoiding organ meats, beef, and high-purine foods. Adequate water intake is essential. They make excellent running, cycling, and hiking companions. They do well in dog sports including agility, obedience, and road trials.",
    "care_el": "Οι Δαλματίες χρειάζονται εκτενή καθημερινή άσκηση — 1–2 ώρες τρεξίματος. Ρίχνουν τρίχωμα συνεχώς και βαριά. Η εκπαίδευση πρέπει να είναι θετική και σταθερή. Πρώιμη κοινωνικοποίηση κρίσιμη. Δίαιτα χαμηλή σε πουρίνες συνιστάται λόγω μοναδικού μεταβολισμού. Επαρκής κατανάλωση νερού απαραίτητη. Εξαιρετικοί σύντροφοι τρεξίματος.",
    "health_en": "Dalmatians have a typical lifespan of 11–13 years and face several significant breed-specific health concerns. Congenital deafness is the most well-known — approximately 15–30% of Dalmatians are affected (either unilateral or bilateral deafness linked to the extreme piebald gene) — BAER (Brainstem Auditory Evoked Response) testing of all puppies is absolutely essential. Urinary stones (urate urolithiasis) are extremely common due to their unique uric acid metabolism — they are the only breed universally affected by this condition. Low-purine diets, adequate water intake, and sometimes medication (allopurinol) are necessary for management. Hip dysplasia can occur — screening is recommended. Skin allergies (atopy) are very common in the breed. Iris sphincter dysplasia and other eye conditions may occur. Seizure disorders have been reported. Hypothyroidism can develop. Laryngeal paralysis has been documented. The breed can be sensitive to certain anesthetics. Responsible breeders screen for hearing (BAER testing), hips, eyes, thyroid, and manage urate concerns through dietary guidance.",
    "health_el": "Οι Δαλματίες έχουν τυπική διάρκεια ζωής 11–13 χρόνια. Η εκ γενετής κώφωση επηρεάζει 15–30% — BAER τεστ απαραίτητο. Ουρικοί λίθοι πολύ κοινοί λόγω μοναδικού μεταβολισμού — δίαιτα χαμηλή σε πουρίνες αναγκαία. Δυσπλασία ισχίου μπορεί. Δερματικές αλλεργίες πολύ κοινές. Οφθαλμικές παθήσεις μπορεί. Η λαρυγγική παράλυση τεκμηριώθηκε. Οι εκτροφείς ελέγχουν ακοή (BAER), ισχία, μάτια, θυρεοειδή."
  },
  {
    "id": "english-foxhound",
    "slug": "english-foxhound",
    "name_en": "English Foxhound",
    "name_el": "Αγγλικός Foxhound",
    "type": "dog",
    "origin": "United Kingdom",
    "originCode": "GB",
    "images": [],
    "size": "large",
    "lifespan": "10-13 years",
    "temperament_en": ["Sociable", "Gentle", "Tolerant", "Active", "Independent"],
    "temperament_el": ["Κοινωνικός", "Ήπιος", "Ανεκτικός", "Δραστήριος", "Ανεξάρτητος"],
    "description_en": "The English Foxhound is one of Britain's oldest sporting breeds, meticulously developed since at least the 16th century by the British landed gentry specifically for mounted fox hunting — a tradition that shaped British rural culture for centuries. Detailed breeding records (stud books) have been maintained by English hunt kennels since the 1700s, making the English Foxhound one of the earliest breeds to benefit from systematic selective breeding. Standing 53–64 cm and weighing 25–34 kg, they are large, well-balanced, athletic dogs with a dense, short, glossy coat in any hound color (typically tricolor or bicolor), a broad skull, long pendant ears, and large, expressive brown eyes. They were bred to run with the pack for hours while following the scent of a fox across the English countryside, keeping pace with the horses — requiring exceptional stamina, a keen nose, a melodious voice, and a pack-oriented temperament. English Foxhounds are rarely kept as household pets — they are almost exclusively kennel-housed working dogs in hunt establishments, making them one of the rarest AKC breeds in private pet ownership. They are gentle, sociable, tolerant, and extremely pack-oriented, having been bred for centuries to live and work harmoniously with dozens of other dogs.",
    "description_el": "Ο Αγγλικός Foxhound είναι μία από τις αρχαιότερες βρετανικές ράτσες, αναπτυγμένος τουλάχιστον από τον 16ο αιώνα για κυνήγι αλεπούς. Λεπτομερή αρχεία εκτροφής από τα 1700. 53–64 εκ. και 25–34 κιλά, αθλητικό με κοντό γυαλιστερό τρίχωμα. Σπάνια ως κατοικίδια — σχεδόν αποκλειστικά εργαζόμενα σκυλιά σε ρυθμίσεις κυνηγιού. Ήπια, κοινωνικά, ανεκτικά, εξαιρετικά αγελαιοκεντρικά.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 4, "trainability": 2, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "English Foxhounds require extensive daily exercise — ideally 2+ hours of vigorous running and activity — and they are one of the most demanding breeds in terms of exercise needs. They were bred to run all day and have enormous stamina. Secure, high fencing over very large areas is essential — they are scent-driven and will wander for miles. They are highly pack-oriented and do much better with other dogs; a solitary English Foxhound is an unhappy one. Their short coat requires minimal grooming. Training is extremely challenging as they have been bred for centuries to work independently following their nose rather than looking to a handler — they are among the most independent of all breeds. They are very vocal with a melodious, carrying bay. They are essentially working kennel dogs that do not readily adapt to suburban pet life. The rare individuals kept as pets need extremely active, rural homes with other dogs and extensive acreage. They are gentle and tolerant with people.",
    "care_el": "Οι Αγγλικοί Foxhound απαιτούν εκτενή καθημερινή άσκηση — 2+ ώρες. Ασφαλής ψηλή περίφραξη. Αγελαιοκεντρικά — χρειάζονται άλλα σκυλιά. Ελάχιστη περιποίηση τριχώματος. Η εκπαίδευση εξαιρετικά δύσκολη. Φωνακλά. Ουσιαστικά εργαζόμενα σκυλιά που δεν προσαρμόζονται σε αστική ζωή. Ήπια με ανθρώπους.",
    "health_en": "English Foxhounds are generally one of the healthiest dog breeds with a typical lifespan of 10–13 years, their robust constitution reflecting centuries of selective breeding for stamina and working ability. Hip dysplasia can occur — screening is recommended by conscientious breeders. Ear infections may develop due to their pendulous ears. Renal amyloidosis (kidney disease) has been documented in some lines. Epilepsy has been reported. Bloat (GDV) is possible in this deep-chested breed. Hypothyroidism can develop. Eye conditions should be monitored. Dental disease requires attention. Their overall excellent health reflects a breeding tradition focused exclusively on working performance — hunt kennels have historically been ruthless in culling unhealthy dogs from breeding programs. The Master of Foxhounds Association maintains breeding records. Because so few English Foxhounds are kept as pets, veterinary data from pet populations is very limited. Responsible breeders screen for hips, eyes, and overall soundness.",
    "health_el": "Οι Αγγλικοί Foxhound είναι μία από τις πιο υγιείς ράτσες με τυπική διάρκεια ζωής 10–13 χρόνια. Δυσπλασία ισχίου μπορεί να εμφανιστεί. Η νεφρική αμυλοείδωση τεκμηριώθηκε. Η επιληψία αναφέρθηκε. Φούσκωμα πιθανό. Η εξαιρετική υγεία αντικατοπτρίζει αιώνες εκτροφής για απόδοση. Πολύ λίγα κτηνιατρικά δεδομένα κατοικιδίων. Οι εκτροφείς ελέγχουν ισχία, μάτια, γενική υγεία."
  },
  {
    "id": "finnish-hound",
    "slug": "finnish-hound",
    "name_en": "Finnish Hound",
    "name_el": "Φινλανδικός Σκύλος Μυρωδιάς",
    "type": "dog",
    "origin": "Finland",
    "originCode": "FI",
    "images": [],
    "size": "medium",
    "lifespan": "11-12 years",
    "temperament_en": ["Calm", "Friendly", "Energetic", "Determined", "Even-tempered"],
    "temperament_el": ["Ήρεμος", "Φιλικός", "Ενεργητικός", "Αποφασιστικός", "Ισορροπημένος"],
    "description_en": "The Finnish Hound (Suomenajokoira) is Finland's most popular dog breed and one of the country's most important hunting dogs, developed in the 19th century by crossing French, German, and Scandinavian hound breeds to create an ideal scent hound for hunting hare and fox in Finland's challenging boreal forests, deep snow, and extreme cold. Standing 52–61 cm and weighing 20–25 kg, they are medium to large, well-proportioned dogs with a distinctive tricolor coat (black saddle with rich tan and white markings), long pendant ears, and a friendly, alert expression. The Finnish Hound hunts independently — ranging far from the hunter, following the scent trail while giving a continuous musical cry that allows the hunter to track the dog's progress through the dense forest. They are bred to work alone or in pairs rather than in packs, and they are valued for their determination, persistence, and ability to work in deep snow at temperatures well below freezing. At home, they are remarkably calm, friendly, and even-tempered dogs that make pleasant family companions — a dramatic contrast to their intense, driven hunting personality in the field.",
    "description_el": "Ο Φινλανδικός Σκύλος Μυρωδιάς είναι η πιο δημοφιλής ράτσα σκύλων της Φινλανδίας, αναπτύχθηκε για κυνήγι λαγού και αλεπούς. Είναι ήρεμοι και φιλικοί στο σπίτι αλλά αποφασιστικοί και ενεργητικοί στο πεδίο. Έχουν ισορροπημένη σωματική διάπλαση και χαρακτηριστικό τρίχρωμο τρίχωμα. Είναι ισορροπημένοι και τα πάνε καλά με ανθρώπους και άλλα σκυλιά.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Finnish Hounds need substantial daily exercise — at least 1 to 1.5 hours of vigorous walking, running, or ideally tracking and scent work — and they have the stamina to handle much more, especially in cool weather. They are remarkably calm and well-behaved indoors when properly exercised — a dramatic switch from their intense field behavior. Secure fencing is essential as they are scent-driven and will follow interesting trails. They should not be off-leash in unfenced areas. Their short, dense coat is easy to maintain with weekly brushing. Training requires patience — they are intelligent but retain typical hound independence and can be selectively deaf when their nose is engaged. Positive methods with food rewards work best. They are friendly, social dogs that get along well with other dogs, children, and people in general. They can be vocal with a melodious bark. They thrive in Finnish homes as dual-purpose hunting/family dogs, and they adapt well to active families who can provide sufficient exercise.",
    "care_el": "Οι Φινλανδικοί Σκύλοι Μυρωδιάς χρειάζονται σημαντική καθημερινή άσκηση — 1–1,5 ώρες. Ήρεμα στο σπίτι. Ασφαλής περίφραξη. Εβδομαδιαίο βούρτσισμα. Υπομονή στην εκπαίδευση. Φιλικά, κοινωνικά. Μπορεί να γαβγίζουν. Προσαρμόζονται σε ενεργές οικογένειες.",
    "health_en": "Finnish Hounds are generally a healthy, robust breed with a typical lifespan of 11–12 years. Hip dysplasia is the most significant orthopedic concern — screening is recommended, and the Finnish Kennel Club maintains hip evaluation programs. Ear infections can occur due to their pendulous ears — regular cleaning is important. Cerebellar ataxia (a neurological condition) has been documented in the breed — a DNA test has been developed for the specific mutation. Hypothyroidism can develop. Eye conditions should be monitored. Epilepsy has been reported in some lines. Bloat (GDV) is possible. Dental disease requires attention. The breed's overall health benefits from Finland's robust breeding programs, which require health evaluations including hip scoring before breeding. The Finnish Hound is one of the most extensively health-tested breeds in Finland due to its enormous popularity. Allergies and skin conditions may develop. Responsible breeders screen for hips, eyes, cerebellar ataxia (DNA test), and demonstrate working ability.",
    "health_el": "Οι Φινλανδικοί είναι γενικά υγιής ράτσα με τυπική διάρκεια ζωής 11–12 χρόνια. Δυσπλασία ισχίου σημαντικότερη ανησυχία. Η εγκεφαλική αταξία τεκμηριώθηκε — DNA τεστ διαθέσιμο. Ο υποθυρεοειδισμός μπορεί. Η υγεία ωφελείται από τα εκτροφικά προγράμματα Φινλανδίας. Μία από τις πιο ελεγμένες ράτσες. Οι εκτροφείς ελέγχουν ισχία, μάτια, εγκεφαλική αταξία (DNA)."
  },
  {
    "id": "grand-basset-griffon-vendeen",
    "slug": "grand-basset-griffon-vendeen",
    "name_en": "Grand Basset Griffon Vendéen",
    "name_el": "Γκραν Μπασέ Γκριφόν Βαντέα",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Lively", "Courageous", "Friendly", "Independent", "Vocal"],
    "temperament_el": ["Ζωντανός", "Θαρραλέος", "Φιλικός", "Ανεξάρτητος", "Φωνακλάς"],
    "description_en": "The Grand Basset Griffon Vendéen (GBGV) is a charismatic French scent hound from the rocky, thorn-covered Vendée region of western France, developed specifically for hunting hare through the region's demanding terrain. Standing 39–44 cm and weighing 18–20 kg, they are the larger of the two Basset Griffon Vendéen varieties (the other being the Petit), though they are still a moderate-sized dog with short but straight legs. The GBGV burst into the international spotlight when a GBGV named Buddy Holly won Best in Show at the Westminster Kennel Club Dog Show in 2023. They have a rough, tousled wiry coat (which provides protection from thorns and briars), long eyebrows and facial furnishings, long pendulous ears, and an alert, happy expression. Unlike many basset breeds, the GBGV is remarkably athletic and active — built for speed and endurance over rough ground rather than simply low-to-the-ground tracking. They hunt in packs using their voices to communicate with the hunter. GBGVs are lively, courageous, outgoing, and independent dogs with a joyful, irrepressible temperament that makes them entertaining and sometimes challenging companions.",
    "description_el": "Το Grand Basset Griffon Vendéen (GBGV) είναι γαλλικό σκυλί μυρωδιάς από τη Vendée, αναπτυγμένο για κυνήγι λαγού. 39–44 εκ. και 18–20 κιλά. Κέρδισε Best in Show στο Westminster 2023. Τραχύ τρίχωμα, μακριά φρύδια, χαρούμενη έκφραση. Αθλητικό και ενεργό — χτισμένο για ταχύτητα σε τραχύ έδαφος. Ζωηρά, θαρραλέα, ανεξάρτητα με ακατάσχετη ιδιοσυγκρασία.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Grand Basset Griffon Vendéens need substantial daily exercise — at least 1 hour of vigorous walking, hiking, or scent-related activities — and they have more energy and stamina than their short-legged appearance suggests. Their wiry coat requires weekly brushing and periodic hand-stripping or professional grooming every 3–4 months to maintain proper texture. Secure fencing is essential — they are scent-driven and will follow trails with determination. Training requires patience and a good sense of humor — GBGVs are intelligent but independent and have a joyful disregard for strict obedience. Positive methods with high-value food rewards work best. They are friendly, social dogs that get along well with other dogs, children, and strangers. They can be vocal with a melodious bark. They adapt reasonably well to various living situations with adequate exercise. Their irrepressible cheerfulness and clownish behavior make them entertaining companions.",
    "care_el": "Τα GBGV χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 ώρα. Εβδομαδιαίο βούρτσισμα και περιοδικό stripping. Ασφαλής περίφραξη. Υπομονή στην εκπαίδευση. Φιλικά, κοινωνικά. Μπορεί να γαβγίζουν. Ακατάσχετη εύθυμη προσωπικότητα.",
    "health_en": "Grand Basset Griffon Vendéens are generally a healthy breed with a typical lifespan of 12–14 years. Ear infections are common due to their long, pendulous ears — regular cleaning is essential. Hip dysplasia can occur — screening is recommended. Hypothyroidism has been documented. Eye conditions including persistent pupillary membranes (PPM) and retinal folds should be screened for. Epilepsy has been reported in some lines. Patellar luxation may develop. Pain syndrome (a neurological condition causing episodes of pain, fever, and depression in young dogs) has been documented and is an area of ongoing research. Intervertebral disc disease (IVDD) is possible in any long-bodied breed. Allergies and skin conditions may develop. Reproductive issues have been occasionally reported. The breed benefits from increasing international attention and health research. Responsible breeders screen for hips, eyes, patellae, cardiac function, and are aware of pain syndrome research.",
    "health_el": "Τα GBGV είναι γενικά υγιής ράτσα με τυπική διάρκεια ζωής 12–14 χρόνια. Λοιμώξεις αυτιών κοινές. Δυσπλασία ισχίου μπορεί. Ο υποθυρεοειδισμός τεκμηριώθηκε. Οφθαλμικές παθήσεις πρέπει να ελέγχονται. Σύνδρομο πόνου τεκμηριώθηκε — υπό έρευνα. IVDD πιθανή. Η ράτσα ωφελείται από αυξανόμενη διεθνή προσοχή. Οι εκτροφείς ελέγχουν ισχία, μάτια, επιγονατίδα, καρδιά."
  },
  {
    "id": "grand-bleu-de-gascogne",
    "slug": "grand-bleu-de-gascogne",
    "name_en": "Grand Bleu de Gascogne",
    "name_el": "Γκραν Μπλε ντε Γκασκόν",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Calm", "Gentle", "Determined", "Sociable", "Loyal"],
    "temperament_el": ["Ήρεμος", "Ήπιος", "Αποφασιστικός", "Κοινωνικός", "Πιστός"],
    "description_en": "The Grand Bleu de Gascogne is one of the oldest and most noble French scent hound breeds, tracing its ancestry to the medieval hunting dogs of Gascony in southwestern France, with possible links to dogs brought by Phoenician traders and later refined during the era of Gaston Phoebus in the 14th century. Standing 60–72 cm and weighing 32–36 kg, they are a large, elegant hound with a distinctive 'blue' mottled coat created by black hairs dispersed through a white base, giving an overall blue-slate appearance, complemented by black patches, tan markings above the eyes, and long, thin, curling ears set low on the head. Originally used to hunt wolves and large game in packs, they were prized by French aristocracy for centuries. Henry IV of France was said to own a pack of these hounds. They have a remarkably deep, melodious, carrying voice that is legendary among hound enthusiasts. Grand Bleus are calm, gentle, dignified dogs at home — they are affectionate with their families, tolerant of children, and peaceful with other dogs, reflecting their pack hound heritage. In the field, they transform into determined, persistent trackers with incredible stamina.",
    "description_el": "Το Grand Bleu de Gascogne είναι μία από τις αρχαιότερες γαλλικές ράτσες μυρωδιάς, με ρίζες σε μεσαιωνικά κυνηγετικά σκυλιά της Γασκώνης. 60–72 εκ. και 32–36 κιλά, με χαρακτηριστικό «μπλε» ριγέ τρίχωμα. Αρχικά χρησιμοποιούνταν για κυνήγι λύκων. Ο Ερρίκος Δ' της Γαλλίας διατηρούσε αγέλη. Βαθιά, μελωδική φωνή. Ήρεμα, ήπια, αξιοπρεπή στο σπίτι — στοργικά με τις οικογένειές τους. Στο πεδίο αποφασιστικοί, επίμονοι ιχνηλάτες με απίστευτη αντοχή.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Grand Bleu de Gascogne need substantial daily exercise — at least 1.5 to 2 hours of walks, hikes, or ideally hunting and tracking work — and they have extraordinary stamina that was bred for all-day hunts. They are remarkably calm and gentle indoors when properly exercised. Their short, dense coat is relatively low-maintenance, requiring weekly brushing to remove loose hair. Their long, pendulous ears must be cleaned regularly to prevent infections. They are pack dogs by nature and do best with other canine companions. Training requires patience — they are not defiant but have a hound's single-minded focus on scent and can be slow to respond when tracking something interesting. They have a deep, carrying bay that is beautiful to hound lovers but potentially problematic in suburban settings. A large, securely fenced property is ideal. They are gentle and tolerant with children. They are not suited to apartment living and need space to move.",
    "care_el": "Τα Grand Bleu de Gascogne χρειάζονται σημαντική καθημερινή άσκηση — 1,5 έως 2 ώρες. Εξαιρετικά ήρεμα εσωτερικά. Χαμηλή συντήρηση τριχώματος. Τα αυτιά πρέπει να καθαρίζονται τακτικά. Σκυλιά αγέλης — καλύτερα με σύντροφο. Η εκπαίδευση απαιτεί υπομονή. Βαθιά φωνή. Δεν ταιριάζουν σε διαμέρισμα.",
    "health_en": "Grand Bleu de Gascogne are generally a robust, healthy breed with a typical lifespan of 10–12 years, benefiting from centuries of selection for working stamina. Hip dysplasia can occur in this large breed — screening is advisable. Ear infections are common due to their extremely long ears — regular cleaning is essential. Bloat (gastric dilatation-volvulus) is a risk in any deep-chested large breed — feeding smaller meals and avoiding exercise around mealtimes are prudent precautions. Elbow dysplasia may develop. Hypothyroidism has been occasionally reported. Eye conditions including ectropion (drooping lower eyelids) are possible given the breed's loose facial skin. Skin conditions may occur. The breed's relatively small gene pool outside France means breeders should be attentive to maintaining genetic diversity. Regular veterinary check-ups, proper nutrition, and adequate exercise are the foundations of health. Responsible breeders screen for hips, elbows, and eyes.",
    "health_el": "Τα Grand Bleu de Gascogne είναι γενικά ανθεκτική ράτσα με τυπική διάρκεια ζωής 10–12 χρόνια. Δυσπλασία ισχίου μπορεί. Λοιμώξεις αυτιών κοινές. Φούσκωμα (GDV) κίνδυνος. Δυσπλασία αγκώνα πιθανή. Υποθυρεοειδισμός αναφέρθηκε. Εκτρόπιο πιθανό. Η μικρή γενετική δεξαμενή εκτός Γαλλίας σημαίνει ότι οι εκτροφείς πρέπει να διατηρούν γενετική ποικιλότητα. Οι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια."
  },
  {
    "id": "hamiltonstovare",
    "slug": "hamiltonstovare",
    "name_en": "Hamiltonstövare",
    "name_el": "Χάμιλτονστέβαρε",
    "type": "dog",
    "origin": "Sweden",
    "originCode": "SE",
    "images": [],
    "size": "large",
    "lifespan": "10-13 years",
    "temperament_en": ["Friendly", "Energetic", "Calm", "Devoted", "Even-tempered"],
    "temperament_el": ["Φιλικός", "Ενεργητικός", "Ήρεμος", "Αφοσιωμένος", "Ισορροπημένος"],
    "description_en": "The Hamiltonstövare (Hamilton Hound) is Sweden's most popular and beloved scent hound, created in the late 19th century by Count Adolf Patrick Hamilton, the founder of the Swedish Kennel Club, who crossed English Foxhounds with German hounds (Holsteiner Bracke, Heidebracke, and Curlandish Hound) to produce the ideal Scandinavian hunting hound. Standing 49–61 cm and weighing 23–27 kg, they are a strikingly handsome tricolor hound with a rich black saddle, warm tan markings, and white on the chest, feet, and tail tip, complemented by a noble head and expressive dark brown eyes. Unlike many European hound breeds that hunt in packs, the Hamiltonstövare was specifically developed to hunt individually with a single hunter, tracking hare and fox through the Swedish forests and driving game toward the waiting hunter. They are remarkably versatile in temperament — energetic, tireless, and focused in the field, yet calm, gentle, and affectionate at home. They have become increasingly popular as family companions across Scandinavia and beyond, prized for their even temperament, friendliness toward everyone including children and strangers, and their striking good looks.",
    "description_el": "Το Hamiltonstövare είναι ο πιο δημοφιλής σκύλος μυρωδιάς της Σουηδίας, δημιουργημένος από τον Κόμη Adolf Patrick Hamilton. 49–61 εκ. και 23–27 κιλά, εντυπωσιακό τρίχρωμο. Αναπτύχθηκε για ατομικό κυνήγι λαγού και αλεπούς στα σουηδικά δάση. Αξιοσημείωτα ευέλικτο σε ιδιοσυγκρασία — ενεργητικό στο πεδίο, ήρεμο και στοργικό στο σπίτι. Όλο και πιο δημοφιλές ως οικογενειακός σύντροφος σε Σκανδιναβία και πέραν.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Hamiltonstövare need substantial daily exercise — at least 1 to 1.5 hours of vigorous walks, runs, or hikes — and they excel at scent work, tracking, and canine sports that engage their nose and stamina. They are remarkably calm and well-behaved indoors when properly exercised. Their dense, close-fitting tricolor coat is relatively low-maintenance, requiring weekly brushing and more frequent attention during seasonal shedding periods. They are intelligent and willing to please, making training more straightforward than with many hound breeds, though they do have a hound's nose-driven focus that can override commands when they catch an interesting scent. Secure fencing is essential. They are exceptionally friendly with everyone — family, children, strangers, and other dogs — making them excellent family companions. They can be vocal with a melodious hound voice. They are not suited to being left alone for extended periods and can develop separation anxiety.",
    "care_el": "Τα Hamiltonstövare χρειάζονται σημαντική καθημερινή άσκηση — 1 έως 1,5 ώρες. Εξαιρετικά ήρεμα εσωτερικά. Εβδομαδιαίο βούρτσισμα. Ευφυή και πρόθυμα — εκπαίδευση ευκολότερη από πολλά hounds. Ασφαλής περίφραξη απαραίτητη. Εξαιρετικά φιλικά με όλους. Μπορεί να αναπτύξουν άγχος αποχωρισμού.",
    "health_en": "Hamiltonstövare are generally a healthy, hardy breed with a typical lifespan of 10–13 years. Hip dysplasia is the primary orthopedic concern — OFA screening is recommended. Elbow dysplasia can also occur. Epilepsy has been documented in the breed and is an area of concern for Scandinavian breeders. Hypothyroidism may develop. Ear infections can occur due to their pendant ears — regular cleaning is recommended. Bloat (GDV) is a potential risk in this deep-chested breed. Eye conditions including progressive retinal atrophy (PRA) have been occasionally reported. Cardiac conditions are uncommon but can occur. The breed benefits from relatively strong genetic diversity within Scandinavia. Regular veterinary check-ups, proper nutrition, and adequate exercise are important for maintaining health. Responsible breeders screen for hips, elbows, eyes, and are aware of epilepsy in certain lines.",
    "health_el": "Τα Hamiltonstövare είναι γενικά υγιής, ανθεκτική ράτσα με τυπική διάρκεια ζωής 10–13 χρόνια. Δυσπλασία ισχίου κύρια ανησυχία. Η επιληψία τεκμηριώθηκε. Υποθυρεοειδισμός πιθανός. Λοιμώξεις αυτιών λόγω κρεμαστών αυτιών. Φούσκωμα (GDV) κίνδυνος. PRA αναφέρθηκε. Η ράτσα ωφελείται από σχετικά ισχυρή γενετική ποικιλότητα. Οι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια."
  },
  {
    "id": "harrier",
    "slug": "harrier",
    "name_en": "Harrier",
    "name_el": "Χάριερ",
    "type": "dog",
    "origin": "United Kingdom",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Outgoing", "Friendly", "Active", "Tolerant", "People-oriented"],
    "temperament_el": ["Εξωστρεφής", "Φιλικός", "Δραστήριος", "Ανεκτικός", "Κεντραρισμένος σε ανθρώπους"],
    "description_en": "The Harrier is one of the oldest and most storied English hound breeds, with documented packs dating back to the 13th century — the Penistone Pack in England was established in 1260, making Harrier packs among the oldest organized hunting institutions in the English-speaking world. Standing 48–53 cm and weighing 20–27 kg, they sit between the smaller Beagle and the larger English Foxhound in size, and were developed specifically for hunting hare in packs at a pace that mounted or foot-following hunters could comfortably maintain. They are well-muscled, athletic hounds with a classic tricolor or bicolor coat, expressive eyes, and a balanced, workmanlike build designed for endurance rather than speed. Harriers are renowned for their outgoing, friendly, and people-oriented temperament — they are among the most sociable of all hound breeds, genuinely happy to meet everyone, getting along wonderfully with children, other dogs, and even strangers. Their pack heritage means they thrive on companionship and do poorly when isolated. They have a melodious, carrying voice and an excellent nose. Despite being one of the rarest AKC breeds in the United States, they have devoted admirers who prize their versatility as both field hounds and family companions.",
    "description_el": "Το Harrier είναι μία από τις αρχαιότερες αγγλικές ράτσες μυρωδιάς — η Penistone Pack ιδρύθηκε το 1260. 48–53 εκ. και 20–27 κιλά, αναπτύχθηκε για κυνήγι λαγού σε αγέλες. Αθλητικοί, ανθεκτικοί σκύλοι. Διάσημοι για εξωστρεφή, φιλική ιδιοσυγκρασία — μεταξύ των πιο κοινωνικών hounds. Ευδοκιμούν με συντροφιά. Παρά τη σπανιότητά τους, έχουν αφοσιωμένους θαυμαστές.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Harriers need substantial daily exercise — at least 1 to 1.5 hours of vigorous walks, runs, or off-leash time in a securely fenced area — and they have the stamina for all-day hikes and outdoor adventures. Secure fencing is absolutely essential, as their powerful nose and pack-hunting instincts will lead them to follow scent trails without hesitation. Their short, dense coat is low-maintenance, requiring only weekly brushing. They are exceptionally food-motivated, which makes them relatively trainable for a hound breed — positive reinforcement with food rewards works wonderfully. They are pack animals and strongly prefer canine or human company; owning two is often easier than one, as a single Harrier left alone may become destructive or vocally distressed. They are outstanding family dogs — patient and playful with children. They can be vocal with a classic hound bay. Their cheerful, adaptable nature makes them excellent companions for active families who enjoy outdoor activities.",
    "care_el": "Τα Harrier χρειάζονται σημαντική καθημερινή άσκηση — 1 έως 1,5 ώρες. Ασφαλής περίφραξη απολύτως απαραίτητη. Χαμηλή συντήρηση τριχώματος. Εξαιρετικά κινητοποιημένα από φαγητό — σχετικά εκπαιδεύσιμα. Σκυλιά αγέλης — προτιμούν συντροφιά. Εξαιρετικά οικογενειακά σκυλιά. Μπορεί να γαβγίζουν.",
    "health_en": "Harriers are generally a healthy, robust breed with a typical lifespan of 12–15 years, benefiting from centuries of selection for working fitness. Hip dysplasia is the primary orthopedic concern — OFA screening is recommended. Ear infections may occur due to their pendant ears. Eye conditions including cataracts and progressive retinal atrophy (PRA) have been occasionally reported. Hypothyroidism can develop. Bloat (GDV) is a potential risk. Epilepsy has been seen in some lines. The breed's extremely small population in many countries (particularly the US) raises concerns about maintaining genetic diversity — responsible breeders work to expand the gene pool while maintaining breed type. They tend to maintain good weight with proper diet and exercise, though their food motivation means overfeeding is a risk. Regular veterinary check-ups and preventive care support longevity. Responsible breeders screen for hips, eyes, and thyroid.",
    "health_el": "Τα Harrier είναι γενικά υγιής, ανθεκτική ράτσα με τυπική διάρκεια ζωής 12–15 χρόνια. Δυσπλασία ισχίου κύρια ανησυχία. Λοιμώξεις αυτιών πιθανές. Οφθαλμικές παθήσεις αναφέρθηκαν. Υποθυρεοειδισμός πιθανός. Φούσκωμα (GDV) κίνδυνος. Ο μικρός πληθυσμός εγείρει ανησυχίες για γενετική ποικιλότητα. Οι εκτροφείς ελέγχουν ισχία, μάτια, θυρεοειδή."
  },
  {
    "id": "norwegian-dunker",
    "slug": "norwegian-dunker",
    "name_en": "Norwegian Dunker",
    "name_el": "Νορβηγικός Ντάνκερ",
    "type": "dog",
    "origin": "Norway",
    "originCode": "NO",
    "images": [],
    "size": "medium",
    "lifespan": "10-12 years",
    "temperament_en": ["Calm", "Friendly", "Energetic", "Good-natured", "Devoted"],
    "temperament_el": ["Ήρεμος", "Φιλικός", "Ενεργητικός", "Καλόκαρδος", "Αφοσιωμένος"],
    "description_en": "The Norwegian Dunker (also known as the Dunker Hound) is a medium-sized scent hound developed in Norway in the early 19th century by Captain Wilhelm Dunker, who crossed Russian harlequin-colored hounds with reliable Norwegian scent hounds to create a breed optimized for tracking hare through the harsh Scandinavian winter terrain. Standing 47–57 cm and weighing 16–22 kg, the Dunker is distinguished by its unique 'blue marbled' or dappled coat pattern (caused by the merle gene) with black, white, and tan markings, though solid-colored individuals also occur. They are built for endurance in challenging conditions — their robust frame, dense coat, and tireless work ethic allow them to track game through deep snow and rugged terrain for hours. The Dunker is calm, friendly, and good-natured at home — they are devoted to their families, gentle with children, and get along well with other dogs. In the field, they transform into focused, persistent trackers with excellent scenting ability. They remain predominantly a working hound in Norway, though they are gaining appreciation as family companions. The breed is rare outside Scandinavia, and Norwegian breeders work diligently to maintain the breed's health and working qualities.",
    "description_el": "Ο Νορβηγικός Ντάνκερ αναπτύχθηκε τον 19ο αιώνα από τον Καπετάνιο Wilhelm Dunker, διασταυρώνοντας αρλεκίν ρωσικά hounds με νορβηγικά σκυλιά μυρωδιάς. 47–57 εκ. και 16–22 κιλά, με μοναδικό «μπλε μαρμαρωτό» τρίχωμα (γονίδιο merle). Χτισμένα για αντοχή σε σκληρές συνθήκες — ιχνηλατούν σε βαθύ χιόνι ώρες. Ήρεμα, φιλικά, αφοσιωμένα. Σπάνια εκτός Σκανδιναβίας, Νορβηγοί εκτροφείς διατηρούν την υγεία και εργατικές ικανότητες.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Norwegian Dunkers need substantial daily exercise — at least 1 to 1.5 hours of vigorous walks, hikes, or tracking activities — and they are built for endurance in challenging outdoor conditions. They are calm and well-mannered indoors when properly exercised. Their dense, straight coat requires only weekly brushing but sheds moderately. Training is relatively straightforward as hound breeds go — Dunkers are willing to please and respond well to positive reinforcement, though they can become single-minded when they catch an interesting scent. Secure fencing is important to prevent scent-trailing escapes. They are friendly, social dogs that get along well with families, children, and other dogs. They can be vocal and will bay when excited or tracking. They do best with an active, outdoor-oriented family that can provide the exercise and mental stimulation they need. Socialization from puppyhood helps them develop into well-rounded companions.",
    "care_el": "Τα Norwegian Dunker χρειάζονται σημαντική καθημερινή άσκηση — 1 έως 1,5 ώρες. Ήρεμα εσωτερικά. Εβδομαδιαίο βούρτσισμα. Σχετικά εύκολη εκπαίδευση. Ασφαλής περίφραξη. Φιλικά με οικογένειες, παιδιά, άλλα σκυλιά. Μπορεί να γαβγίζουν. Καλύτερα με ενεργή οικογένεια.",
    "health_en": "Norwegian Dunkers have a typical lifespan of 10–12 years. The most significant breed-specific health concern is deafness, which is linked to the merle gene that produces their distinctive dappled coat — dogs with excessive white or double-merle genetics are at particularly high risk, and BAER (Brainstem Auditory Evoked Response) testing is essential for all breeding stock. Hip dysplasia can occur — OFA or equivalent screening is recommended. Ear infections may develop due to their pendant ears. Eye conditions can occur, and merle-patterned dogs should receive ophthalmologic screening. Hypothyroidism has been documented. Bloat (GDV) is a potential risk. The breed's relatively small population means maintaining genetic diversity is an ongoing concern for breeders. Norwegian breed clubs actively monitor health data and encourage responsible breeding practices. Regular veterinary check-ups, BAER testing for puppies, and proper nutrition support long-term health. Responsible breeders screen for hearing, hips, and eyes.",
    "health_el": "Τα Norwegian Dunker έχουν τυπική διάρκεια ζωής 10–12 χρόνια. Η κώφωση συνδέεται με γονίδιο merle — BAER έλεγχος απαραίτητος. Δυσπλασία ισχίου πιθανή. Λοιμώξεις αυτιών. Οφθαλμικές παθήσεις — merle σκυλιά πρέπει να ελέγχονται. Υποθυρεοειδισμός τεκμηριώθηκε. Φούσκωμα κίνδυνος. Μικρός πληθυσμός σημαίνει ανησυχία γενετικής ποικιλότητας. Οι εκτροφείς ελέγχουν ακοή, ισχία, μάτια."
  },
  {
    "id": "otterhound",
    "slug": "otterhound",
    "name_en": "Otterhound",
    "name_el": "Όττερχάουντ",
    "type": "dog",
    "origin": "United Kingdom",
    "originCode": "GB",
    "images": [],
    "size": "large",
    "lifespan": "10-13 years",
    "temperament_en": ["Amiable", "Bouncy", "Even-tempered", "Independent", "Vocal"],
    "temperament_el": ["Φιλικός", "Ζωηρός", "Ισορροπημένος", "Ανεξάρτητος", "Φωνακλάς"],
    "description_en": "The Otterhound is one of the rarest and most endangered dog breeds in the world, with fewer than 600 individuals believed to exist globally — making them rarer than the Giant Panda. This large, shaggy British hound stands 61–69 cm and weighs 36–52 kg, developed centuries ago specifically for hunting otters in the cold rivers and streams of England and Wales. Their unique physical adaptations for aquatic work include large webbed feet (the most webbed of any dog breed), a rough, oily double coat that provides waterproof insulation, and an incredibly powerful nose that can detect otter scent in water — a remarkable feat known as 'spraint tracking.' Otterhound packs were documented as early as the 12th century, and King John of England kept a pack. When otter hunting was banned in England in 1978 due to declining otter populations, the Otterhound breed itself was left without a purpose and numbers plummeted. They are amiable, boisterous, independent dogs with a clownish, lovable personality. They have one of the most distinctive and resonant voices of any breed — a deep, rolling bay that can carry for miles. Despite their dire population numbers, devoted breed enthusiasts worldwide are working to ensure their survival.",
    "description_el": "Το Otterhound είναι μία από τις σπανιότερες ράτσες στον κόσμο — λιγότερα από 600 άτομα παγκοσμίως. 61–69 εκ. και 36–52 κιλά, αναπτύχθηκε για κυνήγι βιδράκων. Μοναδικές προσαρμογές: μεγάλα πατούσια με μεμβράνες, λαδερό αδιάβροχο τρίχωμα, ικανότητα ανίχνευσης οσμών στο νερό. Τεκμηριωμένα από τον 12ο αιώνα. Φιλικά, ζωηρά, ανεξάρτητα με βαθιά, ηχηρή φωνή. Αφοσιωμένοι λάτρεις εργάζονται για την επιβίωσή τους.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 4, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Otterhounds need substantial daily exercise — at least 1 to 1.5 hours of vigorous activity — and they absolutely love swimming, which is an ideal exercise for this aquatic breed. Their rough, oily double coat requires significant maintenance: thorough brushing at least 2–3 times per week to prevent painful matting, with particular attention to the beard and leg furnishings. Their beards get wet and messy during eating and drinking — dedicated Otterhound owners keep towels handy. Ear care is critical due to their long, folded ears; weekly cleaning prevents chronic infections. They are independent and can be stubborn — training requires patience, humor, and high-value rewards. Secure, tall fencing is absolutely essential; Otterhounds are surprisingly athletic and can climb, dig, and jump. They have one of the loudest, most resonant voices of any breed and will bay enthusiastically. They are messy dogs — they drool, track water through the house, and their shaggy coats collect debris. Despite all this, their endearing personality and gentle nature make them beloved companions for those willing to manage the maintenance.",
    "care_el": "Τα Otterhound χρειάζονται σημαντική καθημερινή άσκηση — 1 έως 1,5 ώρες — και αγαπούν την κολύμβηση. Βούρτσισμα 2–3 φορές εβδομαδιαία. Η γενειάδα βρέχεται. Φροντίδα αυτιών κρίσιμη. Ανεξάρτητα, πεισματάρικα — υπομονή στην εκπαίδευση. Ασφαλής, ψηλή περίφραξη απαραίτητη. Βαθιά, ηχηρή φωνή. Ακατάστατα σκυλιά αλλά αξιαγάπητα.",
    "health_en": "Otterhounds have a typical lifespan of 10–13 years. The most significant breed-specific health concern is Glanzmann's thrombasthenia, an inherited bleeding disorder caused by a deficiency in platelet glycoprotein — DNA testing is available and all breeding stock should be tested. Hip dysplasia is common in this large breed — OFA screening is essential. Bloat (gastric dilatation-volvulus) is a serious risk given their deep chest — preventive gastropexy may be recommended. Epilepsy has been documented in the breed. Elbow dysplasia can occur. Ear infections are chronic in many Otterhounds due to their heavy, folded ears. Hypothyroidism may develop. Some skin conditions and sebaceous cysts can occur. The breed's critically small population means maintaining genetic diversity is the most urgent long-term health concern — breed clubs maintain careful breeding records and encourage health testing. Cancer, particularly lymphoma, has been reported. Regular veterinary monitoring, Glanzmann's testing, and careful breeding are paramount. Responsible breeders screen for Glanzmann's, hips, elbows, and cardiac function.",
    "health_el": "Τα Otterhound έχουν τυπική διάρκεια ζωής 10–13 χρόνια. Η θρομβασθένεια Glanzmann κληρονομική αιμορραγική διαταραχή — DNA τεστ απαραίτητο. Δυσπλασία ισχίου κοινή. Φούσκωμα σοβαρός κίνδυνος. Επιληψία τεκμηριώθηκε. Λοιμώξεις αυτιών χρόνιες. Ο κριτικά μικρός πληθυσμός σημαίνει ότι η γενετική ποικιλότητα είναι η πιο επείγουσα ανησυχία. Καρκίνος αναφέρθηκε. Οι εκτροφείς ελέγχουν Glanzmann's, ισχία, αγκώνα, καρδιά."
  },
  {
    "id": "petit-basset-griffon-vendeen",
    "slug": "petit-basset-griffon-vendeen",
    "name_en": "Petit Basset Griffon Vendéen",
    "name_el": "Πετί Μπασέ Γκριφόν Βαντέα",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "small",
    "lifespan": "12-14 years",
    "temperament_en": ["Lively", "Happy", "Independent", "Friendly", "Vocal"],
    "temperament_el": ["Ζωντανός", "Ευτυχισμένος", "Ανεξάρτητος", "Φιλικός", "Φωνακλάς"],
    "description_en": "The Petit Basset Griffon Vendéen (PBGV) is a small, rough-coated French scent hound from the rocky Vendée region of western France, developed to hunt rabbits through dense undergrowth and over the challenging coastal terrain. Standing 33–38 cm and weighing 11–18 kg, the PBGV is the smaller of the two Basset Griffon Vendéen varieties, distinguished by a tousled, wiry coat, long eyebrows, a charming beard, and an irresistibly happy, alert expression that has earned them the French nickname 'the happy breed.' The breed's motto is 'a big dog in a small package' — they are remarkably confident, bold, and energetic for their size. PBGVs were historically used in packs to flush rabbits from burrows and thick cover, and their compact size, rough protective coat, and fearless tenacity made them perfectly adapted for this demanding work. They are extraordinarily friendly, cheerful, and outgoing — genuinely happy to meet everyone and getting along wonderfully with children, other dogs, and even strangers. Their independent spirit and joyful determination make them both entertaining and occasionally exasperating companions.",
    "description_el": "Το PBGV είναι μικρό γαλλικό σκυλί μυρωδιάς από τη Vendée, αναπτυγμένο για κυνήγι κουνελιών. 33–38 εκ. και 11–18 κιλά, με τραχύ τρίχωμα, μακριά φρύδια και αξιαγάπητη γενειάδα. Γαλλικό παρατσούκλι: «η ευτυχισμένη ράτσα». Αξιοσημείωτα σίγουρα και τολμηρά για το μέγεθός τους. Εξαιρετικά φιλικά, εύθυμα. Ανεξάρτητο πνεύμα — ψυχαγωγικοί αλλά μερικές φορές εξοργιστικοί σύντροφοι.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 5, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "PBGVs need good daily exercise — at least 45 minutes to 1 hour of walks, play, or scent activities — and they have more energy than their small size suggests. Their rough, wiry coat requires weekly brushing and periodic hand-stripping or professional grooming every few months to maintain proper texture and prevent matting. They are notorious escape artists — they can dig under, climb over, or find gaps in fencing with remarkable ingenuity, so secure fencing is absolutely essential. Training is a joyful challenge — PBGVs are intelligent but supremely independent, and they approach obedience with a cheerful 'what's in it for me?' attitude. Positive reinforcement with high-value treats and short, varied training sessions work best. They excel at agility, scent work, and barn hunt. They are incredibly social and friendly with everyone. They can be vocal with an enthusiastic bark. They are active, merry companions that bring constant entertainment and laughter to their households.",
    "care_el": "Τα PBGV χρειάζονται καλή καθημερινή άσκηση — 45 λεπτά έως 1 ώρα. Εβδομαδιαίο βούρτσισμα και περιοδικό stripping. Διάσημοι δραπέτες — ασφαλής περίφραξη. Η εκπαίδευση εύθυμη πρόκληση — ανεξάρτητα. Θετική ενίσχυση. Εξαιρετικά κοινωνικά. Μπορεί να γαβγίζουν. Φέρνουν ψυχαγωγία και γέλιο.",
    "health_en": "PBGVs are generally a healthy breed with a typical lifespan of 12–14 years. Ear infections are common due to their long, pendulous ears — regular cleaning is essential. Eye conditions including persistent pupillary membranes (PPM), lens luxation, and glaucoma should be screened for — the breed club recommends annual eye exams. Patellar luxation can occur. Hip dysplasia is less common than in larger breeds but has been documented. Hypothyroidism may develop. Epilepsy has been reported in some lines. PBGV pain syndrome (also called steroid-responsive meningitis-arteritis) is a breed-specific condition causing episodes of pain, fever, and reluctance to move in young dogs — awareness and early veterinary intervention are important. Allergies and skin conditions may occur. Intervertebral disc issues are possible in any long-bodied breed. The breed benefits from an engaged international health community. Responsible breeders screen for eyes, patellae, hips, thyroid, and cardiac function.",
    "health_el": "Τα PBGV είναι γενικά υγιής ράτσα με τυπική διάρκεια ζωής 12–14 χρόνια. Λοιμώξεις αυτιών κοινές. Οφθαλμικές παθήσεις πρέπει να ελέγχονται — ετήσιες εξετάσεις ματιών. Εξάρθρωση επιγονατίδας πιθανή. Σύνδρομο πόνου PBGV — μηνιγγίτιδα που ανταποκρίνεται σε στεροειδή. Επιληψία αναφέρθηκε. Αλλεργίες πιθανές. Οι εκτροφείς ελέγχουν μάτια, επιγονατίδα, ισχία, θυρεοειδή, καρδιά."
  },
  {
    "id": "plott-hound",
    "slug": "plott-hound",
    "name_en": "Plott Hound",
    "name_el": "Πλοτ Χάουντ",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "12-14 years",
    "temperament_en": ["Brave", "Loyal", "Energetic", "Intelligent", "Determined"],
    "temperament_el": ["Θαρραλέος", "Πιστός", "Ενεργητικός", "Έξυπνος", "Αποφασιστικός"],
    "description_en": "The Plott Hound is a unique American breed with a fascinating heritage — the only coonhound breed that does not trace back to English Foxhound ancestry. Instead, they descend from German Hanover Hounds (Schweisshunden) brought to the Appalachian Mountains of North Carolina by Johannes Georg Plott, a German immigrant, in 1750. The Plott family bred these dogs for generations, developing them into fearless, tenacious big-game hounds capable of tracking and baying wild boar and black bear through the rugged Smoky Mountains. Standing 51–64 cm and weighing 18–27 kg, they are muscular, athletic hounds with a distinctive brindle coat (ranging from light to dark brindle with various markings) — the only hound breed where brindle is the preferred color. In 1989, the Plott Hound was designated the official state dog of North Carolina. They are brave, intelligent, and intensely loyal — they bond deeply with their families and can be protective. They have a clear, high-pitched voice that shifts to a distinctive 'chop' when they've treed game. Plotts are more serious and focused than many hound breeds, reflecting their heritage as determined big-game trackers rather than pack-running scent hounds.",
    "description_el": "Το Plott Hound είναι μοναδική αμερικανική ράτσα — το μόνο coonhound χωρίς αγγλική καταγωγή. Κατάγεται από γερμανικά Hanover Hounds που έφερε ο Johannes Georg Plott στη Βόρεια Καρολίνα το 1750. 51–64 εκ. και 18–27 κιλά, με χαρακτηριστικό brindle τρίχωμα. Επίσημο σκυλί πολιτείας Β. Καρολίνας από 1989. Θαρραλέα, έξυπνα, βαθιά πιστά. Πιο σοβαρά και εστιασμένα από πολλά hounds.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 3, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Plott Hounds need substantial daily exercise — at least 1 to 2 hours of vigorous activity including hiking, running, tracking, or hunting — and they have the endurance and drive of a dog bred for all-day mountain hunts. They are more intense and focused than many hound breeds and need an outlet for their energy and intelligence. Their short, smooth brindle coat is very low-maintenance, requiring only weekly brushing. Early socialization is extremely important — Plotts can be reserved or wary with strangers if not properly socialized. Training should be consistent and firm but fair — they are intelligent and willing to work but can be independent. They bond strongly with their primary handler and can be protective of their family and property. Secure fencing is essential — their prey drive and tracking instincts are powerful. They can be vocal with a distinctive treeing voice. They are best suited to experienced, active owners who understand working hound temperament.",
    "care_el": "Τα Plott Hound χρειάζονται σημαντική καθημερινή άσκηση — 1 έως 2 ώρες. Εντονότερα από πολλά hounds. Χαμηλή συντήρηση τριχώματος. Πρώιμη κοινωνικοποίηση εξαιρετικά σημαντική. Σταθερή εκπαίδευση. Δένονται ισχυρά με τον ιδιοκτήτη. Ασφαλής περίφραξη. Φωνακλά. Καλύτερα με έμπειρους ιδιοκτήτες.",
    "health_en": "Plott Hounds are generally a healthy, hardy breed with a typical lifespan of 12–14 years, reflecting their heritage as tough working mountain dogs. Hip dysplasia is the primary orthopedic concern — OFA screening is recommended. Bloat (gastric dilatation-volvulus) can occur in this deep-chested breed — feeding smaller meals and avoiding exercise around mealtimes are prudent. Ear infections may develop, particularly in dogs that work in wet environments. Hypothyroidism has been occasionally reported. Eye conditions are uncommon but should be screened for. The breed has maintained relatively good genetic health due to its working heritage — breeders who hunt their dogs tend to select for vigor and stamina. Injuries from hunting (cuts, sprains, encounters with game) are common in working Plotts. Skin conditions may occur. The breed's moderate popularity helps maintain a reasonable gene pool. Regular veterinary care and proper nutrition support longevity. Responsible breeders screen for hips, elbows, eyes, and cardiac function.",
    "health_el": "Τα Plott Hound είναι γενικά υγιής, ανθεκτική ράτσα με τυπική διάρκεια ζωής 12–14 χρόνια. Δυσπλασία ισχίου κύρια ανησυχία. Φούσκωμα (GDV) πιθανό. Λοιμώξεις αυτιών. Υποθυρεοειδισμός αναφέρθηκε. Η κληρονομιά εργασίας διατήρησε καλή υγεία. Τραυματισμοί κυνηγιού κοινοί σε εργαζόμενα σκυλιά. Οι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, καρδιά."
  },
  {
    "id": "porcelaine",
    "slug": "porcelaine",
    "name_en": "Porcelaine",
    "name_el": "Πορσελέν",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Elegant", "Friendly", "Energetic", "Determined", "Affectionate"],
    "temperament_el": ["Κομψός", "Φιλικός", "Ενεργητικός", "Αποφασιστικός", "Στοργικός"],
    "description_en": "The Porcelaine is widely considered the oldest and most beautiful of the French scent hound breeds, named for its stunning, glossy white coat that gleams like fine French porcelain. Standing 53–58 cm and weighing 25–28 kg, this elegant, refined hound traces its ancestry back to the now-extinct Montaimboeuf, a white hound of medieval France, with possible contributions from English Harriers and Swiss Laufhunds. The breed nearly disappeared during the French Revolution when aristocratic hunting packs were destroyed, but was painstakingly reconstructed in the early 19th century by French and Swiss breeders. Their coat is a translucent white through which the underlying pink skin gives a porcelain-like glow, with small orange or lemon spots (particularly on the ears). They have long, thin, low-set ears, a finely chiseled head, and a noble, graceful bearing. Porcelaines are used for hunting hare, roe deer, and sometimes wild boar, typically in packs of six to twenty. They are friendly, affectionate, and gentle at home — they bond closely with their families and are good with children. In the field, they are energetic, determined trackers with a clear, melodious voice. They remain rare outside France and Switzerland.",
    "description_el": "Η Porcelaine θεωρείται η αρχαιότερη και ομορφότερη γαλλική ράτσα μυρωδιάς, ονομασμένη από το γυαλιστερό λευκό τρίχωμα που λάμπει σαν πορσελάνη. 53–58 εκ. και 25–28 κιλά. Σχεδόν εξαφανίστηκε στη Γαλλική Επανάσταση, ανακατασκευάστηκε τον 19ο αιώνα. Μεταφανές λευκό τρίχωμα με πορτοκαλί κηλίδες. Χρησιμοποιούνται για κυνήγι λαγού και ελαφιού σε αγέλες. Φιλικές, στοργικές, ήπιες. Σπάνιες εκτός Γαλλίας και Ελβετίας.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Porcelaines need substantial daily exercise — at least 1 to 1.5 hours of vigorous activity — and they are at their happiest when given opportunities for tracking and scent work. Their short, glossy coat is remarkably easy to maintain, requiring only weekly brushing and occasional bathing to maintain its characteristic porcelain sheen. Their thin, low-set ears should be cleaned regularly to prevent infections. Training is relatively cooperative for a scent hound — Porcelaines are willing to please and respond well to positive reinforcement, though they can become single-minded when they catch an interesting scent trail. Secure fencing is essential. They are pack-oriented dogs and thrive with canine companionship. They are gentle, affectionate family dogs that get along well with children. They can be vocal with a clear, carrying voice. They are not suited to urban apartment life — they need space and activity. Their white coat shows dirt easily, which is something potential owners should consider.",
    "care_el": "Οι Porcelaine χρειάζονται σημαντική καθημερινή άσκηση — 1 έως 1,5 ώρες. Χαμηλή συντήρηση τριχώματος. Τα αυτιά πρέπει να καθαρίζονται τακτικά. Σχετικά συνεργάσιμες στην εκπαίδευση. Ασφαλής περίφραξη. Σκυλιά αγέλης — ευδοκιμούν με σύντροφο. Ήπια οικογενειακά σκυλιά. Φωνακλά. Δεν ταιριάζουν σε διαμέρισμα.",
    "health_en": "Porcelaines are generally a healthy, hardy breed with a typical lifespan of 12–14 years, benefiting from a long history of selection for working stamina. Hip dysplasia can occur — screening is recommended. Ear infections are possible due to their long ears — regular cleaning is important. Bloat (GDV) is a potential risk in this medium-large, deep-chested breed. Eye conditions are uncommon but occasional ectropion may occur. Hypothyroidism has been occasionally reported. The breed's very small population outside France means genetic diversity is a concern — French breed clubs maintain careful records to manage breeding. Skin sensitivity and sunburn can affect their white, thin-skinned coat — dogs with very sparse coat coverage should be protected from prolonged sun exposure. Regular veterinary check-ups and proper nutrition support their naturally robust health. Responsible breeders screen for hips, eyes, and are attentive to maintaining genetic health within the breed.",
    "health_el": "Οι Porcelaine είναι γενικά υγιής ράτσα με τυπική διάρκεια ζωής 12–14 χρόνια. Δυσπλασία ισχίου πιθανή. Λοιμώξεις αυτιών. Φούσκωμα (GDV) κίνδυνος. Εκτρόπιο σπάνιο. Μικρός πληθυσμός σημαίνει ανησυχία γενετικής ποικιλότητας. Ευαισθησία δέρματος και ηλιακό έγκαυμα πιθανά λόγω λευκού τριχώματος. Οι εκτροφείς ελέγχουν ισχία, μάτια."
  },
  {
    "id": "redbone-coonhound",
    "slug": "redbone-coonhound",
    "name_en": "Redbone Coonhound",
    "name_el": "Ρεντμπον Coonhound",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "12-15 years",
    "temperament_en": ["Friendly", "Eager", "Devoted", "Vocal", "Energetic"],
    "temperament_el": ["Φιλικός", "Πρόθυμος", "Αφοσιωμένος", "Φωνακλάς", "Ενεργητικός"],
    "description_en": "The Redbone Coonhound is a strikingly beautiful American scent hound recognized for its gorgeous, solid deep-red coat — one of the only hound breeds with a uniform color. Standing 53–69 cm and weighing 20–32 kg, Redbones were developed in the late 18th century in the southern United States from red foxhounds brought by Scottish and Irish immigrants, refined over generations by coonhunters who selected for a flashy red coat, cold-trailing ability, and a melodious voice. They earned literary fame as the breed featured in Wilson Rawls' beloved 1961 novel 'Where the Red Fern Grows,' which introduced millions of readers to the devotion and courage of these hounds. Redbones are versatile hunters used for raccoon, bear, mountain lion, and deer, equally adept at tracking cold trails and swimming across rivers to follow game. They are among the most people-friendly of all coonhound breeds — outgoing, eager to please, and genuinely affectionate with their families. They have a sweet, mellow temperament at home and a distinctive, plaintive voice in the field. Their handsome appearance and agreeable personality have made them increasingly popular as family companions.",
    "description_el": "Το Redbone Coonhound είναι εντυπωσιακό αμερικανικό σκυλί μυρωδιάς με συμπαγές βαθύ κόκκινο τρίχωμα. 53–69 εκ. και 20–32 κιλά. Αναπτύχθηκε τον 18ο αιώνα στις νότιες ΗΠΑ. Κέρδισε λογοτεχνική φήμη στο 'Where the Red Fern Grows'. Ευέλικτοι κυνηγοί για ρακούν, αρκούδα, πούμα. Μεταξύ των πιο φιλικών coonhounds — εξωστρεφή, πρόθυμα, στοργικά. Γλυκιά, ήρεμη ιδιοσυγκρασία στο σπίτι.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Redbone Coonhounds need substantial daily exercise — at least 1 to 1.5 hours of vigorous walking, hiking, running, or ideally tracking and hunting — and they have impressive stamina built for all-day hunts. Secure fencing is absolutely essential, as their powerful nose and strong prey drive will lead them to follow scent trails with single-minded determination. Their short, smooth red coat is very low-maintenance, requiring only weekly brushing. Their long, pendulous ears must be checked and cleaned regularly to prevent infections. Redbones are among the more trainable coonhound breeds — they are eager to please and respond well to positive reinforcement with food rewards. Early socialization helps them develop their naturally friendly disposition. They are excellent with children and get along well with other dogs. They have a distinctive, melodious voice and can be vocal — their baying can carry considerable distance. They are affectionate, laid-back house dogs when properly exercised and love to be with their families.",
    "care_el": "Τα Redbone Coonhound χρειάζονται σημαντική καθημερινή άσκηση — 1 έως 1,5 ώρες. Ασφαλής περίφραξη απολύτως απαραίτητη. Χαμηλή συντήρηση τριχώματος. Τα αυτιά πρέπει να καθαρίζονται τακτικά. Μεταξύ πιο εκπαιδεύσιμων coonhounds. Εξαιρετικά με παιδιά. Φωνακλά με μελωδική φωνή. Στοργικά στο σπίτι.",
    "health_en": "Redbone Coonhounds are generally a healthy, robust breed with a typical lifespan of 12–15 years. Hip dysplasia is the primary orthopedic concern — OFA screening is recommended. Ear infections are common due to their long, folded ears — regular cleaning is essential. Bloat (GDV) can occur in this deep-chested breed — feeding smaller meals is advisable. Eye conditions including ectropion and cherry eye have been occasionally reported. Hypothyroidism may develop. The breed can be prone to obesity if overfed and under-exercised, which exacerbates joint problems. Some Redbones may carry a gene for coonhound paralysis (idiopathic polyradiculoneuritis), a condition causing sudden onset weakness that typically resolves with supportive care. Allergies and skin conditions are uncommon but possible. The breed maintains good genetic diversity due to a healthy population of working dogs. Regular veterinary care, proper nutrition, and adequate exercise support their naturally robust health. Responsible breeders screen for hips, elbows, eyes, and cardiac function.",
    "health_el": "Τα Redbone Coonhound είναι γενικά υγιής ράτσα με τυπική διάρκεια ζωής 12–15 χρόνια. Δυσπλασία ισχίου κύρια ανησυχία. Λοιμώξεις αυτιών κοινές. Φούσκωμα (GDV) πιθανό. Οφθαλμικές παθήσεις σπάνιες. Παράλυση coonhound πιθανή — αυτοϊώμενη. Η ράτσα διατηρεί καλή γενετική ποικιλότητα. Οι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, καρδιά."
  },
  {
    "id": "rhodesian-ridgeback",
    "slug": "rhodesian-ridgeback",
    "name_en": "Rhodesian Ridgeback",
    "name_el": "Ροδεσικός Ridgeback",
    "type": "dog",
    "origin": "Zimbabwe",
    "originCode": "ZW",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Loyal", "Dignified", "Strong-willed", "Affectionate", "Reserved"],
    "temperament_el": ["Πιστός", "Αξιοπρεπής", "Πεισματάρης", "Στοργικός", "Συνεσταλμένος"],
    "description_en": "The Rhodesian Ridgeback is a powerful, athletic hound developed in southern Africa (in what was then Rhodesia, now Zimbabwe) by European settlers who crossed their hunting dogs with the semi-wild ridged dogs of the indigenous Khoikhoi people. Standing 61–69 cm and weighing 32–41 kg, they are a large, muscular, wheaten-colored hound defined by their most distinctive feature: a symmetrical ridge of hair running along the spine in the opposite direction to the rest of the coat, formed by two crowns (whorls) at the top. Originally bred to track and bay lions — holding them at bay until the hunter arrived, never actually fighting them — Ridgebacks earned the nickname 'African Lion Hound.' They are also exceptional guard dogs and versatile hunting companions that were used to protect farms from predators and track game across vast African terrain. The breed standard was established in 1922 in Rhodesia. Ridgebacks are dignified, intelligent, loyal, and quietly confident — they are deeply devoted to their families and gentle with children they know, yet naturally reserved and watchful with strangers. They are one of the few hound breeds that also serves as an effective guardian. Their combination of athleticism, beauty, and noble character has made them one of the most popular hound breeds worldwide.",
    "description_el": "Το Rhodesian Ridgeback αναπτύχθηκε στη νότια Αφρική διασταυρώνοντας ευρωπαϊκά κυνηγετικά σκυλιά με τους ημι-άγριους ridged σκύλους των Khoikhoi. 61–69 εκ. και 32–41 κιλά, με χαρακτηριστική ράχη τριχών. Αρχικά εκτρεφόταν για να ιχνηλατεί και να κρατά λιοντάρια — «African Lion Hound». Εξαιρετικοί φύλακες. Πρότυπο ράτσας 1922. Αξιοπρεπή, έξυπνα, βαθιά πιστά — ήπια με τα παιδιά, συνεσταλμένα με ξένους. Από τις πιο δημοφιλείς ράτσες hound παγκοσμίως.",
    "characteristics": { "energy": 4, "grooming": 1, "friendliness": 3, "trainability": 3, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Rhodesian Ridgebacks need substantial daily exercise — at least 1 to 2 hours of vigorous walking, running, hiking, or lure coursing — and their athletic endurance means they can easily keep up with running or cycling owners. Their short, dense wheaten coat is one of the easiest of all breeds to maintain, requiring only weekly brushing and occasional bathing. Training requires a confident, consistent owner who establishes clear leadership through positive methods — Ridgebacks are intelligent but strong-willed and will test boundaries. Harsh training creates a resentful, stubborn dog; fair, firm, positive training creates a willing partner. Early, extensive socialization is absolutely essential — their natural reserve with strangers can become problematic shyness or aggression without proper exposure. They are naturally protective and make excellent watchdogs without specific guard training. They are gentle and patient with their own family's children but should be supervised with unfamiliar children due to their size and strength. They have relatively low prey drive for a hound breed but should still be supervised around small animals. They are quiet dogs that rarely bark without reason.",
    "care_el": "Τα Rhodesian Ridgeback χρειάζονται σημαντική καθημερινή άσκηση — 1 έως 2 ώρες. Πολύ εύκολη συντήρηση τριχώματος. Η εκπαίδευση απαιτεί σίγουρο ιδιοκτήτη — θετικές μέθοδοι. Πρώιμη κοινωνικοποίηση απολύτως απαραίτητη. Φυσικά προστατευτικά. Ήπια με τα παιδιά. Ήσυχα σκυλιά που σπάνια γαβγίζουν χωρίς λόγο.",
    "health_en": "Rhodesian Ridgebacks have a typical lifespan of 10–12 years. The most significant breed-specific condition is dermoid sinus, a congenital defect where a tube-like channel of skin extends inward along the ridge — all puppies should be checked at birth and affected animals should not be bred. Hip and elbow dysplasia are significant orthopedic concerns — OFA screening is essential. Hypothyroidism is relatively common and manageable with medication. Degenerative myelopathy (DM) is a progressive spinal condition — DNA testing is available and breeding stock should be tested. Bloat (GDV) is a serious risk in this large, deep-chested breed — preventive gastropexy may be discussed with veterinarians. Mast cell tumors and other cancers occur at moderate rates. Eye conditions including entropion and cataracts may develop. Cardiac conditions have been reported. Juvenile myoclonic epilepsy (JME) has been identified in the breed — a DNA test is available. Regular veterinary monitoring and health screening are important. Responsible breeders screen for dermoid sinus, hips, elbows, eyes, thyroid, cardiac function, DM, and JME.",
    "health_el": "Τα Rhodesian Ridgeback έχουν τυπική διάρκεια ζωής 10–12 χρόνια. Dermoid sinus σημαντική συγγενής πάθηση. Δυσπλασία ισχίου/αγκώνα σημαντικές. Υποθυρεοειδισμός σχετικά κοινός. Εκφυλιστική μυελοπάθεια (DM) — DNA τεστ διαθέσιμο. Φούσκωμα (GDV) σοβαρός κίνδυνος. Καρκίνος σε μέτρια ποσοστά. Νεανική μυοκλονική επιληψία (JME) αναγνωρίστηκε. Οι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, θυρεοειδή, καρδιά, DM, JME."
  },
  {
    "id": "segugio-italiano",
    "slug": "segugio-italiano",
    "name_en": "Segugio Italiano",
    "name_el": "Σεγκούτζιο Ιταλιάνο",
    "type": "dog",
    "origin": "Italy",
    "originCode": "IT",
    "images": [],
    "size": "medium",
    "lifespan": "11-13 years",
    "temperament_en": ["Devoted", "Calm", "Energetic", "Friendly", "Passionate"],
    "temperament_el": ["Αφοσιωμένος", "Ήρεμος", "Ενεργητικός", "Φιλικός", "Παθιασμένος"],
    "description_en": "The Segugio Italiano (Italian Hound) is one of the oldest scent hound breeds in the world, with ancestry tracing back to ancient Egyptian coursing hounds that were brought to the Italian peninsula by Phoenician traders over 2,000 years ago — depictions of dogs resembling the modern Segugio appear in ancient Roman mosaics, sculptures, and Pompeian frescoes. Standing 48–58 cm and weighing 18–28 kg, they come in two coat varieties: the Segugio Italiano a Pelo Raso (short-haired) and the Segugio Italiano a Pelo Forte (wire-haired), in colors of fawn, black and tan, or tricolor. They are the most popular and widely used hunting dog in Italy, employed both individually and in packs for tracking hare and wild boar through Italy's varied terrain from Alpine forests to Mediterranean scrubland. The Segugio is an extraordinarily devoted and affectionate companion at home — they form deep, intense bonds with their owners and are gentle, calm house dogs. In the field, they transform into passionate, relentless trackers with one of the finest noses in dogdom and a distinctive, musical baying voice that Italian hunters prize. Their elegant, lean build and expressive dark eyes give them a noble, soulful appearance.",
    "description_el": "Το Segugio Italiano είναι μία από τις αρχαιότερες ράτσες μυρωδιάς, με καταγωγή 2.000+ ετών — εμφανίζεται σε ρωμαϊκά μωσαϊκά και τοιχογραφίες Πομπηίας. 48–58 εκ. και 18–28 κιλά, σε κοντότριχη και τραχύτριχη ποικιλία. Το δημοφιλέστερο κυνηγετικό σκυλί στην Ιταλία, για λαγό και αγριογούρουνο. Εξαιρετικά αφοσιωμένοι και στοργικοί στο σπίτι. Στο πεδίο, παθιασμένοι ιχνηλάτες με μελωδική φωνή. Κομψή, αρχοντική εμφάνιση.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Segugio Italiano need substantial daily exercise — at least 1 to 1.5 hours of vigorous walking, hiking, or tracking activities — and they have the stamina for extended hunts across challenging terrain. They are remarkably calm, gentle, and well-behaved indoors when properly exercised — many Italian owners describe them as 'living room hounds' that love to sleep on the sofa next to their owner. The short-haired variety needs minimal grooming (weekly brushing), while the wire-haired variety requires more attention including occasional hand-stripping. Ear cleaning is important for both varieties. Training is relatively straightforward — Segugi are intelligent and eager to bond with their handler, responding well to positive reinforcement and gentle guidance. They are sensitive dogs that do not respond well to harsh methods. Secure fencing is recommended as their hunting instinct is strong. They are deeply social and can develop separation anxiety if left alone too long. They form intense bonds and are sometimes described as 'velcro dogs' — always wanting to be near their person.",
    "care_el": "Τα Segugio Italiano χρειάζονται σημαντική καθημερινή άσκηση — 1 έως 1,5 ώρες. Αξιοσημείωτα ήρεμα εσωτερικά. Κοντότριχη: ελάχιστη περιποίηση· τραχύτριχη: stripping. Σχετικά εύκολη εκπαίδευση. Ευαίσθητα — δεν ανταποκρίνονται σε σκληρές μεθόδους. Ασφαλής περίφραξη. Βαθιά κοινωνικά — μπορεί να αναπτύξουν άγχος αποχωρισμού. «Velcro dogs».",
    "health_en": "Segugio Italiano are generally a healthy, robust breed with a typical lifespan of 11–13 years, benefiting from millennia of natural and working selection. Hip dysplasia can occur but is less common than in many other breeds of similar size — screening is still recommended. Ear infections may develop, particularly in the wire-haired variety with denser ear furnishings. Bloat (GDV) is a potential risk in this deep-chested breed. Eye conditions are uncommon but should be monitored. Hypothyroidism has been occasionally reported. The breed maintains excellent genetic diversity in Italy due to its enormous working population. Skin conditions and allergies are uncommon. They tend to be lean, athletic dogs that maintain healthy weight with proper exercise — obesity is less of a concern than in some hound breeds. Field injuries (cuts, sprains) are common in working dogs. Regular veterinary care and proper nutrition support their naturally vigorous health. Responsible breeders screen for hips, eyes, and cardiac function.",
    "health_el": "Τα Segugio Italiano είναι γενικά υγιής, ανθεκτική ράτσα με τυπική διάρκεια ζωής 11–13 χρόνια. Δυσπλασία ισχίου λιγότερο κοινή. Λοιμώξεις αυτιών πιθανές. Φούσκωμα (GDV) κίνδυνος. Εξαιρετική γενετική ποικιλότητα στην Ιταλία. Αθλητικά σκυλιά που διατηρούν υγιές βάρος. Τραυματισμοί πεδίου κοινοί σε εργαζόμενα σκυλιά. Οι εκτροφείς ελέγχουν ισχία, μάτια, καρδιά."
  },
  {
    "id": "treeing-walker-coonhound",
    "slug": "treeing-walker-coonhound",
    "name_en": "Treeing Walker Coonhound",
    "name_el": "Τρίινγκ Γουόκερ Coonhound",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "12-13 years",
    "temperament_en": ["Friendly", "Intelligent", "Energetic", "Confident", "Vocal"],
    "temperament_el": ["Φιλικός", "Έξυπνος", "Ενεργητικός", "Σίγουρος", "Φωνακλάς"],
    "description_en": "The Treeing Walker Coonhound is the most popular and widely used coonhound breed in the United States, developed from Walker Foxhounds (themselves descended from the English Foxhound) in the mid-20th century. Standing 51–69 cm and weighing 20–32 kg, they are a sleek, athletic, tricolor hound with a classic white, black, and tan coat that has earned them the nickname 'the people's choice' among coonhound enthusiasts. The breed's development was heavily influenced by a stolen dog of unknown origin called 'Tennessee Lead' in the 1850s, who was crossed into the Walker Foxhound line and produced offspring with exceptional treeing instinct and speed. Treeing Walkers are named for their hunting style — they trail raccoons with incredible speed and agility, then 'tree' them (drive them up a tree and bay at the base until the hunter arrives), with a distinctive change in voice from trailing to treeing that experienced hunters can read from great distances. They are among the most intelligent and trainable of the coonhound breeds — friendly, confident, and eager to work. Off the hunt, they are affectionate, outgoing family dogs that get along well with children and other dogs. They are considered the 'athletes' of the coonhound world — fast, agile, and competitive.",
    "description_el": "Το Treeing Walker Coonhound είναι το πιο δημοφιλές coonhound στις ΗΠΑ, αναπτυγμένο από Walker Foxhounds. 51–69 εκ. και 20–32 κιλά, κομψό τρίχρωμο. Επηρεάστηκε από τον 'Tennessee Lead' τη δεκαετία 1850. Ονομάστηκε από το στυλ κυνηγιού — ιχνηλατεί ρακούν και τα ανεβάζει σε δέντρα. Μεταξύ πιο ευφυών coonhounds — φιλικά, σίγουρα. Στοργικά οικογενειακά σκυλιά. Θεωρούνται οι «αθλητές» του κόσμου coonhound.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Treeing Walker Coonhounds need substantial daily exercise — at least 1 to 2 hours of vigorous activity — and they are among the most athletic and high-energy of all hound breeds. They excel at coonhound field trials, nite hunts, agility, and any activity that channels their speed and intelligence. Secure, tall fencing is absolutely essential — Treeing Walkers are remarkably athletic and can scale surprisingly tall fences when motivated by prey drive. Their short, smooth coat is very low-maintenance, requiring only weekly brushing. Their pendant ears should be cleaned regularly. They are among the most intelligent and trainable coonhound breeds — they are eager to please and respond enthusiastically to positive reinforcement, especially food rewards. They are friendly, social dogs that get along well with children, other dogs, and even strangers. They have a loud, distinctive baying voice that changes character from trailing to treeing — this is prized by hunters but can be problematic in residential neighborhoods. They need both physical exercise and mental stimulation to be happy. They are affectionate, loyal companions that want to be part of the family.",
    "care_el": "Τα Treeing Walker Coonhound χρειάζονται σημαντική καθημερινή άσκηση — 1 έως 2 ώρες. Μεταξύ πιο αθλητικών hounds. Ασφαλής, ψηλή περίφραξη απαραίτητη. Χαμηλή συντήρηση τριχώματος. Τα αυτιά πρέπει να καθαρίζονται. Μεταξύ πιο εκπαιδεύσιμων coonhounds. Φιλικά, κοινωνικά. Δυνατή φωνή. Στοργικά οικογενειακά σκυλιά.",
    "health_en": "Treeing Walker Coonhounds are generally a healthy, hardy breed with a typical lifespan of 12–13 years. Hip dysplasia is the primary orthopedic concern — OFA screening is recommended. Ear infections are common due to their long, folded ears — regular cleaning is essential. Bloat (GDV) can occur in this deep-chested breed. Eye conditions including ectropion and cherry eye have been occasionally reported. Hypothyroidism may develop. Coonhound paralysis (idiopathic polyradiculoneuritis), potentially triggered by raccoon bites, causes sudden onset weakness and is more common in working coonhounds — it typically resolves with supportive care over several weeks. Allergies and skin conditions are uncommon but possible. The breed maintains good genetic diversity due to its large working population. Field injuries are common in hunting dogs. They tend to maintain athletic condition with proper exercise, though their food motivation means weight management requires attention. Regular veterinary care supports their robust health. Responsible breeders screen for hips, eyes, and cardiac function.",
    "health_el": "Τα Treeing Walker Coonhound είναι γενικά υγιής ράτσα με τυπική διάρκεια ζωής 12–13 χρόνια. Δυσπλασία ισχίου κύρια ανησυχία. Λοιμώξεις αυτιών κοινές. Φούσκωμα (GDV) πιθανό. Παράλυση coonhound — πιθανώς από δαγκώματα ρακούν. Η ράτσα διατηρεί καλή γενετική ποικιλότητα. Τραυματισμοί πεδίου κοινοί. Αθλητική κατάσταση. Οι εκτροφείς ελέγχουν ισχία, μάτια, καρδιά."
  }
]
