[
  {
    "id": "affenpinscher",
    "slug": "affenpinscher",
    "name_en": "Affenpinscher",
    "name_el": "Αφενπίνσερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Fearless", "Curious", "Stubborn", "Playful", "Loyal"],
    "temperament_el": ["Ατρόμητος", "Περίεργος", "Πεισματάρης", "Παιχνιδιάρης", "Πιστός"],
    "description_en": "The Affenpinscher is a small, wiry-coated breed whose name means 'monkey terrier' in German, reflecting their mischievous, expressive face and lively character. Originally bred in Germany during the 17th century to catch rats in kitchens, granaries, and stables, they are among the oldest toy breeds in Europe. Despite their tiny size, Affenpinschers are bold, confident, and fearless—traits that made them effective ratters. They are intensely loyal to their families and often form a strong bond with one person. They can be stubborn and territorial with other dogs but are also playful, entertaining, and devoted companions. Today they excel as alert watchdogs and charming lap dogs.",
    "description_el": "Το Αφενπίνσερ είναι μια μικρή ράτσα με σκληρό τρίχωμα, το όνομα της οποίας σημαίνει 'τεριέ μαϊμού' στα γερμανικά, αντικατοπτρίζοντας το κακόπιστo, εκφραστικό πρόσωπο και ζωηρό χαρακτήρα της. Αρχικά εκτράφηκε στη Γερμανία κατά τον 17ο αιώνα για να πιάνει αρουραίους σε κουζίνες, αποθήκες σιτηρών και σταύλους και είναι από τις παλαιότερες toy ράτσες στην Ευρώπη. Παρά το μικρό τους μέγεθος, τα Αφενπίνσερ είναι τολμηρά, σίγουρα και ατρόμητα. Είναι βαθιά πιστά στην οικογένειά τους και συχνά δημιουργούν ισχυρό δεσμό με ένα άτομο. Μπορεί να είναι πεισματάρηδες και εδαφικά απέναντι σε άλλα σκυλιά αλλά είναι επίσης παιχνιδιάρηδες, διασκεδαστικοί και αφοσιωμένοι σύντροφοι. Σήμερα διαπρέπουν ως επαγρύπνους φύλακες και γοητευτικά κατοικίδια.",
    "characteristics": { "energy": 3, "grooming": 3, "friendliness": 3, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Affenpinschers need moderate daily exercise—about 30 to 45 minutes of walks and play—plus mental stimulation through training and puzzle toys to prevent boredom. Their wiry coat requires hand-stripping every few months or clipping to maintain texture and reduce shedding; many owners use a professional groomer. They are prone to small-dog syndrome if not trained with consistency, so clear boundaries and positive reinforcement from an early age are important. Early socialization with people, other dogs, and pets helps them become well-rounded companions. They can be vocal and may need training to curb excessive barking. They adapt well to apartment living but should not be left alone for long periods. A secure, small-dog-appropriate diet helps maintain dental and joint health.",
    "care_el": "Τα Αφενπίνσερ χρειάζονται μέτρια καθημερινή άσκηση—περίπου 30 έως 45 λεπτά βόλτων και παιχνιδιού—και νοητική διέγερση μέσω εκπαίδευσης και παζλ για να αποφευχθεί η πλήξη. Το σκληρό τρίχωμά τους απαιτεί hand-stripping κάθε λίγους μήνες ή κούρεμα για να διατηρηθεί η υφή και να μειωθεί η τριχόπτωση· πολλοί ιδιοκτήτες χρησιμοποιούν επαγγελματία. Είναι επιρρεπή στο σύνδρομο μικρού σκύλου αν δεν εκπαιδευτούν με συνέπεια, επομένως σαφή όρια και θετική ενίσχυση από μικρή ηλικία είναι σημαντικά. Η πρώιμη κοινωνικοποίηση με ανθρώπους, άλλα σκυλιά και κατοικίδια βοηθά να γίνουν ισορροπημένοι σύντροφοι. Μπορεί να είναι φωνακλά και μπορεί να χρειαστεί εκπαίδευση για να περιοριστεί το υπερβολικό γάβγισμα. Προσαρμόζονται καλά σε διαβίωση σε διαμέρισμα αλλά δεν πρέπει να μένουν μόνα για πολλές ώρες. Διατροφή κατάλληλη για μικρά σκυλιά βοηθά στη διατήρηση της υγείας δοντιών και αρθρώσεων.",
    "health_en": "Affenpinschers are generally healthy but may be prone to patellar luxation (slipping kneecaps), hip dysplasia, and respiratory issues due to their short muzzles—avoid overexertion in heat. Legg-Calve-Perthes disease (degeneration of the femoral head) and heart murmurs are occasionally seen; a vet may recommend screening. Dental care is important due to small jaw crowding: regular brushing and dental chews help. Eye conditions such as cataracts and progressive retinal atrophy can occur in older dogs. Maintaining a healthy weight reduces stress on joints. Regular veterinary checkups and choosing a breeder who screens for patellar luxation and cardiac issues help ensure a long, healthy life (typically 12–15 years).",
    "health_el": "Τα Αφενπίνσερ είναι γενικά υγιή αλλά μπορεί να εμφανίσουν εξάρθρωση επιγονατίδας, δυσπλασία ισχίου και αναπνευστικά προβλήματα λόγω του κοντού ρύγχους—αποφεύγετε την υπερβολική άσκηση στη ζέστη. Η νόσος Legg-Calve-Perthes και καρδιακοί ψιθυρισμοί εμφανίζονται περιστασιακά· ο κτηνίατρος μπορεί να συνιστά έλεγχο. Η φροντίδα δοντιών είναι σημαντική λόγω του μικρού σαγονιού: τακτικό βούρτσισμα και μασήματα βοηθούν. Οφθαλμικές παθήσεις όπως καταρράκτης και προοδευτική ατροφία αμφιβληστροειδούς μπορεί να εμφανιστούν σε ηλικιωμένα σκυλιά. Η διατήρηση υγιούς βάρους μειώνει το στρες στις αρθρώσεις. Τακτικοί κτηνιατρικοί έλεγχοι και επιλογή εκτροφέα που ελέγχει για εξάρθρωση επιγονατίδας και καρδιακά προβλήματα βοηθούν σε μακρά, υγιή ζωή (τυπικά 12–15 χρόνια)."
  },
  {
    "id": "appenzeller-sennenhund",
    "slug": "appenzeller-sennenhund",
    "name_en": "Appenzeller Sennenhund",
    "name_el": "Απεντσέλερ Ζενενχουντ",
    "type": "dog",
    "origin": "Switzerland",
    "originCode": "CH",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Energetic", "Loyal", "Confident", "Intelligent", "Vigilant"],
    "temperament_el": ["Ενεργητικός", "Πιστός", "Σίγουρος", "Έξυπνος", "Επαγρύπνος"],
    "description_en": "The Appenzeller Sennenhund is one of four Swiss mountain dog breeds, originally developed in the Appenzell region for herding cattle, pulling carts, and guarding farms. They have a striking tricolor coat (black, tan, and white) and a distinctive curled tail carried over the back. Appenzellers are highly energetic, intelligent working dogs that thrive with an active lifestyle and a clear job to do. They are loyal to their families, vigilant with strangers, and make excellent watchdogs. Historically they drove cattle to alpine pastures; today they excel in dog sports such as agility, obedience, and tracking. Without sufficient exercise and mental stimulation, they can become bored and destructive. They are the rarest of the four Sennenhund breeds.",
    "description_el": "Το Απεντσέλερ Ζενενχουντ είναι μία από τις τέσσερις ελβετικές ράτσες ορεινών σκύλων, που αναπτύχθηκε αρχικά στην περιοχή Απεντσέλ για εκτροφή βοοειδών, έλξη αμαξιών και φύλαξη αγροκτημάτων. Έχουν εντυπωσιακό τρίχρωμο τρίχωμα (μαύρο, καφέ και λευκό) και χαρακτηριστική σγουρή ουρά που φέρεται πάνω από την πλάτη. Είναι πολύ ενεργητικοί, έξυπνοι εργατικοί σκύλοι που ευδοκιμούν με ενεργό τρόπο ζωής και σαφή εργασία. Είναι πιστοί στην οικογένεια, επαγρύπνους με αγνώστους και εξαιρετικοί φύλακες. Ιστορικά οδηγούσαν τα ζώα σε αλπικές βοσκότοπους· σήμερα διαπρέπουν σε αθλήματα όπως ευκινησία, υπακοή και ιχνηλασία. Χωρίς επαρκή άσκηση και νοητική διέγερση μπορεί να γίνουν ανήσυχα και καταστροφικά. Είναι η πιο σπάνια από τις τέσσερις ράτσες Sennenhund.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Appenzellers need substantial daily exercise—at least 1 to 2 hours of long walks, runs, hiking, or active play. They excel at dog sports like agility, obedience, and tracking and enjoy having a job or regular activity. Their short, dense coat is easy to maintain with weekly brushing and occasional bathing. They require consistent, positive training and early socialization with people, other dogs, and different environments. They are not suited to apartment living without ample outdoor access and daily activity. A house with a yard or access to open spaces is ideal. Mental stimulation through training, puzzle toys, and interactive games is essential to prevent boredom and unwanted behaviors.",
    "care_el": "Τα Απεντσέλερ χρειάζονται σημαντική καθημερινή άσκηση—τουλάχιστον 1 έως 2 ώρες μακρινών βόλτων, τρεξίματος, πεζοπορίας ή ενεργού παιχνιδιού. Διαπρέπουν σε αθλήματα σκύλων όπως ευκινησία, υπακοή και ιχνηλασία και απολαμβάνουν να έχουν δουλειά ή τακτική δραστηριότητα. Το κοντό, πυκνό τρίχωμά τους είναι εύκολο στη συντήρηση με εβδομαδιαίο βούρτσισμα και περιστασιακό μπάνιο. Απαιτούν σταθερή, θετική εκπαίδευση και πρώιμη κοινωνικοποίηση με ανθρώπους, άλλα σκυλιά και διαφορετικά περιβάλλοντα. Δεν είναι κατάλληλα για διαβίωση σε διαμέρισμα χωρίς επαρκή πρόσβαση σε εξωτερικούς χώρους και καθημερινή δραστηριότητα. Ιδανικό είναι σπίτι με προαύλιο ή πρόσβαση σε ανοιχτούς χώρους. Η νοητική διέγερση μέσω εκπαίδευσης, παζλ και διαδραστικών παιχνιδιών είναι απαραίτητη για την πρόληψη πλήξης και ανεπιθύμητων συμπεριφορών.",
    "health_en": "Appenzeller Sennenhunds may be prone to hip dysplasia, so choosing a breeder who performs OFA or similar hip screening is recommended. Progressive retinal atrophy (PRA) can affect vision in some lines—breeders may test for this. Bloat (gastric dilatation-volvulus) can occur in deep-chested breeds; feeding two smaller meals and avoiding vigorous exercise right after eating can help reduce risk. Overall they are a relatively healthy, robust breed with a typical lifespan of 12–15 years. Regular veterinary checkups, maintaining a healthy weight, and appropriate exercise support long-term health.",
    "health_el": "Τα Απεντσέλερ Ζενενχουντ μπορεί να εμφανίσουν δυσπλασία ισχίου· συνιστάται η επιλογή εκτροφέα που πραγματοποιεί OFA ή παρόμοιο έλεγχο ισχίου. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) μπορεί να επηρεάσει την όραση σε ορισμένες σειρές—οι εκτροφείς μπορεί να ελέγχουν για αυτό. Το φούσκωμα (γαστρική διάταση-συστροφή) μπορεί να εμφανιστεί σε ράτσες με βαθύ στήθος· η σίτιση δύο μικρότερων γευμάτων και η αποφυγή έντονης άσκησης αμέσως μετά το φαγητό μπορεί να μειώσει τον κίνδυνο. Γενικά είναι σχετικά υγιή, ανθεκτική ράτσα με τυπική διάρκεια ζωής 12–15 ετών. Τακτικοί κτηνιατρικοί έλεγχοι, διατήρηση υγιούς βάρους και κατάλληλη άσκηση υποστηρίζουν τη μακροπρόθεσμη υγεία."
  },
  {
    "id": "austrian-pinscher",
    "slug": "austrian-pinscher",
    "name_en": "Austrian Pinscher",
    "name_el": "Αυστριακός Πίνσερ",
    "type": "dog",
    "origin": "Austria",
    "originCode": "AT",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Lively", "Devoted", "Alert", "Persistent", "Playful"],
    "temperament_el": ["Ζωηρός", "Αφοσιωμένος", "Επαγρύπνος", "Πεισματάρης", "Παιχνιδιάρης"],
    "description_en": "The Austrian Pinscher is a medium-sized breed developed in Austria for versatile farm work, including ratting, guarding property, and driving livestock. They have a short, dense coat in red, tan, or black-and-tan and an alert, intelligent expression. Austrian Pinschers are lively, devoted companions that bond closely with their families and are known for their playful, persistent nature. They are alert watchdogs and retain strong hunting and chasing instincts toward small animals. The breed was nearly extinct after World War II but has been revived by dedicated enthusiasts in Austria and remains rare outside its homeland. They are versatile working dogs that thrive with activity and purpose.",
    "description_el": "Ο Αυστριακός Πίνσερ είναι ράτσα μεσαίου μεγέθους που αναπτύχθηκε στην Αυστρία για ευέλικτη αγροτική εργασία, συμπεριλαμβανομένων του θανάτωσης αρουραίων, φύλαξης ιδιοκτησίας και οδήγησης ζώων. Έχουν κοντό, πυκνό τρίχωμα σε κόκκινο, καφέ ή μαύρο-καφέ και επαγρύπνου, έξυπνου ύφους. Είναι ζωηροί, αφοσιωμένοι σύντροφοι που δένονται στενά με την οικογένεια και είναι γνωστοί για τη παιχνιδιάρικη, επίμονη φύση τους. Είναι επαγρύπνους φύλακες και διατηρούν ισχυρά ένστικτα κυνήγι και καταδίωξης μικρών ζώων. Η ράτσα είχε σχεδόν εξαφανιστεί μετά τον Β' Παγκόσμιο Πόλεμο αλλά έχει αναβιωθεί από αφοσιωμένους λάτρεις στην Αυστρία και παραμένει σπάνια εκτός πατρίδας. Είναι ευέλικτοι εργατικοί σκύλοι που ευδοκιμούν με δραστηριότητα και σκοπό.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Austrian Pinschers need regular daily exercise—at least 45 minutes to an hour of walks, runs, or play—and mental stimulation to prevent boredom. Their short coat requires minimal grooming: weekly brushing and occasional bathing are sufficient. They benefit from early socialization with people, other dogs, and various environments, and consistent, patient training using positive methods. They may chase small animals due to their hunting heritage, so secure fencing and leash control in unfenced areas are recommended. They adapt to different living situations including homes with yards; they are not suited to being left alone for long hours. A balanced diet and portion control help maintain a healthy weight.",
    "care_el": "Οι Αυστριακοί Πίνσερ χρειάζονται τακτική καθημερινή άσκηση—τουλάχιστον 45 λεπτά έως μία ώρα βόλτων, τρεξίματος ή παιχνιδιού—και νοητική διέγερση για να αποφευχθεί η πλήξη. Το κοντό τρίχωμά τους απαιτεί ελάχιστη περιποίηση: εβδομαδιαίο βούρτσισμα και περιστασιακό μπάνιο αρκούν. Οφελούνται από πρώιμη κοινωνικοποίηση με ανθρώπους, άλλα σκυλιά και διάφορα περιβάλλοντα, και σταθερή, υπομονετική εκπαίδευση με θετικές μεθόδους. Μπορεί να καταδιώκουν μικρά ζώα λόγω της κληρονομικότητας κυνηγιού, επομένως συνιστώνται ασφαλής περίφραξη και έλεγχος με λουρί σε απεριόριστες περιοχές. Προσαρμόζονται σε διαφορετικές συνθήκες διαβίωσης συμπεριλαμβανομένων σπιτιών με προαύλια· δεν είναι κατάλληλοι να μένουν μόνοι για πολλές ώρες. Ισορροπημένη διατροφή και έλεγχος μερίδων βοηθούν στη διατήρηση υγιούς βάρους.",
    "health_en": "Austrian Pinschers are generally robust with few breed-specific health issues. Hip dysplasia may occur, so screening by breeders is beneficial. As a recovered breed with a smaller gene pool, genetic diversity is a consideration and responsible breeding practices are important. Patellar luxation and eye conditions have been reported occasionally. Regular veterinary checkups, maintaining a healthy weight, and appropriate exercise help support a typical lifespan of 12–14 years. Dental care and parasite prevention are part of routine care.",
    "health_el": "Οι Αυστριακοί Πίνσερ είναι γενικά ανθεκτικοί με λίγα ειδικά προβλήματα υγείας της ράτσας. Μπορεί να εμφανιστεί δυσπλασία ισχίου· ο έλεγχος από εκτροφείς είναι ωφέλιμος. Ως ράτσα που έχει αναβιωθεί με μικρότερη γονιδιακή βάση, η γενετική ποικιλότητα είναι ζήτημα και οι υπεύθυνες πρακτικές εκτροφής είναι σημαντικές. Εξάρθρωση επιγονατίδας και οφθαλμικές παθήσεις έχουν αναφερθεί περιστασιακά. Τακτικοί κτηνιατρικοί έλεγχοι, διατήρηση υγιούς βάρους και κατάλληλη άσκηση βοηθούν στη στήριξη τυπικής διάρκειας ζωής 12–14 ετών. Φροντίδα δοντιών και πρόληψη παρασίτων είναι μέρος της ρουτίνας φροντίδας."
  },
  {
    "id": "bernese-mountain-dog",
    "slug": "bernese-mountain-dog",
    "name_en": "Bernese Mountain Dog",
    "name_el": "Μπερνέζικος Ορεινός Σκύλος",
    "type": "dog",
    "origin": "Switzerland",
    "originCode": "CH",
    "images": [],
    "size": "large",
    "lifespan": "7-10 years",
    "temperament_en": ["Affectionate", "Gentle", "Loyal", "Intelligent", "Calm"],
    "temperament_el": ["Στοργικός", "Ήπιος", "Πιστός", "Έξυπνος", "Ήρεμος"],
    "description_en": "The Bernese Mountain Dog is a large, striking breed from the Swiss canton of Bern, with a distinctive tricolor coat of black, rust, and white. Originally used to pull carts, drive cattle, and guard farms in the Alps, they are now beloved family companions and therapy dogs. Berners are affectionate, gentle giants that get along well with children and other animals and are known for their calm, loyal nature. They are intelligent and eager to please, making them trainable for obedience and draft work. Sadly they have a relatively short lifespan (often 7–10 years) and a higher incidence of cancer. They thrive in cooler climates and need daily moderate exercise without overheating.",
    "description_el": "Ο Μπερνέζικος Ορεινός Σκύλος είναι μεγάλη εντυπωσιακή ράτσα από το ελβετικό καντόνι της Βέρνης, με χαρακτηριστικό τρίχρωμο τρίχωμα μαύρο, κοκκινωπό και λευκό. Αρχικά χρησιμοποιούνταν για έλξη αμαξιών, οδήγηση βοοειδών και φύλαξη αγροκτημάτων στα Άλπεια· σήμερα είναι αγαπημένοι οικογενειακοί σύντροφοι και σκύλοι θεραπείας. Είναι στοργικά, ήπια γίγαντα που τα πάνε καλά με παιδιά και άλλα ζώα και είναι γνωστά για την ήρεμη, πιστή φύση τους. Είναι έξυπνα και πρόθυμα να ευχαριστήσουν, γεγονός που τα καθιστά εκπαιδεύσιμα σε υπακοή και έλξη. Δυστυχώς έχουν σχετικά σύντομη διάρκεια ζωής (συχνά 7–10 χρόνια) και υψηλότερη επίπτωση καρκίνου. Ευδοκιμούν σε ψυχρότερα κλίματα και χρειάζονται καθημερινή μέτρια άσκηση χωρίς υπερθέρμανση.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Bernese Mountain Dogs need moderate daily exercise—about 1 hour of walks or light activity—but should avoid overheating in warm weather; exercise in the early morning or evening when it is cooler. Their long, thick double coat requires regular brushing several times a week to prevent matting and to manage shedding, especially during seasonal coat blows. They are prone to weight gain, so portion control and limiting treats are important; obesity worsens joint and heart strain. They bond deeply with their families and do not like to be left alone for long periods; they thrive as indoor family members. Training should be positive and consistent from puppyhood. Cool, well-ventilated living space is ideal.",
    "care_el": "Οι Μπερνέζικοι Ορεινοί Σκύλοι χρειάζονται μέτρια καθημερινή άσκηση—περίπου 1 ώρα βόλτων ή ελαφριάς δραστηριότητας—αλλά πρέπει να αποφεύγουν την υπερθέρμανση σε ζεστό καιρό· ασκήστε τα πρωί νωρίς ή το απόγευμα όταν είναι πιο δροσερά. Το μακρύ, πυκνό διπλό τρίχωμά τους απαιτεί τακτικό βούρτσισμα αρκετές φορές την εβδομάδα για να αποφευχθούν οι κόμποι και να διαχειριστεί η τριχόπτωση, ειδικά κατά τις εποχιακές αλλαγές. Είναι επιρρεπή σε αύξηση βάρους, επομένως ο έλεγχος μερίδων και ο περιορισμός λιχουδιών είναι σημαντικοί· η παχυσαρκία επιδεινώνει το στρες στις αρθρώσεις και την καρδιά. Δένονται βαθιά με την οικογένειά τους και δεν αρέσει να μένουν μόνοι για πολλές ώρες· ευδοκιμούν ως μέλη της οικογένειας στο εσωτερικό. Η εκπαίδευση πρέπει να είναι θετική και σταθερή από κουταβίστικη ηλικία. Ιδανικός είναι δροσερός, καλά αεριζόμενος χώρος διαβίωσης.",
    "health_en": "Bernese Mountain Dogs have a high cancer rate (including histiocytic sarcoma, lymphoma, and mast cell tumors) and a shorter lifespan of about 7–10 years. Hip and elbow dysplasia are common; choose a breeder who performs OFA or PennHIP screening. They may develop bloat (gastric dilatation-volvulus), so feeding two or three smaller meals daily and avoiding vigorous exercise for at least an hour after eating is advised. Cardiac conditions and progressive retinal atrophy can occur. Regular veterinary checkups, cancer awareness, maintaining a healthy weight, and joint-friendly exercise help support quality of life. Health testing by breeders for hips, elbows, and eyes is strongly recommended.",
    "health_el": "Οι Μπερνέζικοι Ορεινοί Σκύλοι έχουν υψηλό ποσοστό καρκίνου (συμπεριλαμβανομένου ιστιοκυτταρικού σαρκώματος, λεμφώματος και όγκων μαστικών κυττάρων) και μικρότερη διάρκεια ζωής περίπου 7–10 ετών. Η δυσπλασία ισχίου και αγκώνα είναι συχνή· επιλέξτε εκτροφέα που πραγματοποιεί OFA ή PennHIP έλεγχο. Μπορεί να εμφανίσουν φούσκωμα (γαστρική διάταση-συστροφή), επομένως συνιστάται σίτιση δύο ή τριών μικρότερων γευμάτων καθημερινά και αποφυγή έντονης άσκησης για τουλάχιστον μία ώρα μετά το φαγητό. Καρδιακές παθήσεις και προοδευτική ατροφία αμφιβληστροειδούς μπορεί να εμφανιστούν. Τακτικοί κτηνιατρικοί έλεγχοι, ευαισθητοποίηση για καρκίνο, διατήρηση υγιούς βάρους και άσκηση φιλική προς τις αρθρώσεις υποστηρίζουν την ποιότητα ζωής. Ο έλεγχος υγείας από εκτροφείς για ισχίο, αγκώνες και μάτια συνιστάται ισχυρά."
  },
  {
    "id": "black-russian-terrier",
    "slug": "black-russian-terrier",
    "name_en": "Black Russian Terrier",
    "name_el": "Μαύρος Ρώσος Τεριέ",
    "type": "dog",
    "origin": "Russia",
    "originCode": "RU",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Confident", "Calm", "Courageous", "Loyal", "Protective"],
    "temperament_el": ["Σίγουρος", "Ήρεμος", "Θαρραλέος", "Πιστός", "Προστατευτικός"],
    "description_en": "The Black Russian Terrier (BRT) was developed in the Soviet Union in the mid-20th century as a military, border, and working dog by crossing several breeds including the Giant Schnauzer, Rottweiler, and Airedale. Despite the name, they are not true terriers but a large, powerful molosser-type breed with a distinctive black, wiry, double coat that protects against cold and moisture. BRTs are confident, calm, and intensely loyal to their families and are natural guard dogs with strong protective instincts. They require experienced owners who can provide firm, consistent training and extensive early socialization. When properly raised, they are steady with their families and reserved with strangers, making them excellent working and companion dogs for the right home.",
    "description_el": "Ο Μαύρος Ρώσος Τεριέ (BRT) αναπτύχθηκε στη Σοβιετική Ένωση στα μέσα του 20ού αιώνα ως στρατιωτικός, συνοριακός και εργατικός σκύλος με διασταύρωση πολλών ρατσών συμπεριλαμβανομένων του Γιγαντιαίου Σνάουτσερ, Ροτβάιλερ και Έρντεϊλ. Παρά το όνομα, δεν είναι αληθινά τεριέ αλλά μεγάλη, ισχυρή ράτσα τύπου molosser με χαρακτηριστικό μαύρο, σκληρό διπλό τρίχωμα που προστατεύει από το κρύο και την υγρασία. Είναι σίγουροι, ήρεμοι και βαθιά πιστοί στην οικογένειά τους και φυσικοί φύλακες με ισχυρά προστατευτικά ένστικτα. Απαιτούν έμπειρους ιδιοκτήτες που μπορούν να παρέχουν σταθερή, συνεπή εκπαίδευση και εκτενή πρώιμη κοινωνικοποίηση. Όταν εκτραφούν σωστά, είναι σταθερά με την οικογένεια και προφυλακτικά με αγνώστους, γεγονός που τα καθιστά εξαιρετικά εργατικά και συντροφικά σκυλιά για το κατάλληλο σπίτι.",
    "characteristics": { "energy": 4, "grooming": 5, "friendliness": 3, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Black Russian Terriers need substantial daily exercise—at least 1 to 2 hours of walks, runs, or structured activity—and mental stimulation through training, obedience work, or dog sports. Their dense, wiry coat requires regular professional grooming every 6–8 weeks and frequent brushing at home to prevent matting; many owners use a groomer experienced with the breed. They need consistent, confident leadership and early, ongoing socialization with people, other dogs, and various environments to remain stable and manageable. They are not suited to first-time dog owners or passive households. A secure yard and clear house rules support their role as family guardians. Diet should be appropriate for large, active dogs.",
    "care_el": "Οι Μαύροι Ρώσοι Τεριέ χρειάζονται σημαντική καθημερινή άσκηση—τουλάχιστον 1 έως 2 ώρες βόλτων, τρεξίματος ή δομημένης δραστηριότητας—και νοητική διέγερση μέσω εκπαίδευσης, υπακοής ή αθλημάτων σκύλων. Το πυκνό, σκληρό τρίχωμά τους απαιτεί τακτική επαγγελματική περιποίηση κάθε 6–8 εβδομάδες και συχνό βούρτσισμα στο σπίτι για να αποφευχθούν οι κόμποι· πολλοί ιδιοκτήτες χρησιμοποιούν groomer με εμπειρία στη ράτσα. Απαιτούν σταθερή, σίγουρη ηγεσία και πρώιμη, συνεχής κοινωνικοποίηση με ανθρώπους, άλλα σκυλιά και διάφορα περιβάλλοντα ώστε να παραμείνουν σταθερά και διαχειρίσιμα. Δεν είναι κατάλληλοι για ιδιοκτήτες που έχουν για πρώτη φορά σκύλο ή παθητικά νοικοκυριά. Ασφαλές προαύλιο και σαφείς κανόνες στο σπίτι υποστηρίζουν το ρόλο τους ως οικογενειακούς φύλακες. Η διατροφή πρέπει να είναι κατάλληλη για μεγάλα, ενεργά σκυλιά.",
    "health_en": "Black Russian Terriers may be prone to hip and elbow dysplasia—OFA or PennHIP screening by breeders is recommended. Heart conditions including dilated cardiomyopathy (DCM) and eye issues such as progressive retinal atrophy (PRA) and hereditary cataracts have been reported; cardiac and eye screening are advised. Juvenile laryngeal paralysis and polyneuropathy (HNPP) have been reported in some lines. Hypothyroidism can occur. Regular health screenings, maintaining a healthy weight, and responsible breeding help reduce risks. Typical lifespan is about 10–12 years. Discuss breed-specific screening with your veterinarian.",
    "health_el": "Οι Μαύροι Ρώσοι Τεριέ μπορεί να εμφανίσουν δυσπλασία ισχίου και αγκώνα· συνιστάται OFA ή PennHIP έλεγχος από εκτροφείς. Καρδιακές παθήσεις συμπεριλαμβανομένης της διαστολικής καρδιομυοπάθειας (DCM) και οφθαλμικά προβλήματα όπως προοδευτική ατροφία αμφιβληστροειδούς (PRA) και κληρονομικός καταρράκτης έχουν αναφερθεί· συνιστώνται καρδιακός και οφθαλμικός έλεγχος. Παραλυσία λάρυγγα σε νεαρά άτομα και πολυνευροπάθεια (HNPP) έχουν αναφερθεί σε ορισμένες σειρές. Μπορεί να εμφανιστεί υποθυρεοειδισμός. Τακτικοί έλεγχοι υγείας, διατήρηση υγιούς βάρους και υπεύθυνη εκτροφή βοηθούν να μειωθούν οι κίνδυνοι. Τυπική διάρκεια ζωής περίπου 10–12 χρόνια. Συζητήστε τον ειδικό για τη ράτσα έλεγχο με τον κτηνίατρό σας."
  },
  {
    "id": "boerboel",
    "slug": "boerboel",
    "name_en": "Boerboel",
    "name_el": "Μποέρμποελ",
    "type": "dog",
    "origin": "South Africa",
    "originCode": "ZA",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Confident", "Loyal", "Protective", "Calm", "Dominant"],
    "temperament_el": ["Σίγουρος", "Πιστός", "Προστατευτικός", "Ήρεμος", "Κυρίαρχος"],
    "description_en": "The Boerboel is a large South African mastiff-type breed developed by Dutch and other settlers to guard homesteads, farms, and families from predators and intruders. 'Boerboel' means 'farmer's dog' in Afrikaans. They are confident, loyal, and naturally protective of their family and property, with a calm, steady demeanor at home and the ability to act decisively when they perceive a threat. Boerboels are powerful, athletic dogs that form strong bonds with their owners. They require an experienced owner who can establish clear leadership, provide early and ongoing socialization, and manage their size and strength. They are still used as working guard dogs in South Africa and are valued as devoted family companions when properly raised.",
    "description_el": "Το Μποέρμποελ είναι μεγάλη νοτιοαφρικανική ράτσα τύπου μαστίφ που αναπτύχθηκε από Ολλανδούς και άλλους εποίκους για φύλαξη αγροικιών, αγροκτημάτων και οικογενειών από θηρευτές και εισβολείς. «Μποέρμποελ» σημαίνει «σκύλος του αγρότη» στα αφρικάανς. Είναι σίγουρα, πιστά και φυσικά προστατευτικά της οικογένειας και της ιδιοκτησίας, με ήρεμη, σταθερή συμπεριφορά στο σπίτι και ικανότητα να ενεργούν αποφασιστικά όταν αντιλαμβάνονται απειλή. Τα Μποέρμποελ είναι ισχυρά, αθλητικά σκυλιά που δημιουργούν ισχυρούς δεσμούς με τους ιδιοκτήτες. Απαιτούν έμπειρο ιδιοκτήτη που μπορεί να καθιερώσει σαφή ηγεσία, να παρέχει πρώιμη και συνεχή κοινωνικοποίηση και να διαχειριστεί το μέγεθος και τη δύναμή τους. Χρησιμοποιούνται ακόμη ως εργατικοί φύλακες στη Νότια Αφρική και εκτιμώνται ως αφοσιωμένοι οικογενειακοί σύντροφοι όταν εκτραφούν σωστά.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 3, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Boerboels need regular daily exercise—about 1 hour of walks, play, or yard time—and mental stimulation to stay balanced; they are generally calm indoors when needs are met. Their short coat is easy to maintain with weekly brushing and occasional bathing. They require firm, consistent training from puppyhood using positive but clear methods; they respond well to confident, fair leadership. Socialization with people, other dogs, and various environments is critical and should continue into adulthood. They are not suited to apartment living and need a secure, well-fenced yard. They thrive in homes where they are part of family life and have a clear role. Diet should be appropriate for large breeds to support joints and avoid rapid growth in puppies.",
    "care_el": "Τα Μποέρμποελ χρειάζονται τακτική καθημερινή άσκηση—περίπου 1 ώρα βόλτων, παιχνιδιού ή χρόνου στο προαύλιο—και νοητική διέγερση για να παραμείνουν ισορροπημένα· γενικά είναι ήρεμα στο εσωτερικό όταν ικανοποιούνται οι ανάγκες. Το κοντό τρίχωμά τους είναι εύκολο στη συντήρηση με εβδομαδιαίο βούρτσισμα και περιστασιακό μπάνιο. Απαιτούν σταθερή, συνεπή εκπαίδευση από κουταβίστικη ηλικία με θετικές αλλά σαφείς μεθόδους· ανταποκρίνονται καλά σε σίγουρη, δίκαιη ηγεσία. Η κοινωνικοποίηση με ανθρώπους, άλλα σκυλιά και διάφορα περιβάλλοντα είναι κρίσιμη και πρέπει να συνεχιστεί μέχρι την ενηλικίωση. Δεν είναι κατάλληλα για διαβίωση σε διαμέρισμα και χρειάζονται ασφαλές, καλά περιφραγμένο προαύλιο. Ευδοκιμούν σε σπίτια όπου είναι μέρος της οικογενειακής ζωής και έχουν σαφή ρόλο. Η διατροφή πρέπει να είναι κατάλληλη για μεγάλες ράτσες για στήριξη αρθρώσεων και αποφυγή ταχείας ανάπτυξης στα κουτάβια.",
    "health_en": "Boerboels may be prone to hip and elbow dysplasia; choose a breeder who performs OFA or similar screening. Heart disease including dilated cardiomyopathy (DCM) can occur; cardiac screening is recommended. Eyelid issues such as ectropion and entropion have been reported. Bloat (gastric dilatation-volvulus) is a risk in large, deep-chested dogs—feed two smaller meals and avoid vigorous exercise right after eating. Juvenile epilepsy has been reported in some lines. Responsible breeders screen for joint and cardiac conditions. Typical lifespan is about 10–12 years. Regular veterinary checkups and weight management support long-term health.",
    "health_el": "Τα Μποέρμποελ μπορεί να εμφανίσουν δυσπλασία ισχίου και αγκώνα· επιλέξτε εκτροφέα που πραγματοποιεί OFA ή παρόμοιο έλεγχο. Καρδιακές παθήσεις συμπεριλαμβανομένης της διαστολικής καρδιομυοπάθειας (DCM) μπορεί να εμφανιστούν· συνιστάται καρδιακός έλεγχος. Προβλήματα βλεφάρων όπως εκτροπία και εντρόπιον έχουν αναφερθεί. Το φούσκωμα (γαστρική διάταση-συστροφή) είναι κίνδυνος σε μεγάλα σκυλιά με βαθύ στήθος—δίνετε δύο μικρότερα γεύματα και αποφεύγετε έντονη άσκηση αμέσως μετά το φαγητό. Επιληψία σε νεαρά άτομα έχει αναφερθεί σε ορισμένες σειρές. Οι υπεύθυνοι εκτροφείς ελέγχουν για αρθρωτικές και καρδιακές παθήσεις. Τυπική διάρκεια ζωής περίπου 10–12 χρόνια. Τακτικοί κτηνιατρικοί έλεγχοι και διαχείριση βάρους υποστηρίζουν τη μακροπρόθεσμη υγεία."
  },
  {
    "id": "broholmer",
    "slug": "broholmer",
    "name_en": "Broholmer",
    "name_el": "Μπρόχολμερ",
    "type": "dog",
    "origin": "Denmark",
    "originCode": "DK",
    "images": [],
    "size": "large",
    "lifespan": "7-12 years",
    "temperament_en": ["Friendly", "Calm", "Devoted", "Watchful", "Good-natured"],
    "temperament_el": ["Φιλικός", "Ήρεμος", "Αφοσιωμένος", "Επαγρύπνος", "Καλόκαρδος"],
    "description_en": "The Broholmer is a large Danish mastiff-type breed that was used for guarding estates and hunting deer; the breed is named after the Broholm estate where it was preserved. After nearly disappearing in the 20th century, it was recreated in the late 1900s using remaining stock and careful breeding. Broholmers are friendly, calm, and devoted family dogs with a watchful, loyal nature. They are good-natured with their families and generally tolerant with children but can be reserved with strangers until they know them. They need moderate exercise and thrive in a home with space and a yard. They are still rare outside Denmark but are gaining recognition as steady, reliable companions.",
    "description_el": "Το Μπρόχολμερ είναι μεγάλη δανέζικη ράτσα τύπου μαστίφ που χρησιμοποιούνταν για φύλαξη κτημάτων και κυνήγι ελαφιών· η ράτσα πήρε το όνομά της από την έπαυλη Broholm όπου διατηρήθηκε. Μετά από σχεδόν εξαφάνιση τον 20ό αιώνα, αναδημιουργήθηκε στα τέλη του 1900 χρησιμοποιώντας υπόλοιπο στόκ και προσεκτική εκτροφή. Τα Μπρόχολμερ είναι φιλικά, ήρεμα και αφοσιωμένα οικογενειακά σκυλιά με επαγρύπνου, πιστή φύση. Είναι καλόκαρδα με την οικογένειά τους και γενικά ανεκτικά με τα παιδιά αλλά μπορεί να είναι προφυλακτικά με αγνώστους μέχρι να τους γνωρίσουν. Χρειάζονται μέτρια άσκηση και ευδοκιμούν σε σπίτι με χώρο και προαύλιο. Είναι ακόμη σπάνια εκτός Δανίας αλλά κερδίζουν αναγνώριση ως σταθεροί, αξιόπιστοι σύντροφοι.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 4, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Broholmers need moderate daily exercise—about 1 hour of walks, play, or light activity—to stay fit and content. Their short coat requires minimal grooming: weekly brushing and occasional bathing. They benefit from early socialization with people, other dogs, and different situations, and respond well to positive, consistent training. They can be prone to weight gain, so diet and portion control should be monitored; obesity increases joint and heart strain. They do best in homes with a yard where they can move freely. They are generally calm indoors and bond closely with their families. Avoid overexertion in hot weather due to their size.",
    "care_el": "Τα Μπρόχολμερ χρειάζονται μέτρια καθημερινή άσκηση—περίπου 1 ώρα βόλτων, παιχνιδιού ή ελαφριάς δραστηριότητας—για να παραμείνουν σε φόρμα και ικανοποιημένα. Το κοντό τρίχωμά τους απαιτεί ελάχιστη περιποίηση: εβδομαδιαίο βούρτσισμα και περιστασιακό μπάνιο. Οφελούνται από πρώιμη κοινωνικοποίηση με ανθρώπους, άλλα σκυλιά και διαφορετικές καταστάσεις, και ανταποκρίνονται καλά σε θετική, σταθερή εκπαίδευση. Μπορεί να είναι επιρρεπή σε αύξηση βάρους, επομένως η διατροφή και ο έλεγχος μερίδων πρέπει να παρακολουθούνται· η παχυσαρκία αυξάνει το στρες στις αρθρώσεις και την καρδιά. Τα πάνε καλύτερα σε σπίτια με προαύλιο όπου μπορούν να κινούνται ελεύθερα. Γενικά είναι ήρεμα στο εσωτερικό και δένονται στενά με την οικογένεια. Αποφεύγετε την υπερβολική άσκηση σε ζεστό καιρό λόγω του μεγέθους τους.",
    "health_en": "Broholmers may be prone to hip and elbow dysplasia, as with many large breeds; OFA or similar screening by breeders is recommended. Bloat (gastric dilatation-volvulus) can occur; feeding two smaller meals and avoiding exercise right after eating may reduce risk. Heart conditions including dilated cardiomyopathy have been reported. As a recreated breed with a smaller gene pool, genetic diversity and health testing by breeders are important. Regular veterinary checkups, weight management, and joint-friendly exercise support a typical lifespan of about 7–12 years. Discuss large-breed health with your vet.",
    "health_el": "Τα Μπρόχολμερ μπορεί να εμφανίσουν δυσπλασία ισχίου και αγκώνα, όπως πολλές μεγάλες ράτσες· συνιστάται OFA ή παρόμοιος έλεγχος από εκτροφείς. Το φούσκωμα (γαστρική διάταση-συστροφή) μπορεί να εμφανιστεί· η σίτιση δύο μικρότερων γευμάτων και η αποφυγή άσκησης αμέσως μετά το φαγητό μπορεί να μειώσει τον κίνδυνο. Καρδιακές παθήσεις συμπεριλαμβανομένης της διαστολικής καρδιομυοπάθειας έχουν αναφερθεί. Ως αναδημιουργημένη ράτσα με μικρότερη γονιδιακή βάση, η γενετική ποικιλότητα και ο έλεγχος υγείας από εκτροφείς είναι σημαντικοί. Τακτικοί κτηνιατρικοί έλεγχοι, διαχείριση βάρους και άσκηση φιλική προς τις αρθρώσεις υποστηρίζουν τυπική διάρκεια ζωής περίπου 7–12 ετών. Συζητήστε την υγεία μεγάλων ρατσών με τον κτηνίατρό σας."
  },
  {
    "id": "bullmastiff",
    "slug": "bullmastiff",
    "name_en": "Bullmastiff",
    "name_el": "Μπουλμαστίφ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "large",
    "lifespan": "7-9 years",
    "temperament_en": ["Loyal", "Fearless", "Calm", "Affectionate", "Protective"],
    "temperament_el": ["Πιστός", "Ατρόμητος", "Ήρεμος", "Στοργικός", "Προστατευτικός"],
    "description_en": "The Bullmastiff was developed in 19th-century England by gamekeepers who needed a dog strong enough to apprehend poachers without mauling them—a cross between the Mastiff and the Bulldog. They are powerful, loyal guardians with a distinctive broad head and short muzzle. Bullmastiffs are calm and affectionate with their families, including children, but will defend them decisively if threatened. They are relatively low-energy indoors and make devoted house dogs but need daily walks and moderate exercise to stay healthy. Early socialization and consistent training are essential for this strong, confident breed. They drool and snore due to their build and are best suited to owners who can manage their size and provide clear leadership.",
    "description_el": "Το Μπουλμαστίφ αναπτύχθηκε στην Αγγλία του 19ου αιώνα από φύλακες που χρειάζονταν σκύλο αρκετά δυνατό για να συλλάβει λαθροκυνηγούς χωρίς να τους τραυματίσει—διασταύρωση Μαστίφ και Μπουλντόγκ. Είναι ισχυροί, πιστοί φύλακες με χαρακτηριστικό πλατύ κεφάλι και κοντό ρύγχος. Τα Μπουλμαστίφ είναι ήρεμα και στοργικά με την οικογένειά τους, συμπεριλαμβανομένων των παιδιών, αλλά θα τα υπερασπιστούν αποφασιστικά αν απειληθούν. Είναι σχετικά χαμηλής ενέργειας στο εσωτερικό και γίνονται αφοσιωμένα σκυλιά σπιτιού αλλά χρειάζονται καθημερινές βόλτες και μέτρια άσκηση για να παραμείνουν υγιή. Η πρώιμη κοινωνικοποίηση και η σταθερή εκπαίδευση είναι απαραίτητες για αυτή την ισχυρή, σίγουρη ράτσα. Σταλάζουν και ροχαλίζουν λόγω της σωματικής τους διάπλασης και ταιριάζουν καλύτερα σε ιδιοκτήτες που μπορούν να διαχειριστούν το μέγεθός τους και να παρέχουν σαφή ηγεσία.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Bullmastiffs need moderate daily exercise—about 45 minutes to 1 hour of walks—to maintain muscle and prevent weight gain; avoid overexertion and strenuous activity in heat due to their brachycephalic build. Their short coat is easy to maintain with weekly brushing. They can be stubborn and need consistent, patient training using positive methods; early socialization with people and other dogs is important. They drool and snore; keeping a towel handy and providing a cool, well-ventilated sleeping area helps. They are prone to obesity, so monitor food intake carefully and limit treats. They thrive in homes where they are included in family life and have clear rules. A large-breed diet and controlled growth in puppies support joint health.",
    "care_el": "Τα Μπουλμαστίφ χρειάζονται μέτρια καθημερινή άσκηση—περίπου 45 λεπτά έως 1 ώρα βόλτων—για να διατηρήσουν τη μυϊκή μάζα και να αποφύγουν την αύξηση βάρους· αποφεύγετε υπερβολική άσκηση και έντονη δραστηριότητα στη ζέστη λόγω της βραχυκεφαλικής διάπλασης. Το κοντό τρίχωμά τους είναι εύκολο στη συντήρηση με εβδομαδιαίο βούρτσισμα. Μπορεί να είναι πεισματάρηδες και χρειάζονται σταθερή, υπομονετική εκπαίδευση με θετικές μεθόδους· η πρώιμη κοινωνικοποίηση με ανθρώπους και άλλα σκυλιά είναι σημαντική. Σταλάζουν και ροχαλίζουν· το να έχετε πετσέτα κοντά και να παρέχετε δροσερό, καλά αεριζόμενο χώρο ύπνου βοηθά. Είναι επιρρεπή στην παχυσαρκία, επομένως ελέγχετε προσεκτικά την πρόσληψη τροφής και περιορίστε τις λιχουδιές. Ευδοκιμούν σε σπίτια όπου συμπεριλαμβάνονται στην οικογενειακή ζωή και υπάρχουν σαφείς κανόνες. Διατροφή για μεγάλες ράτσες και ελεγχόμενη ανάπτυξη στα κουτάβια υποστηρίζουν την υγεία των αρθρώσεων.",
    "health_en": "Bullmastiffs may suffer from hip and elbow dysplasia; OFA or PennHIP screening by breeders is recommended. Bloat (gastric dilatation-volvulus) is a serious risk—feed two or three smaller meals and avoid exercise after eating. Heart conditions including dilated cardiomyopathy can occur. They can overheat easily due to brachycephalic traits; avoid heat stress and provide shade and cool water. Cancer and lymphoma are seen in the breed. Typical lifespan is about 7–9 years. Regular vet checkups, maintaining a healthy weight, and joint-friendly care are important. Discuss brachycephalic and large-breed health with your veterinarian.",
    "health_el": "Τα Μπουλμαστίφ μπορεί να υποστούν δυσπλασία ισχίου και αγκώνα· συνιστάται OFA ή PennHIP έλεγχος από εκτροφείς. Το φούσκωμα (γαστρική διάταση-συστροφή) είναι σοβαρός κίνδυνος—δίνετε δύο ή τρία μικρότερα γεύματα και αποφεύγετε άσκηση μετά το φαγητό. Καρδιακές παθήσεις συμπεριλαμβανομένης της διαστολικής καρδιομυοπάθειας μπορεί να εμφανιστούν. Υπερθερμαίνονται εύκολα λόγω βραχυκεφαλικών χαρακτηριστικών· αποφεύγετε θερμικό στρες και παρέχετε σκιά και δροσερό νερό. Καρκίνος και λέμφωμα εμφανίζονται στη ράτσα. Τυπική διάρκεια ζωής περίπου 7–9 χρόνια. Τακτικοί κτηνιατρικοί έλεγχοι, διατήρηση υγιούς βάρους και φροντίδα φιλική προς τις αρθρώσεις είναι σημαντικά. Συζητήστε την υγεία βραχυκεφαλικών και μεγάλων ρατσών με τον κτηνίατρό σας."
  },
  {
    "id": "cane-corso",
    "slug": "cane-corso",
    "name_en": "Cane Corso",
    "name_el": "Κάνε Κόρσο",
    "type": "dog",
    "origin": "Italy",
    "originCode": "IT",
    "images": [],
    "size": "large",
    "lifespan": "9-12 years",
    "temperament_en": ["Loyal", "Confident", "Reserved", "Trainable", "Protective"],
    "temperament_el": ["Πιστός", "Σίγουρος", "Προφυλακτικός", "Εκπαιδεύσιμος", "Προστατευτικός"],
    "description_en": "The Cane Corso is an Italian mastiff descended from ancient Roman war dogs (canis pugnax) and later used across Italy for guarding property, hunting large game such as wild boar, and as versatile farm helpers. They are large, muscular, athletic dogs with a short coat and a noble, alert expression. Corsos are loyal, confident, and reserved with strangers, forming strong bonds with their families. They are highly trainable when handled by experienced owners who provide firm, consistent leadership and early socialization. Today they serve as guard dogs, family companions, and in some cases as working or sport dogs. They require an owner who understands large guardian breeds and can meet their need for structure and activity.",
    "description_el": "Το Κάνε Κόρσο είναι ιταλικό μαστίφ που κατάγεται από τους αρχαίους ρωμαϊκούς πολεμικούς σκύλους (canis pugnax) και αργότερα χρησιμοποιήθηκε σε όλη την Ιταλία για φύλαξη ιδιοκτησίας, κυνήγι μεγάλου θήραματος όπως αγριόχοιρος, και ως ευέλικτοι βοηθοί σε αγροκτήματα. Είναι μεγάλα, μυώδη, αθλητικά σκυλιά με κοντό τρίχωμα και ευγενική, επαγρύπνου ύφους. Τα Κόρσο είναι πιστοί, σίγουροι και προφυλακτικοί με αγνώστους, δημιουργώντας ισχυρούς δεσμούς με την οικογένεια. Είναι εξαιρετικά εκπαιδεύσιμα όταν χειρίζονται από έμπειρους ιδιοκτήτες που παρέχουν σταθερή, συνεπή ηγεσία και πρώιμη κοινωνικοποίηση. Σήμερα υπηρετούν ως φύλακες, οικογενειακοί σύντροφοι και σε ορισμένες περιπτώσεις ως εργατικά ή αθλητικά σκυλιά. Απαιτούν ιδιοκτήτη που κατανοεί τις μεγάλες ράτσες φυλάκων και μπορεί να ικανοποιήσει την ανάγκη τους για δομή και δραστηριότητα.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 3, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Cane Corsos need regular daily exercise—at least 1 hour of walks, runs, or active play—and mental stimulation through training, obedience, or structured activities to stay balanced. Their short coat requires minimal grooming: weekly brushing and occasional bathing. They require firm, consistent training from an early age using clear, fair methods; they respond well to confident leadership. Socialization with people, other dogs, and various environments is critical and should continue into adulthood. They are not for first-time owners; they need someone who can manage their size and strength. Secure, high fencing is essential as they are territorial. They thrive in homes where they have a clear role and are part of family life. Large-breed diet and controlled growth in puppies support joint health.",
    "care_el": "Τα Κάνε Κόρσο χρειάζονται τακτική καθημερινή άσκηση—τουλάχιστον 1 ώρα βόλτων, τρεξίματος ή ενεργού παιχνιδιού—και νοητική διέγερση μέσω εκπαίδευσης, υπακοής ή δομημένων δραστηριοτήτων για να παραμείνουν ισορροπημένα. Το κοντό τρίχωμά τους απαιτεί ελάχιστη περιποίηση: εβδομαδιαίο βούρτσισμα και περιστασιακό μπάνιο. Απαιτούν σταθερή, συνεπή εκπαίδευση από μικρή ηλικία με σαφείς, δίκαιες μεθόδους· ανταποκρίνονται καλά σε σίγουρη ηγεσία. Η κοινωνικοποίηση με ανθρώπους, άλλα σκυλιά και διάφορα περιβάλλοντα είναι κρίσιμη και πρέπει να συνεχιστεί μέχρι την ενηλικίωση. Δεν είναι για ιδιοκτήτες που έχουν για πρώτη φορά σκύλο· χρειάζονται κάποιον που μπορεί να διαχειριστεί το μέγεθος και τη δύναμή τους. Ασφαλής, ψηλή περίφραξη είναι απαραίτητη καθώς είναι εδαφικά. Ευδοκιμούν σε σπίτια όπου έχουν σαφή ρόλο και είναι μέρος της οικογενειακής ζωής. Διατροφή για μεγάλες ράτσες και ελεγχόμενη ανάπτυξη στα κουτάβια υποστηρίζουν την υγεία των αρθρώσεων.",
    "health_en": "Cane Corsos may be prone to hip dysplasia and elbow dysplasia; choose breeders who perform OFA or PennHIP screening. Eye conditions including entropion, ectropion, and cherry eye can occur. Bloat (gastric dilatation-volvulus) is a risk; feed two or three smaller meals and avoid vigorous exercise after eating. Idiopathic epilepsy has been reported in the breed. Cardiac screening is recommended. Typical lifespan is about 9–12 years. Regular veterinary checkups, weight management, and joint care support long-term health. Choose breeders who health test for joints, eyes, and cardiac issues.",
    "health_el": "Τα Κάνε Κόρσο μπορεί να εμφανίσουν δυσπλασία ισχίου και αγκώνα· επιλέξτε εκτροφείς που πραγματοποιούν OFA ή PennHIP έλεγχο. Οφθαλμικές παθήσεις συμπεριλαμβανομένων εντροπίου, εκτροπίας και κερασιού στο μάτι μπορεί να εμφανιστούν. Το φούσκωμα (γαστρική διάταση-συστροφή) είναι κίνδυνος· δίνετε δύο ή τρία μικρότερα γεύματα και αποφεύγετε έντονη άσκηση μετά το φαγητό. Ιδιοπαθής επιληψία έχει αναφερθεί στη ράτσα. Συνιστάται καρδιακός έλεγχος. Τυπική διάρκεια ζωής περίπου 9–12 χρόνια. Τακτικοί κτηνιατρικοί έλεγχοι, διαχείριση βάρους και φροντίδα αρθρώσεων υποστηρίζουν τη μακροπρόθεσμη υγεία. Επιλέξτε εκτροφείς που ελέγχουν υγεία για αρθρώσεις, μάτια και καρδιακά."
  },
  {
    "id": "caucasian-shepherd-dog",
    "slug": "caucasian-shepherd-dog",
    "name_en": "Caucasian Shepherd Dog",
    "name_el": "Καυκάσιος Ποιμενικός",
    "type": "dog",
    "origin": "Georgia",
    "originCode": "GE",
    "images": [],
    "size": "giant",
    "lifespan": "10-12 years",
    "temperament_en": ["Fearless", "Strong-willed", "Loyal", "Protective", "Calm"],
    "temperament_el": ["Ατρόμητος", "Ανδρεῖος", "Πιστός", "Προστατευτικός", "Ήρεμος"],
    "description_en": "The Caucasian Shepherd Dog (Caucasian Ovcharka) is a massive breed from the Caucasus region—Georgia, Armenia, Azerbaijan, and Russia—used for centuries to guard livestock from wolves, bears, and intruders. They are fearless, strong-willed, and intensely loyal to their family and territory, with a calm demeanor when not provoked but a willingness to defend without hesitation. Their thick double coat and substantial build allow them to work in harsh mountain climates. They require an experienced owner who can provide firm leadership, extensive early socialization, and a property suitable for such a large, dominant breed. They are not suited to urban or apartment life and are best in homes with land and a clear guardian role.",
    "description_el": "Ο Καυκάσιος Ποιμενικός (Caucasian Ovcharka) είναι τεράστια ράτσα από την περιοχή του Καυκάσου—Γεωργία, Αρμενία, Αζερμπαϊτζάν και Ρωσία—που χρησιμοποιήθηκε για αιώνες για φύλαξη ζώων από λύκους, αρκούδες και εισβολείς. Είναι ατρόμητοι, ανδρεία και βαθιά πιστοί στην οικογένεια και την περιοχή τους, με ήρεμη συμπεριφορά όταν δεν προκαλούνται αλλά πρόθυμοι να υπερασπιστούν χωρίς δισταγμό. Το πυκνό διπλό τρίχωμά τους και η στιβαρή σωματική διάπλαση τους επιτρέπουν να εργάζονται σε σκληρά ορεινά κλίματα. Απαιτούν έμπειρο ιδιοκτήτη που μπορεί να παρέχει σταθερή ηγεσία, εκτενή πρώιμη κοινωνικοποίηση και ιδιοκτησία κατάλληλη για τόσο μεγάλη, κυρίαρχη ράτσα. Δεν είναι κατάλληλοι για αστική ζωή ή διαμέρισμα και ταιριάζουν καλύτερα σε σπίτια με γη και σαφή ρόλο φύλακα.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 2, "trainability": 3, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Caucasian Shepherds need regular daily exercise and a large, secure property where they can patrol and fulfill their guarding instinct. Their thick double coat requires regular brushing several times a week, and heavy shedding occurs seasonally—during coat blow, daily brushing may be needed. They need firm, consistent leadership and early, ongoing socialization with people and other animals to be manageable; without it they can become overly suspicious or aggressive. They are not suited to apartments or inexperienced owners. Feeding and veterinary costs for giant breeds are high; diet should support joint health and avoid rapid growth in puppies. They do best with a job (guarding property or livestock) and clear boundaries.",
    "care_el": "Οι Καυκάσιοι Ποιμενικοί χρειάζονται τακτική καθημερινή άσκηση και μεγάλη, ασφαλής ιδιοκτησία όπου μπορούν να περιπολούν και να ικανοποιήσουν το ένστικτο φύλαξης. Το πυκνό διπλό τρίχωμά τους απαιτεί τακτικό βούρτσισμα αρκετές φορές την εβδομάδα, και έντονη τριχόπτωση εμφανίζεται εποχιακά—κατά την αλλαγή τριχώματος μπορεί να χρειαστεί καθημερινό βούρτσισμα. Απαιτούν σταθερή, συνεπή ηγεσία και πρώιμη, συνεχής κοινωνικοποίηση με ανθρώπους και άλλα ζώα ώστε να είναι διαχειρίσιμοι· χωρίς αυτό μπορεί να γίνουν υπερβολικά καχύποπτοι ή επιθετικοί. Δεν είναι κατάλληλοι για διαμερίσματα ή ανέμπειρους ιδιοκτήτες. Το κόστος διατροφής και κτηνιατρικής για γιγαντιαίες ράτσες είναι υψηλό· η διατροφή πρέπει να υποστηρίζει την υγεία των αρθρώσεων και να αποφεύγει την ταχεία ανάπτυξη στα κουτάβια. Τα πάνε καλύτερα με δουλειά (φύλαξη ιδιοκτησίας ή ζώων) και σαφή όρια.",
    "health_en": "Caucasian Shepherds may be prone to hip dysplasia given their size; screening by breeders (OFA or similar) is recommended. Obesity can worsen joint and heart strain—weight management and appropriate exercise are important. Heart conditions and bloat (gastric dilatation-volvulus) are risks; feed two or three smaller meals and avoid exercise after eating. Their giant size makes joint problems and mobility issues more likely with age. Regular health screenings, weight management, and joint-friendly care are essential. Typical lifespan is about 10–12 years. Discuss giant-breed health and preventive care with your veterinarian.",
    "health_el": "Οι Καυκάσιοι Ποιμενικοί μπορεί να εμφανίσουν δυσπλασία ισχίου δεδομένου του μεγέθους τους· συνιστάται έλεγχος από εκτροφείς (OFA ή παρόμοιος). Η παχυσαρκία μπορεί να επιδεινώσει το στρες στις αρθρώσεις και την καρδιά—η διαχείριση βάρους και η κατάλληλη άσκηση είναι σημαντικές. Καρδιακές παθήσεις και φούσκωμα (γαστρική διάταση-συστροφή) είναι κίνδυνοι· δίνετε δύο ή τρία μικρότερα γεύματα και αποφεύγετε άσκηση μετά το φαγητό. Το γιγαντιαίο μέγεθός τους καθιστά τα προβλήματα αρθρώσεων και κινητικότητας πιο πιθανά με την ηλικία. Τακτικοί έλεγχοι υγείας, διαχείριση βάρους και φροντίδα φιλική προς τις αρθρώσεις είναι απαραίτητα. Τυπική διάρκεια ζωής περίπου 10–12 χρόνια. Συζητήστε την υγεία γιγαντιαίων ρατσών και την προληπτική φροντίδα με τον κτηνίατρό σας."
  },
  {
    "id": "central-asian-shepherd-dog",
    "slug": "central-asian-shepherd-dog",
    "name_en": "Central Asian Shepherd Dog",
    "name_el": "Κεντροασιατικός Ποιμενικός",
    "type": "dog",
    "origin": "Russia",
    "originCode": "RU",
    "images": [],
    "size": "giant",
    "lifespan": "12-15 years",
    "temperament_en": ["Independent", "Fearless", "Loyal", "Calm", "Territorial"],
    "temperament_el": ["Ανεξάρτητος", "Ατρόμητος", "Πιστός", "Ήρεμος", "Εδαφικός"],
    "description_en": "The Central Asian Shepherd Dog (CASD) is one of the oldest dog breeds, developed over thousands of years in the regions between the Urals and Afghanistan for guarding livestock, property, and families from predators and intruders. They are independent, fearless, and loyal to their family and flock, with a calm, steady demeanor that can turn decisive when threats appear. CASDs were shaped by natural and human selection for toughness and reliability in harsh climates. They retain strong guardian instincts and often work with minimal human direction. They need an experienced owner who understands livestock guardian breeds, plenty of space, and early socialization. They are not suited to urban or apartment life and thrive with a clear guarding role.",
    "description_el": "Ο Κεντροασιατικός Ποιμενικός (CASD) είναι μία από τις παλαιότερες ράτσες σκύλων, που αναπτύχθηκε εδώ και χιλιάδες χρόνια στις περιοχές μεταξύ των Ουραλίων και του Αφγανιστάν για φύλαξη ζώων, ιδιοκτησίας και οικογενειών από θηρευτές και εισβολείς. Είναι ανεξάρτητοι, ατρόμητοι και πιστοί στην οικογένεια και το κοπάδι, με ήρεμη, σταθερή συμπεριφορά που μπορεί να γίνει αποφασιστική όταν εμφανίζονται απειλές. Οι CASD διαμορφώθηκαν από φυσική και ανθρώπινη επιλογή για ανθεκτικότητα και αξιοπιστία σε σκληρά κλίματα. Διατηρούν ισχυρά ένστικτα φύλακα και συχνά εργάζονται με ελάχιστη ανθρώπινη καθοδήγηση. Χρειάζονται έμπειρο ιδιοκτήτη που κατανοεί τις ράτσες φυλάκων ζώων, αρκετό χώρο και πρώιμη κοινωνικοποίηση. Δεν είναι κατάλληλοι για αστική ζωή ή διαμέρισμα και ευδοκιμούν με σαφή ρόλο φύλακα.",
    "characteristics": { "energy": 3, "grooming": 3, "friendliness": 2, "trainability": 3, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Central Asian Shepherds need regular daily exercise and a large, securely fenced property where they can patrol and fulfill their guarding role. Their coat can be short or long; both need regular brushing—at least weekly, and more during seasonal shedding. They require consistent, confident leadership and early socialization with people and other animals to be manageable; they are independent thinkers and may not obey blindly. They are not suited to urban or apartment living. High food and veterinary costs apply for giant breeds; diet should support joint health. They do best with a job (guarding property or livestock) and clear boundaries. Avoid leaving them with unfamiliar people or in busy public places without training.",
    "care_el": "Οι Κεντροασιατικοί Ποιμενικοί χρειάζονται τακτική καθημερινή άσκηση και μεγάλη, ασφαλώς περιφραγμένη ιδιοκτησία όπου μπορούν να περιπολούν και να εκπληρώσουν το ρόλο φύλακα. Το τρίχωμά τους μπορεί να είναι κοντό ή μακρύ· και τα δύο απαιτούν τακτικό βούρτσισμα—τουλάχιστον εβδομαδιαίως, και περισσότερο κατά την εποχιακή τριχόπτωση. Απαιτούν σταθερή, σίγουρη ηγεσία και πρώιμη κοινωνικοποίηση με ανθρώπους και άλλα ζώα ώστε να είναι διαχειρίσιμοι· είναι ανεξάρτητοι στο σκέψη και μπορεί να μην υπακούν τυφλά. Δεν είναι κατάλληλοι για αστική διαβίωση ή διαμέρισμα. Υψηλό κόστος διατροφής και κτηνιατρικής ισχύει για γιγαντιαίες ράτσες· η διατροφή πρέπει να υποστηρίζει την υγεία των αρθρώσεων. Τα πάνε καλύτερα με δουλειά (φύλαξη ιδιοκτησίας ή ζώων) και σαφή όρια. Αποφεύγετε να τα αφήνετε με άγνωστα άτομα ή σε πολυσύχναστα δημόσια μέρη χωρίς εκπαίδευση.",
    "health_en": "Central Asian Shepherds are generally robust; as an ancient, landrace-type breed they often have fewer hereditary issues than heavily selected modern breeds. Hip dysplasia and bloat (gastric dilatation-volvulus) can occur; feed two or three smaller meals and avoid exercise after eating to reduce bloat risk. They may be prone to obesity if under-exercised—weight management is important for joint health. Regular veterinary checkups, parasite prevention, and weight management are recommended. Typical lifespan is about 12–15 years. Discuss giant-breed and guardian-breed health with your veterinarian.",
    "health_el": "Οι Κεντροασιατικοί Ποιμενικοί είναι γενικά ανθεκτικοί· ως αρχαία ράτσα τύπου landrace συχνά έχουν λιγότερα κληρονομικά προβλήματα από τις έντονα επιλεγμένες σύγχρονες ράτσες. Μπορεί να εμφανιστεί δυσπλασία ισχίου και φούσκωμα (γαστρική διάταση-συστροφή)· δίνετε δύο ή τρία μικρότερα γεύματα και αποφεύγετε άσκηση μετά το φαγητό για να μειωθεί ο κίνδυνος φούσκωματος. Μπορεί να είναι επιρρεπή στην παχυσαρκία αν ασκηθούν λίγο—η διαχείριση βάρους είναι σημαντική για την υγεία των αρθρώσεων. Συνιστώνται τακτικοί κτηνιατρικοί έλεγχοι, πρόληψη παρασίτων και διαχείριση βάρους. Τυπική διάρκεια ζωής περίπου 12–15 χρόνια. Συζητήστε την υγεία γιγαντιαίων και φυλάκων ρατσών με τον κτηνίατρό σας."
  },
  {
    "id": "doberman-pinscher",
    "slug": "doberman-pinscher",
    "name_en": "Doberman Pinscher",
    "name_el": "Ντόμπερμαν Πίνσερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "large",
    "lifespan": "10-13 years",
    "temperament_en": ["Loyal", "Fearless", "Alert", "Energetic", "Intelligent"],
    "temperament_el": ["Πιστός", "Ατρόμητος", "Επαγρύπνος", "Ενεργητικός", "Έξυπνος"],
    "description_en": "The Doberman Pinscher was developed in Germany in the late 19th century by Karl Friedrich Louis Dobermann, who sought a sharp, loyal protection and companion dog. They are sleek, powerful, and among the most intelligent breeds, excelling in obedience, agility, protection work, and as family guardians. Dobermans are intensely loyal to their families and are natural watchdogs with a strong desire to protect. They are energetic and need both physical and mental exercise to stay balanced and happy. With proper training and early socialization, they are devoted, affectionate family pets that get along well with considerate children. They have been used as police, military, and service dogs worldwide.",
    "description_el": "Ο Ντόμπερμαν Πίνσερ αναπτύχθηκε στη Γερμανία στα τέλη του 19ου αιώνα από τον Karl Friedrich Louis Dobermann, που αναζητούσε έξυπνο, πιστό σκύλο προστασίας και συντροφιάς. Είναι κομψοί, δυνατοί και από τις πιο έξυπνες ράτσες, διαπρέποντας στην υπακοή, ευκινησία, εργασία προστασίας και ως οικογενειακοί φύλακες. Οι Ντόμπερμαν είναι βαθιά πιστοί στην οικογένειά τους και φυσικοί φύλακες με ισχυρή επιθυμία προστασίας. Είναι ενεργητικοί και χρειάζονται τόσο σωματική όσο και νοητική άσκηση για να παραμείνουν ισορροπημένοι και ευτυχισμένοι. Με σωστή εκπαίδευση και πρώιμη κοινωνικοποίηση, είναι αφοσιωμένα, στοργικά οικογενειακά κατοικίδια που τα πάνε καλά με ευσυνείδητα παιδιά. Χρησιμοποιούνται ως αστυνομικοί, στρατιωτικοί και σκύλοι υπηρεσίας παγκοσμίως.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 5, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Dobermans need substantial daily exercise—at least 1 to 2 hours of walks, runs, or active play—and mental stimulation through obedience training, agility, tracking, or other dog sports. Their short coat is easy to maintain with weekly brushing and occasional bathing. They thrive when given a job or regular training; without enough activity they can become bored or anxious. Early socialization with people, other dogs, and various environments is essential to develop a confident, stable adult. They bond closely with their families and can develop separation anxiety if left alone too much; they do best in homes where someone is present much of the time. Positive, consistent training works well with this intelligent breed.",
    "care_el": "Οι Ντόμπερμαν χρειάζονται σημαντική καθημερινή άσκηση—τουλάχιστον 1 έως 2 ώρες βόλτων, τρεξίματος ή ενεργού παιχνιδιού—και νοητική διέγερση μέσω εκπαίδευσης υπακοής, ευκινησίας, ιχνηλασίας ή άλλων αθλημάτων σκύλων. Το κοντό τρίχωμά τους είναι εύκολο στη συντήρηση με εβδομαδιαίο βούρτσισμα και περιστασιακό μπάνιο. Ευδοκιμούν όταν τους δίνεται δουλειά ή τακτική εκπαίδευση· χωρίς αρκετή δραστηριότητα μπορεί να γίνουν ανήσυχα ή ανήσυχα. Η πρώιμη κοινωνικοποίηση με ανθρώπους, άλλα σκυλιά και διάφορα περιβάλλοντα είναι απαραίτητη για την ανάπτυξη ενός σίγουρου, σταθερού ενήλικα. Δένονται στενά με την οικογένεια και μπορεί να εμφανίσουν άγχος αποχωρισμού αν μείνουν μόνοι πολύ· τα πάνε καλύτερα σε σπίτια όπου κάποιος είναι παρών το μεγαλύτερο μέρος του χρόνου. Θετική, σταθερή εκπαίδευση λειτουργεί καλά με αυτή την έξυπνη ράτσα.",
    "health_en": "Dobermans may be prone to dilated cardiomyopathy (DCM), a serious heart condition; annual cardiac screening (echocardiogram/Holter) is often recommended, and breeders may test for genetic markers. Hip dysplasia can occur—OFA or PennHIP screening by breeders is advised. Von Willebrand's disease (a bleeding disorder) can affect the breed; genetic testing is available. Cervical vertebral instability (wobbler syndrome) can cause neck and gait issues. Hypothyroidism and progressive retinal atrophy have been reported. Responsible breeders screen for heart, hip, and genetic conditions. Typical lifespan is about 10–13 years. Regular veterinary care and maintaining a healthy weight support long-term health.",
    "health_el": "Οι Ντόμπερμαν μπορεί να εμφανίσουν διαστολική καρδιομυοπάθεια (DCM), σοβαρή καρδιακή πάθηση· ο ετήσιος καρδιακός έλεγχος (ηχοκαρδιογράφημα/Holter) συνιστάται συχνά, και οι εκτροφείς μπορεί να ελέγχουν για γενετικούς δείκτες. Μπορεί να εμφανιστεί δυσπλασία ισχίου· συνιστάται OFA ή PennHIP έλεγχος από εκτροφείς. Η νόσος von Willebrand (διαταραχή πήξης) μπορεί να επηρεάσει τη ράτσα· ο γενετικός έλεγχος είναι διαθέσιμος. Η αστάθεια σπονδύλων του τραχήλου (σύνδρομο wobbler) μπορεί να προκαλέσει προβλήματα λαιμού και βάδισης. Υποθυρεοειδισμός και προοδευτική ατροφία αμφιβληστροειδούς έχουν αναφερθεί. Οι υπεύθυνοι εκτροφείς ελέγχουν για καρδιακές, ισχιακές και γενετικές παθήσεις. Τυπική διάρκεια ζωής περίπου 10–13 χρόνια. Η τακτική κτηνιατρική φροντίδα και η διατήρηση υγιούς βάρους υποστηρίζουν τη μακροπρόθεσμη υγεία."
  },
  {
    "id": "dogo-argentino",
    "slug": "dogo-argentino",
    "name_en": "Dogo Argentino",
    "name_el": "Ντόγκο Αργεντίνου",
    "type": "dog",
    "origin": "Argentina",
    "originCode": "AR",
    "images": [],
    "size": "large",
    "lifespan": "9-15 years",
    "temperament_en": ["Loyal", "Friendly", "Courageous", "Protective", "Tenacious"],
    "temperament_el": ["Πιστός", "Φιλικός", "Θαρραλέος", "Προστατευτικός", "Πεισματάρης"],
    "description_en": "The Dogo Argentino was developed in Argentina in the 20th century primarily for big-game hunting, including wild boar and puma, by Dr. Antonio Nores Martínez, who combined several breeds to create an all-white, muscular dog with great strength, stamina, and courage. They are loyal and friendly with their families, including children, when properly raised and socialized. They are courageous and tenacious when working and can be strong-willed. They require an experienced owner who can provide firm, consistent training and extensive early socialization with people, other dogs, and various situations. Some regions and countries restrict or ban the breed due to legislation targeting certain types; always check local laws before acquiring one.",
    "description_el": "Το Ντόγκο Αργεντίνου αναπτύχθηκε στην Αργεντινή τον 20ό αιώνα κυρίως για κυνήγι μεγάλου θήραματος, συμπεριλαμβανομένων αγριόχοιρου και πούμα, από τον Δρ. Antonio Nores Martínez, που συνδύασε πολλές ράτσες για να δημιουργήσει ένα πανάσπρο, μυώδες σκύλο με μεγάλη δύναμη, αντοχή και θάρρος. Είναι πιστά και φιλικά με την οικογένειά τους, συμπεριλαμβανομένων των παιδιών, όταν εκτραφούν και κοινωνικοποιηθούν σωστά. Είναι θαρραλέα και πεισματάρηδες όταν εργάζονται και μπορεί να είναι ανδρεία. Απαιτούν έμπειρο ιδιοκτήτη που μπορεί να παρέχει σταθερή, συνεπή εκπαίδευση και εκτενή πρώιμη κοινωνικοποίηση με ανθρώπους, άλλα σκυλιά και διάφορες καταστάσεις. Ορισμένες περιοχές και χώρες περιορίζουν ή απαγορεύουν τη ράτσα λόγω νομοθεσίας που στοχεύει ορισμένους τύπους· ελέγχετε πάντα τους τοπικούς νόμους πριν από την απόκτηση.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 3, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Dogo Argentinos need substantial daily exercise—at least 1 to 2 hours of walks, runs, or active work—and mental stimulation through training, obedience, or structured activities. Their short white coat is easy to groom with weekly brushing, but they can sunburn in strong sun; use pet-safe sunscreen on nose and ears and provide shade. They require consistent, confident training and early, ongoing socialization with people and other dogs to be stable and manageable. They are not for first-time owners. Secure fencing and leash control in public are important. Check local laws regarding ownership, as the breed is restricted or banned in some areas. Diet should support an active, large breed.",
    "care_el": "Τα Ντόγκο Αργεντίνου χρειάζονται σημαντική καθημερινή άσκηση—τουλάχιστον 1 έως 2 ώρες βόλτων, τρεξίματος ή ενεργής εργασίας—και νοητική διέγερση μέσω εκπαίδευσης, υπακοής ή δομημένων δραστηριοτήτων. Το κοντό λευκό τρίχωμά τους είναι εύκολο στη περιποίηση με εβδομαδιαίο βούρτσισμα, αλλά μπορούν να καούν από τον ήλιο σε δυνατό ηλιοφάνεια· χρησιμοποιήστε αντιηλιακό ασφαλές για κατοικίδια στη μύτη και τα αυτιά και παρέχετε σκιά. Απαιτούν σταθερή, σίγουρη εκπαίδευση και πρώιμη, συνεχής κοινωνικοποίηση με ανθρώπους και άλλα σκυλιά ώστε να είναι σταθερά και διαχειρίσιμα. Δεν είναι για ιδιοκτήτες που έχουν για πρώτη φορά σκύλο. Ασφαλής περίφραξη και έλεγχος με λουρί σε δημόσιους χώρους είναι σημαντικά. Ελέγξτε τους τοπικούς νόμους σχετικά με την ιδιοκτησία, καθώς η ράτσα περιορίζεται ή απαγορεύεται σε ορισμένες περιοχές. Η διατροφή πρέπει να υποστηρίζει ενεργή, μεγάλη ράτσα.",
    "health_en": "Dogo Argentinos may be prone to deafness (common in predominantly white dogs); responsible breeders test hearing (BAER test), and bilaterally deaf puppies should not be bred. Hip dysplasia can occur—OFA or PennHIP screening by breeders is recommended. Skin issues including sun sensitivity and possible sunburn require protection in strong sun. They can overheat in hot weather; provide shade, water, and avoid intense exercise in heat. Hypothyroidism and heart conditions have been reported. Typical lifespan is about 9–15 years. Responsible breeders test for hearing and hip health. Regular veterinary care and skin and weight management support long-term health.",
    "health_el": "Τα Ντόγκο Αργεντίνου μπορεί να εμφανίσουν κώφωση (συχνή σε κατά κύριο λόγο λευκά σκυλιά)· οι υπεύθυνοι εκτροφείς ελέγχουν την ακοή (τεστ BAER), και τα κουτάβια με αμφοτερόπλευρη κώφωση δεν πρέπει να εκτρέφονται. Μπορεί να εμφανιστεί δυσπλασία ισχίου· συνιστάται OFA ή PennHIP έλεγχος από εκτροφείς. Δερματικά προβλήματα συμπεριλαμβανομένης της ευαισθησίας στον ήλιο και πιθανού εγκαύματος απαιτούν προστασία σε δυνατό ήλιο. Μπορούν να υπερθερμαίνονται σε ζεστό καιρό· παρέχετε σκιά, νερό και αποφεύγετε έντονη άσκηση στη ζέστη. Υποθυρεοειδισμός και καρδιακές παθήσεις έχουν αναφερθεί. Τυπική διάρκεια ζωής περίπου 9–15 χρόνια. Οι υπεύθυνοι εκτροφείς ελέγχουν την ακοή και την υγεία του ισχίου. Η τακτική κτηνιατρική φροντίδα και η διαχείριση δέρματος και βάρους υποστηρίζουν τη μακροπρόθεσμη υγεία."
  },
  {
    "id": "dogue-de-bordeaux",
    "slug": "dogue-de-bordeaux",
    "name_en": "Dogue de Bordeaux",
    "name_el": "Ντογκ ντε Μπορντό",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "large",
    "lifespan": "5-8 years",
    "temperament_en": ["Loyal", "Calm", "Courageous", "Affectionate", "Patient"],
    "temperament_el": ["Πιστός", "Ήρεμος", "Θαρραλέος", "Στοργικός", "Υπομονετικός"],
    "description_en": "The Dogue de Bordeaux, or French Mastiff, is one of the oldest French breeds, with a history that may extend to ancient molosser-type dogs. They are massive, muscular dogs with distinctive wrinkled faces, heavy jowls, and short muzzles. Despite their imposing appearance, they are loyal, calm, and deeply affectionate with their families and are known for their patience with children when properly socialized. Their lifespan is relatively short (often 5–8 years), and they face significant health challenges related to their size and brachycephalic build. They drool heavily and can overheat easily, so they need a cool environment and careful management in warm weather. They thrive as devoted indoor companions with moderate activity.",
    "description_el": "Το Ντογκ ντε Μπορντό, ή Γαλλικό Μαστίφ, είναι μία από τις παλαιότερες γαλλικές ράτσες, με ιστορία που μπορεί να extends σε αρχαία σκυλιά τύπου molosser. Είναι τεράστια, μυώδη σκυλιά με χαρακτηριστικά ζαρωμένα πρόσωπα, βαριά μάγουλα και κοντά ρύγχη. Παρά την επιβλητική εμφάνισή τους, είναι πιστά, ήρεμα και βαθιά στοργικά με την οικογένειά τους και είναι γνωστά για την υπομονή τους με τα παιδιά όταν κοινωνικοποιηθούν σωστά. Η διάρκεια ζωής τους είναι σχετικά σύντομη (συχνά 5–8 χρόνια), και αντιμετωπίζουν σημαντικές προκλήσεις υγείας σχετικές με το μέγεθος και τη βραχυκεφαλική διάπλαση. Σταλάζουν πολύ σάλιο και υπερθερμαίνονται εύκολα, επομένως χρειάζονται δροσερό περιβάλλον και προσεκτική διαχείριση σε ζεστό καιρό. Ευδοκιμούν ως αφοσιωμένοι σύντροφοι στο εσωτερικό με μέτρια δραστηριότητα.",
    "characteristics": { "energy": 2, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Dogue de Bordeaux need moderate daily exercise—short to medium walks—and must avoid overheating, strenuous activity, and prolonged exposure to heat due to their brachycephalic anatomy. Their facial wrinkles and skin folds need regular cleaning and drying to prevent infection. They drool extensively; keep a towel handy and wipe jowls after eating or drinking. They are prone to weight gain, so portion control and limiting treats are important. They need a cool, well-ventilated environment in hot weather and should not be left outdoors in the sun. Training should be patient and consistent; they can be stubborn. They thrive in homes where they are included in family life and have a calm routine.",
    "care_el": "Τα Ντογκ ντε Μπορντό χρειάζονται μέτρια καθημερινή άσκηση—σύντομες έως μέτριες βόλτες—και πρέπει να αποφεύγουν την υπερθέρμανση, την έντονη δραστηριότητα και την παρατεταμένη έκθεση στη ζέστη λόγω της βραχυκεφαλικής ανατομίας. Οι ρυτίδες του προσώπου και οι δερματικές πτυχές απαιτούν τακτικό καθαρισμό και σ drying για να αποφευχθεί η λοίμωξη. Σταλάζουν εκτενώς· κρατήστε πετσέτα κοντά και σκουπίστε τα μάγουλα μετά το φαγητό ή το ποτό. Είναι επιρρεπή σε αύξηση βάρους, επομένως ο έλεγχος μερίδων και ο περιορισμός λιχουδιών είναι σημαντικοί. Χρειάζονται δροσερό, καλά αεριζόμενο περιβάλλον σε ζεστό καιρό και δεν πρέπει να αφήνονται έξω στον ήλιο. Η εκπαίδευση πρέπει να είναι υπομονετική και σταθερή· μπορεί να είναι πεισματάρηδες. Ευδοκιμούν σε σπίτια όπου συμπεριλαμβάνονται στην οικογενειακή ζωή και έχουν ήρεμη ρουτίνα.",
    "health_en": "Dogue de Bordeaux face significant health challenges: heart disease (including dilated cardiomyopathy and aortic stenosis) is common; cardiac screening by breeders and periodic vet checks are important. Hip and elbow dysplasia are seen; OFA or similar screening is recommended. Brachycephalic obstructive airway syndrome (BOAS) causes breathing difficulty and heat intolerance; avoid heat stress and overexertion. Cancer and bloat (gastric dilatation-volvulus) are concerns. They have a short lifespan (often 5–8 years). Heat stroke is a serious risk. Choose a breeder who prioritizes health and tests for cardiac and joint issues. Regular veterinary care and weight management are essential.",
    "health_el": "Τα Ντογκ ντε Μπορντό αντιμετωπίζουν σημαντικές προκλήσεις υγείας: η καρδιακή νόσος (συμπεριλαμβανομένης της διαστολικής καρδιομυοπάθειας και της αορτικής στένωσης) είναι συχνή· ο καρδιακός έλεγχος από εκτροφείς και οι περιοδικοί κτηνιατρικοί έλεγχοι είναι σημαντικοί. Η δυσπλασία ισχίου και αγκώνα παρατηρείται· συνιστάται OFA ή παρόμοιος έλεγχος. Το σύνδρομο βραχυκεφαλικής απόφραξης αεραγωγών (BOAS) προκαλεί αναπνευστική δυσκολία και δυσανεξία στη ζέστη· αποφεύγετε θερμικό στρες και υπερβολική άσκηση. Ο καρκίνος και το φούσκωμα (γαστρική διάταση-συστροφή) είναι ανησυχίες. Έχουν σύντομη διάρκεια ζωής (συχνά 5–8 χρόνια). Η θερμοπληξία είναι σοβαρός κίνδυνος. Επιλέξτε εκτροφέα που δίνει προτεραιότητα στην υγεία και ελέγχει για καρδιακά και αρθρωτικά ζητήματα. Η τακτική κτηνιατρική φροντίδα και η διαχείριση βάρους είναι απαραίτητες."
  },
  {
    "id": "entlebucher-mountain-dog",
    "slug": "entlebucher-mountain-dog",
    "name_en": "Entlebucher Mountain Dog",
    "name_el": "Εντλεμπύχερ Ορεινός Σκύλος",
    "type": "dog",
    "origin": "Switzerland",
    "originCode": "CH",
    "images": [],
    "size": "medium",
    "lifespan": "11-13 years",
    "temperament_en": ["Energetic", "Loyal", "Intelligent", "Self-assured", "Good-natured"],
    "temperament_el": ["Ενεργητικός", "Πιστός", "Έξυπνος", "Αυτοπεπεισμένος", "Καλόκαρδος"],
    "description_en": "The Entlebucher Mountain Dog is the smallest of the four Swiss mountain dog breeds, originating from the Entlebuch valley in Switzerland. They were used for herding and driving cattle and as all-around farm dogs. Entlebuchers are energetic, loyal, and intelligent with a striking tricolor coat (black, tan, and white) and a natural stub tail or short tail. They are self-assured and good-natured but need an active lifestyle with plenty of exercise and mental challenges. They form strong bonds with their families and can be reserved with strangers, making them good watchdogs. They excel in dog sports such as agility, obedience, and herding trials. Without sufficient activity they can become bored and destructive.",
    "description_el": "Το Εντλεμπύχερ Ορεινός Σκύλος είναι το μικρότερο από τα τέσσερα ελβετικά ορεινά ράτσα, με καταγωγή από την κοιλάδα Entlebuch στην Ελβετία. Χρησιμοποιούνταν για εκτροφή και οδήγηση βοοειδών και ως ευέλικτοι αγροτικοί σκύλοι. Τα Εντλεμπύχερ είναι ενεργητικά, πιστά και έξυπνα με εντυπωσιακό τρίχρωμο τρίχωμα (μαύρο, καφέ και λευκό) και φυσική κοντή ή σύντομη ουρά. Είναι αυτοπεπεισμένα και καλόκαρδα αλλά χρειάζονται ενεργό τρόπο ζωής με πολλή άσκηση και νοητικές προκλήσεις. Δημιουργούν ισχυρούς δεσμούς με την οικογένεια και μπορεί να είναι προφυλακτικά με αγνώστους, γεγονός που τα καθιστά καλούς φύλακες. Διαπρέπουν σε αθλήματα σκύλων όπως ευκινησία, υπακοή και δοκιμές εκτροφής. Χωρίς επαρκή δραστηριότητα μπορεί να γίνουν ανήσυχα και καταστροφικά.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Entlebuchers need plenty of daily exercise—at least 1 to 2 hours of walks, runs, hiking, or active play—and mental stimulation through training, agility, obedience, or puzzle toys. Their short, dense coat is easy to maintain with weekly brushing and occasional bathing. They excel at dog sports like agility and obedience and enjoy having a job or regular activity. They need consistent, positive training and early socialization with people, other dogs, and different environments. They are not suited to sedentary households or long hours alone; they do best with an active family that can include them in outings and activities. A house with a yard or access to open spaces is ideal.",
    "care_el": "Τα Εντλεμπύχερ χρειάζονται πολλή καθημερινή άσκηση—τουλάχιστον 1 έως 2 ώρες βόλτων, τρεξίματος, πεζοπορίας ή ενεργού παιχνιδιού—και νοητική διέγερση μέσω εκπαίδευσης, ευκινησίας, υπακοής ή παζλ. Το κοντό, πυκνό τρίχωμά τους είναι εύκολο στη συντήρηση με εβδομαδιαίο βούρτσισμα και περιστασιακό μπάνιο. Διαπρέπουν σε αθλήματα σκύλων όπως ευκινησία και υπακοή και απολαμβάνουν να έχουν δουλειά ή τακτική δραστηριότητα. Απαιτούν σταθερή, θετική εκπαίδευση και πρώιμη κοινωνικοποίηση με ανθρώπους, άλλα σκυλιά και διάφορα περιβάλλοντα. Δεν είναι κατάλληλα για αδρανή νοικοκυριά ή πολλές ώρες μόνα· τα πάνε καλύτερα με ενεργή οικογένεια που μπορεί να τα συμπεριλάβει σε εκδρομές και δραστηριότητες. Ιδανικό είναι σπίτι με προαύλιο ή πρόσβαση σε ανοιχτούς χώρους.",
    "health_en": "Entlebucher Mountain Dogs may be prone to hip dysplasia; choosing a breeder who performs OFA or similar hip screening is recommended. Progressive retinal atrophy (PRA) can affect vision in some lines—breeders may test for this. Overall they are a relatively healthy, robust breed with a typical lifespan of 11–13 years. Bloat can occur in deep-chested dogs; feeding two smaller meals and avoiding vigorous exercise after eating may reduce risk. Regular veterinary checkups and maintaining a healthy weight support long-term health. Reputable breeders screen for hereditary conditions.",
    "health_el": "Τα Εντλεμπύχερ Ορεινά Σκυλιά μπορεί να εμφανίσουν δυσπλασία ισχίου· συνιστάται η επιλογή εκτροφέα που πραγματοποιεί OFA ή παρόμοιο έλεγχο ισχίου. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) μπορεί να επηρεάσει την όραση σε ορισμένες σειρές—οι εκτροφείς μπορεί να ελέγχουν για αυτό. Γενικά είναι σχετικά υγιή, ανθεκτική ράτσα με τυπική διάρκεια ζωής 11–13 ετών. Το φούσκωμα μπορεί να εμφανιστεί σε σκυλιά με βαθύ στήθος· η σίτιση δύο μικρότερων γευμάτων και η αποφυγή έντονης άσκησης μετά το φαγητό μπορεί να μειώσει τον κίνδυνο. Τακτικοί κτηνιατρικοί έλεγχοι και διατήρηση υγιούς βάρους υποστηρίζουν τη μακροπρόθεσμη υγεία. Οι αξιόπιστοι εκτροφείς ελέγχουν για κληρονομικές παθήσεις."
  },
  {
    "id": "fila-brasileiro",
    "slug": "fila-brasileiro",
    "name_en": "Fila Brasileiro",
    "name_el": "Φίλα Μπραζιλέιρο",
    "type": "dog",
    "origin": "Brazil",
    "originCode": "BR",
    "images": [],
    "size": "large",
    "lifespan": "9-11 years",
    "temperament_en": ["Loyal", "Courageous", "Determined", "Reserved", "Gentle with family"],
    "temperament_el": ["Πιστός", "Θαρραλέος", "Αποφασιστικός", "Προφυλακτικός", "Ήπιος με την οικογένεια"],
    "description_en": "The Fila Brasileiro is a large Brazilian mastiff-type breed developed for tracking, guarding property, and hunting large game such as jaguar and wild boar. They are known for 'ojeriza'—a deep, instinctive distrust of strangers—and fierce loyalty to their family. Filas are gentle and patient with their own family, including children, when raised with them, but are typically aloof or hostile toward unfamiliar people. They require an extremely experienced owner who understands guardian breeds and can provide firm leadership and extensive, careful socialization. They are banned or restricted in several countries, including the UK and parts of Australia, due to legislation targeting certain breeds. They are not suitable for dog parks or casual encounters and need a secure property and clear management.",
    "description_el": "Το Φίλα Μπραζιλέιρο είναι μεγάλη βραζιλιάνικη ράτσα τύπου μαστίφ που αναπτύχθηκε για ιχνηλασία, φύλαξη ιδιοκτησίας και κυνήγι μεγάλου θήραματος όπως ιαγουάρος και αγριόχοιρος. Είναι γνωστά για την «ojeriza»—βαθιά, ενστικτώδης δυσπιστία απέναντι σε αγνώστους—και άγρια αφοσίωση στην οικογένεια. Τα Φίλα είναι ήπια και υπομονετικά με τη δική τους οικογένεια, συμπεριλαμβανομένων των παιδιών, όταν μεγαλώνουν μαζί τους, αλλά συνήθως είναι αποστασιοποιημένα ή εχθρικά απέναντι σε άγνωστα άτομα. Απαιτούν εξαιρετικά έμπειρο ιδιοκτήτη που κατανοεί τις ράτσες φυλάκων και μπορεί να παρέχει σταθερή ηγεσία και εκτενή, προσεκτική κοινωνικοποίηση. Απαγορεύονται ή περιορίζονται σε πολλές χώρες, συμπεριλαμβανομένου του ΗΒ και τμημάτων της Αυστραλίας, λόγω νομοθεσίας που στοχεύει ορισμένες ράτσες. Δεν είναι κατάλληλα για πάρκα σκύλων ή τυχαίες συναντήσεις και χρειάζονται ασφαλή ιδιοκτησία και σαφή διαχείριση.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 2, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Fila Brasileiros need regular daily exercise and a large, secure property where they can move and fulfill their guarding role. Their short coat is easy to maintain with weekly brushing. They require an expert owner who can provide firm, consistent leadership and extensive socialization from puppyhood; even with socialization, many remain reserved with strangers. They are not suitable for dog parks or casual encounters with strangers and should be managed carefully in public. Check local laws—the breed may be restricted or banned in your area. They thrive in homes with a clear guardian role and minimal exposure to unfamiliar people. Diet should support a large, muscular breed.",
    "care_el": "Τα Φίλα Μπραζιλέιρο χρειάζονται τακτική καθημερινή άσκηση και μεγάλη, ασφαλής ιδιοκτησία όπου μπορούν να κινούνται και να εκπληρώσουν το ρόλο φύλακα. Το κοντό τρίχωμά τους είναι εύκολο στη συντήρηση με εβδομαδιαίο βούρτσισμα. Απαιτούν ειδικό ιδιοκτήτη που μπορεί να παρέχει σταθερή, συνεπή ηγεσία και εκτενή κοινωνικοποίηση από κουταβίστικη ηλικία· ακόμη και με κοινωνικοποίηση, πολλά παραμένουν προφυλακτικά με αγνώστους. Δεν είναι κατάλληλα για πάρκα σκύλων ή τυχαίες συναντήσεις με αγνώστους και πρέπει να διαχειρίζονται προσεκτικά σε δημόσιους χώρους. Ελέγξτε τους τοπικούς νόμους—η ράτσα μπορεί να περιορίζεται ή να απαγορεύεται στην περιοχή σας. Ευδοκιμούν σε σπίτια με σαφή ρόλο φύλακα και ελάχιστη έκθεση σε άγνωστα άτομα. Η διατροφή πρέπει να υποστηρίζει μεγάλη, μυώδη ράτσα.",
    "health_en": "Fila Brasileiros may be prone to hip dysplasia; OFA or similar screening by breeders is recommended. Bloat (gastric dilatation-volvulus) and gastric torsion are risks; feed two or three smaller meals and avoid exercise after eating. Skin issues and entropion (eyelid rolling inward) have been reported. Due to a limited gene pool in some regions, genetic diversity can be a concern and responsible breeding practices are important. Typical lifespan is about 9–11 years. Health testing by breeders for hips and other conditions is important. Regular veterinary care and weight management support long-term health.",
    "health_el": "Τα Φίλα Μπραζιλέιρο μπορεί να εμφανίσουν δυσπλασία ισχίου· συνιστάται OFA ή παρόμοιος έλεγχος από εκτροφείς. Το φούσκωμα (γαστρική διάταση-συστροφή) και η γαστρική συστροφή είναι κίνδυνοι· δίνετε δύο ή τρία μικρότερα γεύματα και αποφεύγετε άσκηση μετά το φαγητό. Δερματικά προβλήματα και εντρόπιον (εσωτερική περιστροφή βλεφάρου) έχουν αναφερθεί. Λόγω περιορισμένης γονιδιακής βάσης σε ορισμένες περιοχές, η γενετική ποικιλότητα μπορεί να είναι ανησυχία και οι υπεύθυνες πρακτικές εκτροφής είναι σημαντικές. Τυπική διάρκεια ζωής περίπου 9–11 χρόνια. Ο έλεγχος υγείας από εκτροφείς για ισχίο και άλλες παθήσεις είναι σημαντικός. Η τακτική κτηνιατρική φροντίδα και η διαχείριση βάρους υποστηρίζουν τη μακροπρόθεσμη υγεία."
  },
  {
    "id": "german-pinscher",
    "slug": "german-pinscher",
    "name_en": "German Pinscher",
    "name_el": "Γερμανικός Πίνσερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Spirited", "Loyal", "Intelligent", "Alert", "Playful"],
    "temperament_el": ["Ζωηρός", "Πιστός", "Έξυπνος", "Επαγρύπνος", "Παιχνιδιάρης"],
    "description_en": "The German Pinscher is a medium-sized breed that served as the prototype for both the Miniature Pinscher and the Doberman Pinscher; it is an older, distinct breed with a long history in Germany as a ratter and stable guard. They have a sleek, short coat and an alert, intelligent expression. German Pinschers are spirited, loyal, and intelligent—alert watchdogs and energetic companions that thrive with an active lifestyle. They need an owner who can provide structure, consistent training, and plenty of mental and physical activity. They excel in obedience, agility, and other dog sports and form strong bonds with their families. They are versatile working dogs that adapt to various homes when their needs are met.",
    "description_el": "Ο Γερμανικός Πίνσερ είναι ράτσα μεσαίου μεγέθους που υπηρέτησε ως πρότυπο τόσο για το Miniature Pinscher όσο και για το Doberman· είναι παλαιότερη, ξεχωριστή ράτσα με μακρά ιστορία στη Γερμανία ως καταστροφέας αρουραίων και φύλακας σταύλων. Έχουν κοντό, λείο τρίχωμα και επαγρύπνου, έξυπνου ύφους. Οι Γερμανικοί Πίνσερ είναι ζωηροί, πιστοί και έξυπνοι—επαγρύπνους φύλακες και ενεργητικοί σύντροφοι που ευδοκιμούν με ενεργό τρόπο ζωής. Χρειάζονται ιδιοκτήτη που μπορεί να παρέχει δομή, σταθερή εκπαίδευση και πολλή νοητική και σωματική δραστηριότητα. Διαπρέπουν στην υπακοή, ευκινησία και άλλα αθλήματα σκύλων και δημιουργούν ισχυρούς δεσμούς με την οικογένεια. Είναι ευέλικτοι εργατικοί σκύλοι που προσαρμόζονται σε διάφορα σπίτια όταν ικανοποιούνται οι ανάγκες τους.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 4, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "German Pinschers need regular daily exercise—at least 1 hour of walks, runs, or active play—and mental stimulation through training, obedience, agility, or puzzle toys. Their short, smooth coat is easy to maintain with weekly brushing and occasional bathing. They excel at obedience and agility and enjoy having a job or regular activity. Early socialization with people, other dogs, and pets helps them become well-rounded companions. They can be strong-willed and need consistent boundaries and positive, firm training. They adapt to various living situations including homes with yards; they are not suited to being left alone for long hours without activity. A balanced diet supports their energetic lifestyle.",
    "care_el": "Οι Γερμανικοί Πίνσερ χρειάζονται τακτική καθημερινή άσκηση—τουλάχιστον 1 ώρα βόλτων, τρεξίματος ή ενεργού παιχνιδιού—και νοητική διέγερση μέσω εκπαίδευσης, υπακοής, ευκινησίας ή παζλ. Το κοντό, λείο τρίχωμά τους είναι εύκολο στη συντήρηση με εβδομαδιαίο βούρτσισμα και περιστασιακό μπάνιο. Διαπρέπουν στην υπακοή και ευκινησία και απολαμβάνουν να έχουν δουλειά ή τακτική δραστηριότητα. Η πρώιμη κοινωνικοποίηση με ανθρώπους, άλλα σκυλιά και κατοικίδια βοηθά να γίνουν ισορροπημένοι σύντροφοι. Μπορεί να είναι ανδρεία και χρειάζονται σταθερά όρια και θετική, σταθερή εκπαίδευση. Προσαρμόζονται σε διάφορες συνθήκες διαβίωσης συμπεριλαμβανομένων σπιτιών με προαύλια· δεν είναι κατάλληλοι να μένουν μόνοι για πολλές ώρες χωρίς δραστηριότητα. Ισορροπημένη διατροφή υποστηρίζει τον ενεργητικό τρόπο ζωής τους.",
    "health_en": "German Pinschers may be prone to hip dysplasia; OFA or similar screening by breeders is recommended. Cardiac issues and eye conditions including cataracts and progressive retinal atrophy have been reported. Von Willebrand's disease (a bleeding disorder) has been reported; genetic testing is available. Overall they are a relatively healthy breed with a typical lifespan of 12–14 years. Reputable breeders conduct health screenings for hips, heart, and eyes. Regular veterinary checkups and maintaining a healthy weight support long-term health.",
    "health_el": "Οι Γερμανικοί Πίνσερ μπορεί να εμφανίσουν δυσπλασία ισχίου· συνιστάται OFA ή παρόμοιος έλεγχος από εκτροφείς. Καρδιακά ζητήματα και οφθαλμικές παθήσεις συμπεριλαμβανομένων καταρράκτη και προοδευτικής ατροφίας αμφιβληστροειδούς έχουν αναφερθεί. Η νόσος von Willebrand (διαταραχή πήξης) έχει αναφερθεί· ο γενετικός έλεγχος είναι διαθέσιμος. Γενικά είναι σχετικά υγιή ράτσα με τυπική διάρκεια ζωής 12–14 ετών. Οι αξιόπιστοι εκτροφείς πραγματοποιούν ελέγχους υγείας για ισχίο, καρδιά και μάτια. Τακτικοί κτηνιατρικοί έλεγχοι και διατήρηση υγιούς βάρους υποστηρίζουν τη μακροπρόθεσμη υγεία."
  },
  {
    "id": "giant-schnauzer",
    "slug": "giant-schnauzer",
    "name_en": "Giant Schnauzer",
    "name_el": "Γιγαντιαίος Σνάουτσερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "large",
    "lifespan": "12-15 years",
    "temperament_en": ["Loyal", "Intelligent", "Strong-willed", "Protective", "Energetic"],
    "temperament_el": ["Πιστός", "Έξυπνος", "Ανδρεῖος", "Προστατευτικός", "Ενεργητικός"],
    "description_en": "The Giant Schnauzer is the largest of the three Schnauzer breeds, developed in Bavaria and Württemberg for driving cattle, guarding, and as a versatile military and police dog. They have a distinctive wiry coat, beard, and eyebrows that require regular grooming. Giant Schnauzers are loyal, intelligent, and strong-willed—they need an owner who can provide confident leadership, plenty of exercise, and mental challenges. They are protective of their family and make excellent working, sport, or protection dogs when properly trained. They excel in obedience, agility, tracking, and Schutzhund-style work. Without sufficient activity and structure they can become bored or dominant. They are not for first-time or passive owners.",
    "description_el": "Το Γιγαντιαίο Σνάουτσερ είναι το μεγαλύτερο από τα τρία ράτσα Σνάουτσερ, που αναπτύχθηκε στη Βαυαρία και τη Βυρτεμβέργη για οδήγηση βοοειδών, φύλαξη και ως ευέλικτος στρατιωτικός και αστυνομικός σκύλος. Έχουν χαρακτηριστικό σκληρό τρίχωμα, γενειάδα και φρύδια που απαιτούν τακτική περιποίηση. Τα Γιγαντιαία Σνάουτσερ είναι πιστά, έξυπνα και ανδρεία—χρειάζονται ιδιοκτήτη που μπορεί να παρέχει σίγουρη ηγεσία, πολλή άσκηση και νοητικές προκλήσεις. Είναι προστατευτικά της οικογένειάς τους και γίνονται εξαιρετικοί εργατικοί, αθλητικοί ή σκύλοι προστασίας όταν εκπαιδευτούν σωστά. Διαπρέπουν στην υπακοή, ευκινησία, ιχνηλασία και εργασία στυλ Schutzhund. Χωρίς επαρκή δραστηριότητα και δομή μπορεί να γίνουν ανήσυχα ή κυρίαρχα. Δεν είναι για ιδιοκτήτες που έχουν για πρώτη φορά σκύλο ή παθητικούς ιδιοκτήτες.",
    "characteristics": { "energy": 5, "grooming": 4, "friendliness": 3, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Giant Schnauzers need substantial daily exercise—at least 1 to 2 hours of walks, runs, or structured activity—and mental stimulation through training, obedience, agility, or protection work. Their wiry coat requires regular grooming: hand-stripping or clipping every 6–8 weeks and brushing several times a week to prevent matting. They need consistent, firm training and early socialization with people and other dogs to be manageable. They excel at obedience, agility, and protection sports and thrive when given a job. Not for first-time or passive owners; they require someone who can provide leadership and meet their high activity needs. A house with a yard and active lifestyle is ideal.",
    "care_el": "Τα Γιγαντιαία Σνάουτσερ χρειάζονται σημαντική καθημερινή άσκηση—τουλάχιστον 1 έως 2 ώρες βόλτων, τρεξίματος ή δομημένης δραστηριότητας—και νοητική διέγερση μέσω εκπαίδευσης, υπακοής, ευκινησίας ή εργασίας προστασίας. Το σκληρό τρίχωμά τους απαιτεί τακτική περιποίηση: hand-stripping ή κούρεμα κάθε 6–8 εβδομάδες και βούρτσισμα αρκετές φορές την εβδομάδα για να αποφευχθούν οι κόμποι. Απαιτούν σταθερή, σταθερή εκπαίδευση και πρώιμη κοινωνικοποίηση με ανθρώπους και άλλα σκυλιά ώστε να είναι διαχειρίσιμα. Διαπρέπουν στην υπακοή, ευκινησία και αθλήματα προστασίας και ευδοκιμούν όταν τους δίνεται δουλειά. Όχι για ιδιοκτήτες που έχουν για πρώτη φορά σκύλο ή παθητικούς· απαιτούν κάποιον που μπορεί να παρέχει ηγεσία και να ικανοποιήσει τις υψηλές ανάγκες τους σε δραστηριότητα. Ιδανικό είναι σπίτι με προαύλιο και ενεργό τρόπο ζωής.",
    "health_en": "Giant Schnauzers may be prone to hip dysplasia; OFA or PennHIP screening by breeders is recommended. Eye issues including cataracts and progressive retinal atrophy (PRA) can occur; breeders may test for hereditary eye conditions. Hypothyroidism has been reported. Bloat (gastric dilatation-volvulus) can occur; feed two or three smaller meals and avoid vigorous exercise after eating. Autoimmune conditions have been reported in some lines. Health testing by breeders for hips and eyes is recommended. Typical lifespan is about 12–15 years. Regular veterinary care and weight management support long-term health.",
    "health_el": "Τα Γιγαντιαία Σνάουτσερ μπορεί να εμφανίσουν δυσπλασία ισχίου· συνιστάται OFA ή PennHIP έλεγχος από εκτροφείς. Οφθαλμικά προβλήματα συμπεριλαμβανομένων καταρράκτη και προοδευτικής ατροφίας αμφιβληστροειδούς (PRA) μπορεί να εμφανιστούν· οι εκτροφείς μπορεί να ελέγχουν για κληρονομικές οφθαλμικές παθήσεις. Ο υποθυρεοειδισμός έχει αναφερθεί. Το φούσκωμα (γαστρική διάταση-συστροφή) μπορεί να εμφανιστεί· δίνετε δύο ή τρία μικρότερα γεύματα και αποφεύγετε έντονη άσκηση μετά το φαγητό. Αυτοάνοσες παθήσεις έχουν αναφερθεί σε ορισμένες σειρές. Συνιστάται έλεγχος υγείας από εκτροφείς για ισχίο και μάτια. Τυπική διάρκεια ζωής περίπου 12–15 χρόνια. Η τακτική κτηνιατρική φροντίδα και η διαχείριση βάρους υποστηρίζουν τη μακροπρόθεσμη υγεία."
  },
  {
    "id": "great-dane",
    "slug": "great-dane",
    "name_en": "Great Dane",
    "name_el": "Γερμανικό Δανό",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "giant",
    "lifespan": "7-10 years",
    "temperament_en": ["Friendly", "Gentle", "Loyal", "Confident", "Patient"],
    "temperament_el": ["Φιλικός", "Ήπιος", "Πιστός", "Σίγουρος", "Υπομονετικός"],
    "description_en": "The Great Dane is a giant German breed often referred to as the 'Apollo of dogs' for their regal, majestic bearing and powerful yet elegant build. Despite their name suggesting Danish origins, the breed was developed in Germany where they were used by nobility to hunt wild boar, one of the most formidable prey in European forests, requiring a dog of immense size, speed, and courage. Great Danes are among the tallest dog breeds in the world — the Guinness record holder Zeus stood at 111.8 cm (44 inches) at the shoulder — yet they are famously gentle and affectionate with their families. They bond deeply with their people and are known for their patience with children, often behaving as oversized lap dogs despite weighing 50–90 kg. Their short, smooth coat comes in several striking patterns including fawn, brindle, blue, black, harlequin, and mantle. Sadly, their giant size contributes to a relatively short lifespan of 7–10 years, but their devotion and gentle spirit make every year deeply rewarding for their owners.",
    "description_el": "Το Γερμανικό Δανό είναι γιγαντιαία γερμανική ράτσα που συχνά αποκαλείται «Απόλλων των σκύλων» για τη βασιλική, μεγαλοπρεπή εμφάνισή του και την ισχυρή αλλά κομψή σωματική διάπλαση. Παρά το όνομα που υποδηλώνει δανική καταγωγή, η ράτσα αναπτύχθηκε στη Γερμανία όπου χρησιμοποιούνταν από την αριστοκρατία για κυνήγι αγριόχοιρου, ενός από τα πιο επιβλητικά θηράματα στα ευρωπαϊκά δάση, απαιτώντας σκύλο τεράστιου μεγέθους, ταχύτητας και θάρρους. Τα Γερμανικά Δανό είναι ανάμεσα στις ψηλότερες ράτσες σκύλων στον κόσμο — ο κάτοχος του ρεκόρ Guinness Zeus είχε ύψος 111,8 εκ. στον ώμο — αλλά είναι περίφημα ήπια και στοργικά με τις οικογένειές τους. Δένονται βαθιά με τους ανθρώπους τους και είναι γνωστά για την υπομονή τους με τα παιδιά, συμπεριφερόμενα συχνά ως υπερμεγέθη σκυλιά αγκαλιάς παρά το βάρος 50–90 κιλών. Το κοντό, λείο τρίχωμά τους εμφανίζεται σε πολλά εντυπωσιακά μοτίβα συμπεριλαμβανομένων fawn, brindle, μπλε, μαύρο, harlequin και mantle. Δυστυχώς, το γιγαντιαίο μέγεθός τους συμβάλλει σε σχετικά σύντομη διάρκεια ζωής 7–10 ετών, αλλά η αφοσίωση και το ήπιο πνεύμα τους κάνουν κάθε χρόνο βαθιά ανταποδοτικό για τους ιδιοκτήτες τους.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Great Danes need moderate daily exercise — about 1 to 1.5 hours of walks and gentle play — but it is critical to protect their developing joints during puppyhood and adolescence by avoiding excessive running, jumping, or stair climbing until they are at least 18 months old. Their short coat is very low-maintenance, requiring only weekly brushing and occasional bathing. Bloat prevention is paramount for this breed: feed two or three smaller meals daily using a slow-feeder bowl, avoid vigorous exercise for at least an hour before and after meals, and discuss prophylactic gastropexy with your veterinarian. Great Dane puppies grow at an astonishing rate — gaining up to 45 kg in their first year — so a carefully formulated large-breed puppy diet that controls calcium and phosphorus levels is essential to prevent developmental orthopedic diseases. Early socialization and obedience training while the dog is still a manageable size is highly recommended, as an untrained adult Great Dane is nearly impossible to physically control. They thrive as indoor family members with access to a spacious yard and do not tolerate being left alone for long periods.",
    "care_el": "Τα Γερμανικά Δανό χρειάζονται μέτρια καθημερινή άσκηση — περίπου 1 έως 1,5 ώρες βόλτων και ήπιου παιχνιδιού — αλλά είναι κρίσιμο να προστατευτούν οι αναπτυσσόμενες αρθρώσεις κατά τη νεανική ηλικία αποφεύγοντας υπερβολικό τρέξιμο, άλματα ή ανέβασμα σκαλιών μέχρι τουλάχιστον τους 18 μήνες. Το κοντό τρίχωμά τους είναι πολύ χαμηλής συντήρησης, απαιτώντας μόνο εβδομαδιαίο βούρτσισμα και περιστασιακό μπάνιο. Η πρόληψη του φούσκωματος είναι υψίστης σημασίας: δίνετε δύο ή τρία μικρότερα γεύματα χρησιμοποιώντας αργό ταΐστρα, αποφεύγετε έντονη άσκηση τουλάχιστον μία ώρα πριν και μετά τα γεύματα, και συζητήστε προληπτική γαστροπηξία με τον κτηνίατρο. Τα κουτάβια μεγαλώνουν με εκπληκτικό ρυθμό — κερδίζοντας έως 45 κιλά τον πρώτο χρόνο — επομένως μια προσεκτικά διαμορφωμένη διατροφή κουταβιών μεγάλων ρατσών που ελέγχει τα επίπεδα ασβεστίου και φωσφόρου είναι απαραίτητη για την πρόληψη ορθοπεδικών παθήσεων ανάπτυξης. Η πρώιμη κοινωνικοποίηση και εκπαίδευση υπακοής ενόσω ο σκύλος είναι ακόμη διαχειρίσιμος σε μέγεθος συνιστάται ιδιαίτερα, καθώς ένα ανεκπαίδευτο ενήλικο Γερμανικό Δανό είναι σχεδόν αδύνατο να ελεγχθεί σωματικά. Ευδοκιμούν ως μέλη της οικογένειας στο εσωτερικό με πρόσβαση σε ευρύχωρο προαύλιο.",
    "health_en": "Great Danes are highly susceptible to bloat (gastric dilatation-volvulus or GDV), which is the leading cause of death in the breed and constitutes a life-threatening emergency requiring immediate surgical intervention — prophylactic gastropexy during spay/neuter is increasingly recommended. Dilated cardiomyopathy (DCM) is a significant concern; annual cardiac screening including echocardiography is advised, especially after age 3. Hip dysplasia affects many Great Danes, and OFA or PennHIP evaluation by breeders is strongly recommended. Osteosarcoma (bone cancer) is more common in giant breeds and typically appears in middle age; any unexplained limping should be evaluated promptly. Wobbler syndrome (cervical spondylomyelopathy) can cause neck pain and gait abnormalities. Hypothyroidism, Addison's disease, and eye conditions including entropion have been reported. With careful health management, Great Danes typically live 7–10 years, though some well-bred individuals can exceed this range.",
    "health_el": "Τα Γερμανικά Δανό είναι ιδιαίτερα ευάλωτα στο φούσκωμα (γαστρική διάταση-συστροφή ή GDV), που αποτελεί την κύρια αιτία θανάτου στη ράτσα και συνιστά απειλητική για τη ζωή έκτακτη ανάγκη που απαιτεί άμεση χειρουργική επέμβαση — η προληπτική γαστροπηξία κατά τη στείρωση συνιστάται ολοένα περισσότερο. Η διαστολική καρδιομυοπάθεια (DCM) είναι σημαντική ανησυχία· συνιστάται ετήσιος καρδιακός έλεγχος συμπεριλαμβανομένου ηχοκαρδιογραφήματος, ειδικά μετά την ηλικία των 3. Η δυσπλασία ισχίου επηρεάζει πολλά Γερμανικά Δανό και η αξιολόγηση OFA ή PennHIP από εκτροφείς συνιστάται ιδιαίτερα. Το οστεοσάρκωμα (καρκίνος οστών) είναι πιο κοινό σε γιγαντιαίες ράτσες και εμφανίζεται τυπικά σε μέση ηλικία· κάθε ανεξήγητο κούτσαμα πρέπει να αξιολογείται άμεσα. Το σύνδρομο Wobbler μπορεί να προκαλέσει πόνο στον αυχένα και διαταραχές βάδισης. Υποθυρεοειδισμός, νόσος Addison και οφθαλμικές παθήσεις όπως εντρόπιον έχουν αναφερθεί. Με προσεκτική διαχείριση υγείας, τα Γερμανικά Δανό ζουν τυπικά 7–10 χρόνια."
  },
  {
    "id": "great-pyrenees",
    "slug": "great-pyrenees",
    "name_en": "Great Pyrenees",
    "name_el": "Μεγάλος Πυρηναίος",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Calm", "Patient", "Loyal", "Gentle", "Protective"],
    "temperament_el": ["Ήρεμος", "Υπομονετικός", "Πιστός", "Ήπιος", "Προστατευτικός"],
    "description_en": "The Great Pyrenees (Patou in French, or Pyrenean Mountain Dog) is a majestic livestock guardian breed that has protected flocks in the Pyrenees Mountains between France and Spain for thousands of years, with archaeological evidence of the breed dating back to 1800 BC. These imposing dogs were bred to live with sheep on mountain pastures and autonomously defend them against wolves, bears, and livestock thieves, often working through the night without human supervision. Their thick, predominantly white coat served a practical purpose — it helped shepherds distinguish them from predators in low light. Great Pyrenees were favored by French royalty, with Louis XIV declaring them the Royal Dog of France in 1675. They are calm, patient, and deeply affectionate with their families, showing remarkable gentleness with children and smaller animals. However, they retain powerful guardian instincts and a strong independent streak, making them think for themselves rather than blindly following commands. They are known for being nocturnal barkers, a trait rooted in their centuries of nighttime guarding duties.",
    "description_el": "Ο Μεγάλος Πυρηναίος (Patou στα γαλλικά ή Πυρηναϊκός Ορεινός Σκύλος) είναι μια μεγαλοπρεπής ράτσα φύλακας κοπαδιών που προστάτευε τα κοπάδια στα Πυρηναία Όρη μεταξύ Γαλλίας και Ισπανίας για χιλιάδες χρόνια, με αρχαιολογικά στοιχεία που χρονολογούν τη ράτσα στο 1800 π.Χ. Αυτοί οι επιβλητικοί σκύλοι εκτράφηκαν για να ζουν με τα πρόβατα σε ορεινές βοσκές και να τα υπερασπίζονται αυτόνομα από λύκους, αρκούδες και κλέφτες, συχνά εργαζόμενοι όλη τη νύχτα χωρίς ανθρώπινη επίβλεψη. Το πυκνό, κυρίως λευκό τρίχωμα εξυπηρετούσε πρακτικό σκοπό — βοηθούσε τους βοσκούς να τους ξεχωρίζουν από τα αρπακτικά σε χαμηλό φωτισμό. Οι Μεγάλοι Πυρηναίοι ήταν αγαπημένοι της γαλλικής βασιλείας, με τον Λουδοβίκο ΙΔ' να τους ανακηρύσσει Βασιλικό Σκύλο της Γαλλίας το 1675. Είναι ήρεμοι, υπομονετικοί και βαθιά στοργικοί με τις οικογένειές τους, δείχνοντας αξιοσημείωτη τρυφερότητα με τα παιδιά και τα μικρότερα ζώα. Ωστόσο, διατηρούν ισχυρά ένστικτα φύλακα και ισχυρή ανεξάρτητη νοοτροπία, σκεπτόμενοι μόνοι τους αντί να ακολουθούν τυφλά εντολές. Είναι γνωστοί ως νυχτερινοί γαβγιστές, χαρακτηριστικό που ριζώνει στους αιώνες νυχτερινής φύλαξης.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 4, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Great Pyrenees need moderate daily exercise — about 1 hour of walks or free roaming in a securely fenced area — but they are not a high-energy breed and are content with a calm lifestyle between activity periods. Their thick, weather-resistant double coat requires thorough brushing at least twice a week, increasing to daily during the heavy seasonal shedding periods (spring and fall) when they blow their undercoat. Training a Great Pyrenees requires patience and realistic expectations; they were bred to make independent decisions, so they may evaluate commands before deciding whether to comply — positive reinforcement and consistency work better than harsh corrections. Secure, high fencing (at least 1.5 meters) is essential, as they are inclined to patrol and may wander to expand their perceived territory. They are naturally nocturnal and may bark extensively at night to ward off perceived threats; this is deeply ingrained behavior that is difficult to eliminate entirely. They thrive in rural or suburban homes with large yards and are not well-suited to apartment living or dense neighborhoods where barking would be problematic.",
    "care_el": "Οι Μεγάλοι Πυρηναίοι χρειάζονται μέτρια καθημερινή άσκηση — περίπου 1 ώρα βόλτων ή ελεύθερης περιπλάνησης σε ασφαλώς περιφραγμένο χώρο — αλλά δεν είναι ράτσα υψηλής ενέργειας και ικανοποιούνται με ήρεμο τρόπο ζωής. Το πυκνό, ανθεκτικό στον καιρό διπλό τρίχωμα απαιτεί ενδελεχές βούρτσισμα τουλάχιστον δύο φορές την εβδομάδα, αυξανόμενο σε καθημερινό κατά τις έντονες εποχιακές τριχοπτώσεις (άνοιξη και φθινόπωρο). Η εκπαίδευσή τους απαιτεί υπομονή και ρεαλιστικές προσδοκίες — εκτράφηκαν για ανεξάρτητες αποφάσεις, οπότε μπορεί να αξιολογούν τις εντολές πριν αποφασίσουν αν θα συμμορφωθούν. Ασφαλής, ψηλή περίφραξη (τουλάχιστον 1,5 μέτρο) είναι απαραίτητη, καθώς τείνουν να περιπολούν και μπορεί να περιπλανηθούν. Είναι φυσικά νυχτόβια και μπορεί να γαβγίζουν εκτενώς τη νύχτα — αυτή είναι βαθιά ριζωμένη συμπεριφορά. Ευδοκιμούν σε αγροτικά ή προαστιακά σπίτια με μεγάλες αυλές.",
    "health_en": "Great Pyrenees may be prone to hip dysplasia, and OFA or PennHIP screening by breeders is strongly recommended given the breed's large size and rapid growth rate. Bloat (gastric dilatation-volvulus) is a serious risk; feeding two or three smaller meals and avoiding exercise around mealtimes can reduce the danger, and prophylactic gastropexy may be discussed with your vet. Patellar luxation affects some individuals, particularly in the hind legs. Osteosarcoma (bone cancer) occurs more frequently in large breeds and should be investigated if unexplained lameness appears. Neurological conditions including degenerative myelopathy have been reported. Eye conditions such as entropion and cataracts can develop, and CERF or OFA eye exams are recommended for breeding stock. Addison's disease (hypoadrenocorticism) has been observed in some lines. With responsible breeding and proper care, Great Pyrenees typically live 10–12 years.",
    "health_el": "Οι Μεγάλοι Πυρηναίοι μπορεί να εμφανίσουν δυσπλασία ισχίου, και ο έλεγχος OFA ή PennHIP από εκτροφείς συνιστάται ιδιαίτερα δεδομένου του μεγάλου μεγέθους και του ταχέος ρυθμού ανάπτυξης. Το φούσκωμα (γαστρική διάταση-συστροφή) είναι σοβαρός κίνδυνος· η σίτιση δύο ή τριών μικρότερων γευμάτων μπορεί να μειώσει τον κίνδυνο, και η προληπτική γαστροπηξία μπορεί να συζητηθεί με τον κτηνίατρο. Η εξάρθρωση επιγονατίδας επηρεάζει ορισμένα άτομα. Το οστεοσάρκωμα εμφανίζεται πιο συχνά σε μεγάλες ράτσες. Νευρολογικές παθήσεις συμπεριλαμβανομένης εκφυλιστικής μυελοπάθειας έχουν αναφερθεί. Οφθαλμικές παθήσεις όπως εντρόπιον και καταρράκτης μπορεί να αναπτυχθούν. Η νόσος Addison (υποφλοιοεπινεφριδισμός) έχει παρατηρηθεί σε ορισμένες σειρές. Με υπεύθυνη εκτροφή και σωστή φροντίδα, οι Μεγάλοι Πυρηναίοι ζουν τυπικά 10–12 χρόνια."
  },
  {
    "id": "greater-swiss-mountain-dog",
    "slug": "greater-swiss-mountain-dog",
    "name_en": "Greater Swiss Mountain Dog",
    "name_el": "Μεγάλος Ελβετικός Ορεινός Σκύλος",
    "type": "dog",
    "origin": "Switzerland",
    "originCode": "CH",
    "images": [],
    "size": "large",
    "lifespan": "8-11 years",
    "temperament_en": ["Friendly", "Devoted", "Calm", "Energetic", "Good-natured"],
    "temperament_el": ["Φιλικός", "Αφοσιωμένος", "Ήρεμος", "Ενεργητικός", "Καλόκαρδος"],
    "description_en": "The Greater Swiss Mountain Dog (Grosser Schweizer Sennenhund) is the largest and oldest of the four Swiss mountain dog breeds, believed to descend from Molosser-type dogs brought to Switzerland by Roman legions over 2,000 years ago. Originally used as all-purpose farm dogs for drafting (pulling heavy carts of milk, cheese, and produce to market), herding cattle, and guarding property in the Swiss Alps, they are powerful, muscular dogs with a distinctive tricolor coat of black, rust, and white. Swissies are friendly, devoted, and good-natured — they bond deeply with their families and are remarkably gentle and patient with children, earning them the nickname 'the poor man's horse' for their impressive pulling strength. Despite their size (weighing 45–64 kg), they are energetic and surprisingly agile, thriving on outdoor activities like hiking and carting. The breed was thought to be extinct by the late 1800s but was rediscovered and revived by Professor Albert Heim, who also championed the other Swiss mountain breeds. They are still relatively uncommon outside of Switzerland but are gaining popularity as versatile family companions.",
    "description_el": "Ο Μεγάλος Ελβετικός Ορεινός Σκύλος (Grosser Schweizer Sennenhund) είναι ο μεγαλύτερος και παλαιότερος από τα τέσσερα ελβετικά ορεινά ράτσες, που πιστεύεται ότι κατάγεται από σκύλους τύπου Molosser που έφεραν οι ρωμαϊκές λεγεώνες στην Ελβετία πριν από 2.000 χρόνια. Αρχικά χρησιμοποιούνταν ως πολυχρηστικοί αγροτικοί σκύλοι για έλξη βαρέων αμαξιών γάλακτος, τυριού και προϊόντων στην αγορά, εκτροφή βοοειδών και φύλαξη ιδιοκτησίας στις Ελβετικές Άλπεις. Είναι ισχυροί, μυώδεις σκύλοι με χαρακτηριστικό τρίχρωμο τρίχωμα μαύρο, κοκκινωπό και λευκό. Οι Swissies είναι φιλικοί, αφοσιωμένοι και καλόκαρδοι — δένονται βαθιά με τις οικογένειές τους και είναι αξιοσημείωτα ήπιοι και υπομονετικοί με τα παιδιά. Παρά το μέγεθός τους (45–64 κιλά), είναι ενεργητικοί και εκπληκτικά ευκίνητοι, ευδοκιμώντας σε υπαίθριες δραστηριότητες όπως πεζοπορία και έλξη. Η ράτσα θεωρούνταν εξαφανισμένη στα τέλη του 1800 αλλά ανακαλύφθηκε και αναβίωσε από τον καθηγητή Albert Heim. Είναι ακόμα σχετικά σπάνιοι εκτός Ελβετίας αλλά κερδίζουν δημοτικότητα ως ευέλικτοι οικογενειακοί σύντροφοι.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Greater Swiss Mountain Dogs need regular daily exercise — at least 1 to 1.5 hours of walks, hiking, or active play — and they particularly enjoy pulling activities like carting and weight-pulling which honor their drafting heritage. Their short, dense double coat is relatively low-maintenance, requiring weekly brushing, though shedding increases significantly during seasonal coat changes. They are prone to weight gain, so careful portion control and a large-breed appropriate diet are important; obesity puts additional strain on their joints and heart. Early socialization and obedience training are beneficial, as they grow quickly into large, powerful adults — establishing good manners while they are still manageable is essential. They thrive in homes with access to a yard where they can move and explore, and they do best as indoor family members who participate in daily activities. They drool moderately, especially around mealtimes and when warm. Avoid intense exercise in hot weather, as their large size and dark coat can lead to overheating.",
    "care_el": "Οι Μεγάλοι Ελβετικοί Ορεινοί Σκύλοι χρειάζονται τακτική καθημερινή άσκηση — τουλάχιστον 1 έως 1,5 ώρες βόλτων, πεζοπορίας ή ενεργού παιχνιδιού — και απολαμβάνουν ιδιαίτερα δραστηριότητες έλξης που τιμούν την κληρονομιά τους. Το κοντό, πυκνό διπλό τρίχωμά τους είναι σχετικά χαμηλής συντήρησης, απαιτώντας εβδομαδιαίο βούρτσισμα, αν και η τριχόπτωση αυξάνεται σημαντικά κατά τις εποχιακές αλλαγές. Είναι επιρρεπείς σε αύξηση βάρους, επομένως προσεκτικός έλεγχος μερίδων και κατάλληλη διατροφή είναι σημαντικά· η παχυσαρκία επιβαρύνει τις αρθρώσεις και την καρδιά. Η πρώιμη κοινωνικοποίηση και εκπαίδευση είναι ωφέλιμα καθώς μεγαλώνουν γρήγορα. Ευδοκιμούν σε σπίτια με πρόσβαση σε προαύλιο και ως μέλη της οικογένειας στο εσωτερικό. Σταλάζουν μέτρια, ειδικά κοντά στα γεύματα. Αποφεύγετε έντονη άσκηση σε ζεστό καιρό.",
    "health_en": "Greater Swiss Mountain Dogs may be prone to hip and elbow dysplasia — OFA screening by breeders is strongly recommended for both conditions. Bloat (gastric dilatation-volvulus) is a significant risk in this deep-chested breed; feeding two or three smaller meals, using a slow-feeder bowl, and avoiding exercise around mealtimes are important preventive measures. Idiopathic epilepsy has been reported at higher rates than in many other breeds and typically appears between ages 1 and 5. Splenic torsion (twisting of the spleen) is an unusual condition that occurs more frequently in Swissies than most breeds and presents as an emergency. Urinary incontinence, particularly in spayed females, is relatively common. Distichiasis (extra eyelashes that irritate the cornea) and other eye conditions have been noted. Lick fit syndrome (episodes of frantic licking and swallowing) has been observed. Responsible breeders screen for hips, elbows, and eyes. Typical lifespan is about 8–11 years.",
    "health_el": "Οι Μεγάλοι Ελβετικοί Ορεινοί Σκύλοι μπορεί να εμφανίσουν δυσπλασία ισχίου και αγκώνα — ο έλεγχος OFA από εκτροφείς συνιστάται ιδιαίτερα. Το φούσκωμα (γαστρική διάταση-συστροφή) είναι σημαντικός κίνδυνος· η σίτιση μικρότερων γευμάτων και η αποφυγή άσκησης γύρω από τα γεύματα είναι σημαντικά. Η ιδιοπαθής επιληψία αναφέρεται σε υψηλότερα ποσοστά και εμφανίζεται τυπικά μεταξύ 1 και 5 ετών. Η στρέψη σπλήνα εμφανίζεται πιο συχνά σε Swissies και αποτελεί έκτακτη ανάγκη. Η ακράτεια ούρων, ιδιαίτερα σε στειρωμένα θηλυκά, είναι σχετικά κοινή. Δισστιχίαση και άλλες οφθαλμικές παθήσεις έχουν σημειωθεί. Το σύνδρομο φρενίτιδας γλειψίματος (lick fit) έχει παρατηρηθεί. Οι υπεύθυνοι εκτροφείς ελέγχουν για ισχίο, αγκώνες και μάτια. Τυπική διάρκεια ζωής περίπου 8–11 χρόνια."
  },
  {
    "id": "hovawart",
    "slug": "hovawart",
    "name_en": "Hovawart",
    "name_el": "Χόβαβαρτ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "large",
    "lifespan": "10-14 years",
    "temperament_en": ["Loyal", "Devoted", "Intelligent", "Protective", "Energetic"],
    "temperament_el": ["Πιστός", "Αφοσιωμένος", "Έξυπνος", "Προστατευτικός", "Ενεργητικός"],
    "description_en": "The Hovawart is a German working breed whose name derives from Middle High German — 'Hova' (homestead) and 'Wart' (watchman) — meaning 'estate guardian,' a role they have fulfilled since medieval times. First mentioned in German writings as early as 1210, they were prized by nobles and farmers alike for guarding castles, estates, and livestock. The breed nearly disappeared after the Middle Ages but was meticulously recreated in the early 20th century by Kurt Friedrich König, who crossed remaining farm dogs resembling the old Hovawart type with breeds including German Shepherds, Newfoundlands, Leonbergers, and others. Hovawarts are loyal, devoted, and highly intelligent with a versatile working nature — they excel in tracking, search and rescue, obedience, and protection sports. They are protective of their family and territory but are not aggressive without cause, preferring to assess situations before acting. They come in three color varieties: black and gold, blonde, and solid black. Hovawarts are notably slow to mature, both physically and mentally, often not reaching full adulthood until age 3 or even 4, which requires patient training approaches.",
    "description_el": "Το Χόβαβαρτ είναι γερμανική εργατική ράτσα το όνομα της οποίας προέρχεται από τη μεσαιωνική γερμανική — 'Hova' (αγροικία) και 'Wart' (φρουρός) — σημαίνοντας «φύλακας κτήματος», ρόλο που εκπληρώνει από τον Μεσαίωνα. Πρώτη αναφορά σε γερμανικά κείμενα ήδη από το 1210, εκτιμώνταν από ευγενείς και αγρότες για φύλαξη κάστρων, κτημάτων και ζώων. Η ράτσα σχεδόν εξαφανίστηκε μετά τον Μεσαίωνα αλλά αναδημιουργήθηκε επιμελώς στις αρχές του 20ού αιώνα από τον Kurt Friedrich König. Τα Χόβαβαρτ είναι πιστά, αφοσιωμένα και εξαιρετικά έξυπνα με ευέλικτη εργασιακή φύση — διαπρέπουν σε ιχνηλασία, έρευνα και διάσωση, υπακοή και αθλήματα προστασίας. Είναι προστατευτικά της οικογένειας αλλά δεν είναι επιθετικά χωρίς αιτία, προτιμώντας να αξιολογούν καταστάσεις πριν ενεργήσουν. Εμφανίζονται σε τρεις χρωματικές ποικιλίες: μαύρο-χρυσό, ξανθό και μονόχρωμο μαύρο. Ωριμάζουν αξιοσημείωτα αργά, φτάνοντας συχνά πλήρη ενηλικίωση στα 3 ή ακόμη 4 χρόνια.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 4, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Hovawarts need substantial daily exercise — at least 1.5 to 2 hours of walks, hikes, runs, or structured activities — and excel when given mental challenges through tracking, search work, obedience training, or agility courses. Their medium-length, slightly wavy coat requires brushing two to three times per week to prevent tangles and remove loose hair, with increased attention during seasonal shedding. They mature very slowly (up to 3–4 years for full physical and mental development), so training must be patient, consistent, and adapted to their development stage — harsh methods can damage the bond and create behavioral problems. Early socialization with people, other dogs, and varied environments is essential to develop a confident, balanced adult. They form deep bonds with their families and can develop separation anxiety if left alone for extended periods. They thrive in homes with an active lifestyle, ideally with a yard, and do best when included in family activities. Their strong guarding instinct means they may be vocal and territorial, which should be channeled through proper training.",
    "care_el": "Τα Χόβαβαρτ χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1,5 έως 2 ώρες βόλτων, πεζοπορίας, τρεξίματος ή δομημένων δραστηριοτήτων — και διαπρέπουν όταν τους δίνονται νοητικές προκλήσεις μέσω ιχνηλασίας, εργασίας αναζήτησης ή ευκινησίας. Το μεσαίου μήκους, ελαφρώς κυματιστό τρίχωμα απαιτεί βούρτσισμα δύο έως τρεις φορές την εβδομάδα, με αυξημένη προσοχή κατά τις εποχιακές τριχοπτώσεις. Ωριμάζουν πολύ αργά (έως 3–4 χρόνια), επομένως η εκπαίδευση πρέπει να είναι υπομονετική, σταθερή και προσαρμοσμένη στο στάδιο ανάπτυξής τους. Η πρώιμη κοινωνικοποίηση με ανθρώπους, άλλα σκυλιά και ποικίλα περιβάλλοντα είναι απαραίτητη. Δημιουργούν βαθιούς δεσμούς με τις οικογένειές τους και μπορεί να αναπτύξουν άγχος αποχωρισμού αν μείνουν μόνα. Ευδοκιμούν σε σπίτια με ενεργό τρόπο ζωής, ιδανικά με προαύλιο. Το ισχυρό ένστικτο φύλαξης σημαίνει ότι μπορεί να είναι φωνακλά και εδαφικά.",
    "health_en": "Hovawarts are generally considered a healthy breed thanks to the strict breeding standards maintained by German breed clubs, which require dogs to pass temperament tests and health screenings before being eligible for breeding. Hip dysplasia can occur, and OFA or similar hip evaluation is recommended; the breed generally has better hip scores than many large breeds due to diligent screening programs. Hypothyroidism has been reported and can be managed with daily medication once diagnosed. Cardiac conditions, while not extremely common, should be monitored with periodic checkups. Eye conditions including cataracts have been documented occasionally. Osteochondritis dissecans (OCD) can affect young, rapidly growing dogs — controlled growth through proper diet helps reduce risk. The breed benefits significantly from the German breeding club's (RZV) health requirements. Typical lifespan is about 10–14 years, which is excellent for a breed of this size.",
    "health_el": "Τα Χόβαβαρτ θεωρούνται γενικά υγιή ράτσα χάρη στα αυστηρά πρότυπα εκτροφής που διατηρούνται από τα γερμανικά σωματεία, τα οποία απαιτούν τα σκυλιά να περνούν τεστ ιδιοσυγκρασίας και ελέγχους υγείας πριν είναι κατάλληλα για εκτροφή. Η δυσπλασία ισχίου μπορεί να εμφανιστεί και συνιστάται αξιολόγηση OFA· η ράτσα γενικά έχει καλύτερα σκορ ισχίου από πολλές μεγάλες ράτσες λόγω επιμελών προγραμμάτων ελέγχου. Ο υποθυρεοειδισμός έχει αναφερθεί και μπορεί να αντιμετωπιστεί με καθημερινή φαρμακευτική αγωγή. Οι καρδιακές παθήσεις πρέπει να παρακολουθούνται με περιοδικούς ελέγχους. Οφθαλμικές παθήσεις συμπεριλαμβανομένου καταρράκτη έχουν τεκμηριωθεί. Η οστεοχόνδρωση μπορεί να επηρεάσει νεαρά σκυλιά. Τυπική διάρκεια ζωής περίπου 10–14 χρόνια, εξαιρετική για ράτσα αυτού του μεγέθους."
  },
  {
    "id": "kangal-shepherd-dog",
    "slug": "kangal-shepherd-dog",
    "name_en": "Kangal Shepherd Dog",
    "name_el": "Κανγκάλ Ποιμενικός",
    "type": "dog",
    "origin": "Turkey",
    "originCode": "TR",
    "images": [],
    "size": "large",
    "lifespan": "12-15 years",
    "temperament_en": ["Calm", "Loyal", "Protective", "Independent", "Courageous"],
    "temperament_el": ["Ήρεμος", "Πιστός", "Προστατευτικός", "Ανεξάρτητος", "Θαρραλέος"],
    "description_en": "The Kangal Shepherd Dog is Turkey's national dog, a powerful livestock guardian breed that has protected flocks of sheep and goats from wolves, bears, jackals, and even cheetahs in its homeland of the Sivas province in central Anatolia for thousands of years. The breed is named after the Kangal district and is considered a national treasure in Turkey, where export of purebred Kangals is tightly controlled by the government. They are distinguished by their characteristic fawn to sable coat with a distinctive black mask and ears, powerful build weighing 40–65 kg, and an impressive bite force estimated at over 700 PSI — one of the strongest among domestic dogs. Kangals are calm, steady, and deeply loyal to their family and flock during normal times, but transform into fearless, decisive protectors when a threat appears. They are independent thinkers bred to make autonomous decisions about threats without human direction, patrolling large areas and using their bark as the first line of defense before physical confrontation. In modern times, Kangals are increasingly used in wildlife conservation programs in Africa, where they protect livestock from cheetahs and other predators, reducing human-wildlife conflict without harming endangered species.",
    "description_el": "Ο Κανγκάλ Ποιμενικός είναι ο εθνικός σκύλος της Τουρκίας, μια ισχυρή ράτσα φύλακας κοπαδιών που προστατεύει πρόβατα και κατσίκες από λύκους, αρκούδες, τσακάλια και ακόμη και τσιτάχ στην πατρίδα του, την επαρχία Sivas στην κεντρική Ανατολία, εδώ και χιλιάδες χρόνια. Η ράτσα πήρε το όνομά της από την περιοχή Kangal και θεωρείται εθνικός θησαυρός στην Τουρκία, όπου η εξαγωγή καθαρόαιμων Kangal ελέγχεται αυστηρά από την κυβέρνηση. Διακρίνονται από το χαρακτηριστικό ξανθό έως σκούρο τρίχωμα με μαύρη μάσκα και αυτιά, ισχυρή σωματική διάπλαση 40–65 κιλών και εντυπωσιακή δύναμη δαγκώματος εκτιμώμενη πάνω από 700 PSI. Είναι ήρεμοι, σταθεροί και βαθιά πιστοί στην οικογένεια και το κοπάδι τους κανονικά, αλλά μετατρέπονται σε ατρόμητους προστάτες όταν εμφανίζεται απειλή. Είναι ανεξάρτητοι στο σκέψη, εκτράφηκαν να λαμβάνουν αυτόνομες αποφάσεις χωρίς ανθρώπινη καθοδήγηση. Σήμερα χρησιμοποιούνται ολοένα περισσότερο σε προγράμματα διατήρησης άγριας ζωής στην Αφρική, όπου προστατεύουν ζώα από τσιτάχ, μειώνοντας τη σύγκρουση ανθρώπου-άγριας ζωής.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 3, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Kangal Shepherd Dogs need regular daily exercise and, most importantly, a large, securely fenced property where they can patrol and fulfill their natural guarding instincts — this is a breed designed to roam and protect territory, not sit in a backyard. Their short, dense double coat is relatively easy to maintain with weekly brushing, though they shed heavily during seasonal coat changes (spring and fall) when more frequent brushing is needed. They require early and ongoing socialization with people, other dogs, and varied environments to be manageable in non-working situations, as unsocialized Kangals can become overly suspicious or difficult to handle. Training requires patience and respect for their independent nature — they will not respond well to harsh methods and may simply ignore commands they find unreasonable. They are not suited to apartments, urban environments, or homes without substantial land. Secure fencing must be tall (at least 1.8 meters) and robust, as they will patrol boundaries and may attempt to expand their territory. They are naturally nocturnal and will bark to alert, which is important to consider in suburban or rural areas near neighbors.",
    "care_el": "Οι Κανγκάλ Ποιμενικοί χρειάζονται τακτική καθημερινή άσκηση και, κυρίως, μεγάλη, ασφαλώς περιφραγμένη ιδιοκτησία όπου μπορούν να περιπολούν και να εκπληρώσουν τα φυσικά ένστικτα φύλαξης — αυτή η ράτσα σχεδιάστηκε για να περιπλανάται και να προστατεύει. Το κοντό, πυκνό διπλό τρίχωμα είναι σχετικά εύκολο στη συντήρηση με εβδομαδιαίο βούρτσισμα, αν και η τριχόπτωση αυξάνεται κατά τις εποχιακές αλλαγές. Απαιτούν πρώιμη και συνεχή κοινωνικοποίηση με ανθρώπους, σκυλιά και ποικίλα περιβάλλοντα. Η εκπαίδευση απαιτεί υπομονή και σεβασμό για την ανεξάρτητη φύση τους — δεν ανταποκρίνονται σε σκληρές μεθόδους. Δεν είναι κατάλληλοι για διαμερίσματα ή αστικά περιβάλλοντα. Η περίφραξη πρέπει να είναι ψηλή (τουλάχιστον 1,8 μέτρο) και ανθεκτική. Είναι φυσικά νυχτόβια και θα γαβγίζουν για ειδοποίηση.",
    "health_en": "Kangal Shepherd Dogs are generally among the healthiest large guardian breeds, benefiting from centuries of natural selection in the harsh Anatolian climate rather than intensive artificial breeding for show standards. Hip dysplasia can occur, though rates are relatively moderate compared to many large breeds; screening is still recommended. Entropion (inward rolling of the eyelid) has been reported and may require surgical correction. Lipoma (benign fatty tumors) can develop in older dogs but is rarely serious. As a landrace breed with a relatively large and diverse gene pool, they typically have fewer hereditary conditions than many modern breeds. Their robust constitution allows many Kangals to remain active working dogs well into old age. Regular veterinary checkups, parasite prevention (especially important for dogs living outdoors), and dental care support their naturally good health. Typical lifespan is an impressive 12–15 years for a breed of this size.",
    "health_el": "Οι Κανγκάλ Ποιμενικοί είναι γενικά ανάμεσα στις πιο υγιείς μεγάλες ράτσες φυλάκων, ωφελούμενοι από αιώνες φυσικής επιλογής στο σκληρό κλίμα της Ανατολίας. Η δυσπλασία ισχίου μπορεί να εμφανιστεί, αν και τα ποσοστά είναι σχετικά μέτρια· ο έλεγχος συνιστάται. Το εντρόπιον έχει αναφερθεί και μπορεί να απαιτεί χειρουργική διόρθωση. Τα λιπώματα μπορεί να αναπτυχθούν σε ηλικιωμένα σκυλιά αλλά σπάνια είναι σοβαρά. Ως ράτσα τύπου landrace με σχετικά μεγάλη γονιδιακή βάση, τυπικά έχουν λιγότερες κληρονομικές παθήσεις. Η ανθεκτική σύστασή τους επιτρέπει σε πολλά Kangal να παραμένουν ενεργά εργατικά σκυλιά σε μεγάλη ηλικία. Τακτικοί κτηνιατρικοί έλεγχοι, πρόληψη παρασίτων και φροντίδα δοντιών υποστηρίζουν τη φυσικά καλή υγεία τους. Τυπική διάρκεια ζωής εντυπωσιακά 12–15 χρόνια για ράτσα αυτού του μεγέθους."
  },
  {
    "id": "landseer",
    "slug": "landseer",
    "name_en": "Landseer",
    "name_el": "Λάντζιερ",
    "type": "dog",
    "origin": "Canada",
    "originCode": "CA",
    "images": [],
    "size": "giant",
    "lifespan": "8-10 years",
    "temperament_en": ["Gentle", "Friendly", "Calm", "Good-natured", "Loyal"],
    "temperament_el": ["Ήπιος", "Φιλικός", "Ήρεμος", "Καλόκαρδος", "Πιστός"],
    "description_en": "The Landseer is a giant black-and-white dog closely related to the Newfoundland but recognized by the FCI (Fédération Cynologique Internationale) as a distinct breed — the European Continental Type Landseer, separate from the black-and-white Newfoundland of North America. The breed is named after the renowned English painter Sir Edwin Landseer, whose 1838 painting 'A Distinguished Member of the Humane Society' famously depicted a noble black-and-white Newfoundland-type dog and popularized the color variety. Landseers are gentle giants known for their friendly, calm, and good-natured temperament — they bond deeply with families and show extraordinary patience and gentleness with children, historically earning a reputation as natural babysitters and water rescue dogs. They are powerful swimmers with partially webbed feet and a natural water rescue instinct, and stories abound of Landseers saving drowning people. Compared to the Newfoundland, the European Landseer tends to be slightly taller, longer-legged, and less heavily built, with a more active disposition. They are loyal, eager to please, and remarkably intelligent, making them excellent therapy dogs and family companions.",
    "description_el": "Το Λάντζιερ είναι γιγαντιαίο ασπρόμαυρο σκυλί στενά συνδεδεμένο με το Νιουφάουντλαντ αλλά αναγνωρισμένο από την FCI ως ξεχωριστή ράτσα — ο Ευρωπαϊκός Ηπειρωτικός Τύπος Λάντζιερ. Η ράτσα πήρε το όνομά της από τον διάσημο Άγγλο ζωγράφο Sir Edwin Landseer, του οποίου ο πίνακας του 1838 «A Distinguished Member of the Humane Society» απεικόνιζε ένα ευγενικό ασπρόμαυρο σκυλί τύπου Νιουφάουντλαντ και δημοσιοποίησε την ποικιλία χρώματος. Τα Λάντζιερ είναι ήπια γίγαντα γνωστά για τη φιλική, ήρεμη και καλόκαρδη ιδιοσυγκρασία — δένονται βαθιά με τις οικογένειες και δείχνουν εξαιρετική υπομονή με τα παιδιά. Είναι ισχυροί κολυμβητές με μερικώς ιστοπόδαρα πόδια και φυσικό ένστικτο διάσωσης στο νερό. Σε σύγκριση με το Νιουφάουντλαντ, ο Ευρωπαϊκός Λάντζιερ τείνει να είναι ελαφρώς ψηλότερος, με μακρύτερα πόδια και πιο ενεργητική διάθεση. Είναι πιστά, πρόθυμα να ευχαριστήσουν και αξιοσημείωτα έξυπνα.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Landseers need moderate daily exercise — about 1 to 1.5 hours of walks, play, or ideally swimming, which they adore and which provides excellent low-impact exercise for their large frames. Their thick, long double coat requires thorough brushing at least two to three times per week to prevent matting and manage shedding, with daily attention during seasonal coat changes. They drool moderately to heavily, especially after eating, drinking, or when warm — keeping towels accessible is practical advice for Landseer owners. They are sensitive to heat and should have access to cool, shaded areas and fresh water, especially in summer; exercise should be limited to cooler parts of the day. They are prone to weight gain, so careful portion control with a large-breed diet is essential — obesity dramatically increases stress on joints and organs. Early socialization and obedience training while they are still a manageable size is highly recommended, as an untrained 60+ kg adult can be difficult to control. They thrive as indoor family members with access to a spacious yard.",
    "care_el": "Τα Λάντζιερ χρειάζονται μέτρια καθημερινή άσκηση — περίπου 1 έως 1,5 ώρες βόλτων, παιχνιδιού ή ιδανικά κολύμβησης, που λατρεύουν και παρέχει εξαιρετική άσκηση χαμηλής πρόσκρουσης. Το πυκνό, μακρύ διπλό τρίχωμα απαιτεί ενδελεχές βούρτσισμα τουλάχιστον δύο έως τρεις φορές την εβδομάδα, με καθημερινή προσοχή κατά τις εποχιακές αλλαγές. Σταλάζουν μέτρια έως πολύ, ειδικά μετά το φαγητό ή όταν ζεσταίνονται. Είναι ευαίσθητα στη ζέστη και πρέπει να έχουν πρόσβαση σε δροσερούς χώρους. Είναι επιρρεπή σε αύξηση βάρους, επομένως προσεκτικός έλεγχος μερίδων με διατροφή μεγάλων ρατσών είναι απαραίτητος. Η πρώιμη κοινωνικοποίηση και εκπαίδευση ενόσω είναι ακόμη διαχειρίσιμα σε μέγεθος συνιστάται. Ευδοκιμούν ως μέλη της οικογένειας στο εσωτερικό με πρόσβαση σε ευρύχωρο προαύλιο.",
    "health_en": "Landseers share many health concerns with their Newfoundland cousins due to their close genetic relationship. Hip and elbow dysplasia are significant concerns — OFA or PennHIP screening by breeders is strongly recommended. Subvalvular aortic stenosis (SAS) is a serious congenital heart condition found in the breed; cardiac screening by a veterinary cardiologist is important for breeding stock and recommended for all individuals. Cystinuria, a condition causing kidney and bladder stones, has been identified and a DNA test is available. Bloat (gastric dilatation-volvulus) is a life-threatening risk in large, deep-chested breeds — feeding two or three smaller meals and avoiding exercise around mealtimes are essential precautions. Cruciate ligament injuries can occur due to their heavy build. Hypothyroidism and eye conditions including entropion and ectropion have been reported. Regular veterinary checkups, weight management, and choosing a health-tested breeder support a typical lifespan of 8–10 years.",
    "health_el": "Τα Λάντζιερ μοιράζονται πολλές ανησυχίες υγείας με τα συγγενικά Νιουφάουντλαντ. Η δυσπλασία ισχίου και αγκώνα είναι σημαντικές ανησυχίες — ο έλεγχος OFA ή PennHIP συνιστάται ιδιαίτερα. Η υποβαλβιδική αορτική στένωση (SAS) είναι σοβαρή συγγενής καρδιακή πάθηση· ο καρδιακός έλεγχος από κτηνιατρικό καρδιολόγο είναι σημαντικός. Η κυστινουρία, πάθηση που προκαλεί πέτρες νεφρών και ουροδόχου κύστης, έχει αναγνωριστεί και υπάρχει τεστ DNA. Το φούσκωμα (γαστρική διάταση-συστροφή) είναι απειλητικός κίνδυνος — η σίτιση μικρότερων γευμάτων και η αποφυγή άσκησης γύρω από τα γεύματα είναι απαραίτητες. Τραυματισμοί χιαστών συνδέσμων μπορεί να εμφανιστούν λόγω του βαρύ σώματος. Υποθυρεοειδισμός και οφθαλμικές παθήσεις έχουν αναφερθεί. Τυπική διάρκεια ζωής 8–10 χρόνια."
  },
  {
    "id": "leonberger",
    "slug": "leonberger",
    "name_en": "Leonberger",
    "name_el": "Λεονμπέργκερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "giant",
    "lifespan": "8-9 years",
    "temperament_en": ["Friendly", "Gentle", "Loyal", "Playful", "Patient"],
    "temperament_el": ["Φιλικός", "Ήπιος", "Πιστός", "Παιχνιδιάρης", "Υπομονετικός"],
    "description_en": "The Leonberger was created in the 1840s by Heinrich Essig, a politician and dog breeder in the German town of Leonberg, who sought to create a breed that resembled the lion on the town's coat of arms. He crossed Newfoundlands, Saint Bernards, and Great Pyrenees to produce these majestic, lion-like giants with a distinctive golden to reddish-brown coat and a dramatic dark mask. Leonbergers are friendly, gentle, and remarkably patient — they bond deeply with their families and are often described as the ideal family dog for those who can accommodate their enormous size (males can weigh over 70 kg). They are exceptionally tolerant and gentle with children, often allowing toddlers to climb on them without complaint. The breed loves water and is a strong, enthusiastic swimmer, a trait inherited from its Newfoundland ancestry. Despite their size, Leonbergers are surprisingly agile and have been used in water rescue, therapy work, carting, and various dog sports. The breed was nearly extinct after both World Wars, with only a handful of dogs surviving each time, but dedicated breeders rebuilt the population. Males develop a spectacular lion-like mane around the neck and chest that adds to their regal appearance.",
    "description_el": "Το Λεονμπέργκερ δημιουργήθηκε τη δεκαετία του 1840 από τον Heinrich Essig, πολιτικό και εκτροφέα σκύλων στη γερμανική πόλη Leonberg, που ήθελε να δημιουργήσει ράτσα που μοιάζει με το λιοντάρι στο εθνόσημο της πόλης. Διασταύρωσε Νιουφάουντλαντ, Σεντ Μπερνάρ και Μεγάλους Πυρηναίους για να παράγει αυτά τα μεγαλοπρεπή, λεοντόμορφα γίγαντα με χαρακτηριστικό χρυσό έως κοκκινωπό τρίχωμα και δραματική σκούρα μάσκα. Τα Λεονμπέργκερ είναι φιλικά, ήπια και αξιοσημείωτα υπομονετικά — δένονται βαθιά με τις οικογένειές τους και περιγράφονται συχνά ως ο ιδανικός οικογενειακός σκύλος (τα αρσενικά μπορεί να ξεπερνούν τα 70 κιλά). Είναι εξαιρετικά ανεκτικά με τα παιδιά. Λατρεύουν το νερό και είναι ισχυροί κολυμβητές. Παρά το μέγεθός τους, είναι εκπληκτικά ευκίνητα. Η ράτσα σχεδόν εξαφανίστηκε μετά τους δύο Παγκόσμιους Πολέμους αλλά αναδημιουργήθηκε. Τα αρσενικά αναπτύσσουν εντυπωσιακή χαίτη γύρω από τον λαιμό.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Leonbergers need regular daily exercise — about 1 to 1.5 hours of walks, swimming, hiking, or active play — with swimming being a particularly beloved and beneficial activity for the breed. Their long, thick, water-resistant double coat requires thorough brushing at least two to three times per week to prevent matting, with daily grooming during the heavy shedding seasons (spring and fall) when they blow their undercoat. They drool moderately, especially after drinking water or when warm. They are sensitive to heat due to their heavy coat and large body mass — ensure they have access to shade, cool areas, and fresh water during warm weather. Large-breed diet formulations that support joint health and prevent obesity are important, as excess weight dramatically shortens their already limited lifespan. Early obedience training and socialization while they are still a manageable size is essential — a 70 kg untrained Leonberger can be impossible to control physically. They thrive as indoor family members with access to a spacious yard and should not be isolated from their family, as they can develop behavioral issues when excluded from household life.",
    "care_el": "Τα Λεονμπέργκερ χρειάζονται τακτική καθημερινή άσκηση — περίπου 1 έως 1,5 ώρες βόλτων, κολύμβησης, πεζοπορίας ή ενεργού παιχνιδιού — με την κολύμβηση να είναι ιδιαίτερα αγαπημένη δραστηριότητα. Το μακρύ, πυκνό αδιάβροχο τρίχωμα απαιτεί ενδελεχές βούρτσισμα τουλάχιστον δύο έως τρεις φορές την εβδομάδα, με καθημερινή περιποίηση κατά τις εποχιακές τριχοπτώσεις. Σταλάζουν μέτρια, ειδικά μετά το νερό ή στη ζέστη. Είναι ευαίσθητα στη ζέστη — εξασφαλίστε σκιά και δροσερούς χώρους. Η διατροφή μεγάλων ρατσών που υποστηρίζει τις αρθρώσεις είναι σημαντική. Η πρώιμη εκπαίδευση ενόσω είναι διαχειρίσιμα είναι απαραίτητη — ένα ανεκπαίδευτο Λεονμπέργκερ 70 κιλών μπορεί να είναι αδύνατο να ελεγχθεί. Ευδοκιμούν ως μέλη της οικογένειας και δεν πρέπει να απομονώνονται.",
    "health_en": "Leonbergers face several serious health challenges that potential owners should be aware of. The breed has a recognized predisposition to a specific form of dilated cardiomyopathy sometimes called Leonberger cardiomyopathy — annual cardiac screening by echocardiography is strongly recommended starting from age 2. Hip and elbow dysplasia are common in this large breed; OFA screening by breeders is essential. Osteosarcoma (bone cancer) is a significant concern, particularly in middle-aged dogs. Addison's disease (hypoadrenocorticism) occurs at elevated rates in Leonbergers and can present with vague symptoms like lethargy and gastrointestinal upset. Bloat (GDV) is an ever-present risk in giant breeds — prophylactic gastropexy should be discussed with your veterinarian. Polyneuropathy, a progressive neurological condition affecting nerve function in the limbs, has been identified in the breed and a DNA test is available. Cataracts and other eye conditions can develop. Despite careful breeding, the typical lifespan is about 8–9 years, which is common for giant breeds.",
    "health_el": "Τα Λεονμπέργκερ αντιμετωπίζουν πολλές σοβαρές προκλήσεις υγείας. Η ράτσα έχει αναγνωρισμένη προδιάθεση σε ειδική μορφή διαστολικής καρδιομυοπάθειας — ο ετήσιος καρδιακός έλεγχος με ηχοκαρδιογράφημα συνιστάται ιδιαίτερα από την ηλικία των 2. Η δυσπλασία ισχίου και αγκώνα είναι κοινή· ο έλεγχος OFA είναι απαραίτητος. Το οστεοσάρκωμα είναι σημαντική ανησυχία, ιδιαίτερα σε μεσήλικα σκυλιά. Η νόσος Addison εμφανίζεται σε αυξημένα ποσοστά. Το φούσκωμα (GDV) είναι πάντα παρόν ρίσκο — η προληπτική γαστροπηξία πρέπει να συζητηθεί. Η πολυνευροπάθεια, προοδευτική νευρολογική πάθηση, έχει αναγνωριστεί και υπάρχει τεστ DNA. Καταρράκτης και άλλες οφθαλμικές παθήσεις μπορεί να αναπτυχθούν. Η τυπική διάρκεια ζωής είναι περίπου 8–9 χρόνια."
  },
  {
    "id": "mastiff",
    "slug": "mastiff",
    "name_en": "Mastiff",
    "name_el": "Μαστίφ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "giant",
    "lifespan": "6-10 years",
    "temperament_en": ["Calm", "Loyal", "Gentle", "Courageous", "Dignified"],
    "temperament_el": ["Ήρεμος", "Πιστός", "Ήπιος", "Θαρραλέος", "Αξιοπρεπής"],
    "description_en": "The Mastiff, also known as the English Mastiff or Old English Mastiff, is one of the oldest and largest dog breeds in the world, with a documented history stretching back over 5,000 years to ancient civilizations including Babylon, Egypt, and Rome, where massive molosser-type dogs were used in warfare, arena fighting, and as guardians of estates. Julius Caesar himself described with admiration the enormous British war dogs that fought alongside Celtic warriors during his invasion of Britain in 55 BC. Despite this fierce historical legacy, modern Mastiffs are remarkably calm, gentle, and dignified companions — often described as 'gentle giants' that are deeply devoted to their families and especially patient with children. They are among the heaviest dog breeds, with some males exceeding 100 kg, and the heaviest dog ever recorded was a Mastiff named Zorba who weighed 156 kg. Their massive, broad head, short muzzle, and deeply wrinkled face give them a noble, somewhat melancholy expression. Mastiffs are natural guardians who rely on their imposing presence and deep bark to deter intruders rather than aggression, preferring to position themselves between their family and any perceived threat.",
    "description_el": "Το Μαστίφ, γνωστό και ως Αγγλικό Μαστίφ, είναι μία από τις παλαιότερες και μεγαλύτερες ράτσες σκύλων στον κόσμο, με τεκμηριωμένη ιστορία που εκτείνεται πάνω από 5.000 χρόνια σε αρχαίους πολιτισμούς συμπεριλαμβανομένων της Βαβυλώνας, της Αιγύπτου και της Ρώμης. Ο ίδιος ο Ιούλιος Καίσαρας περιέγραψε με θαυμασμό τα τεράστια βρετανικά πολεμικά σκυλιά κατά την εισβολή του στη Βρετανία το 55 π.Χ. Παρά αυτή τη σκληρή ιστορική κληρονομιά, τα σύγχρονα Μαστίφ είναι αξιοσημείωτα ήρεμα, ήπια και αξιοπρεπή — βαθιά αφοσιωμένα στις οικογένειές τους και ιδιαίτερα υπομονετικά με τα παιδιά. Είναι ανάμεσα στις βαρύτερες ράτσες, με μερικά αρσενικά να ξεπερνούν τα 100 κιλά, και το βαρύτερο σκυλί που καταγράφηκε ποτέ ήταν ένα Μαστίφ ονόματι Zorba που ζύγιζε 156 κιλά. Το τεράστιο, πλατύ κεφάλι και το βαθιά ζαρωμένο πρόσωπο τους δίνουν ευγενική, κάπως μελαγχολική έκφραση. Τα Μαστίφ είναι φυσικοί φύλακες που βασίζονται στην επιβλητική παρουσία τους αντί στην επιθετικότητα.",
    "characteristics": { "energy": 2, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Mastiffs need moderate daily exercise — short to medium walks of about 30–45 minutes, with the pace adjusted to their preference — but must avoid overheating and strenuous activity, especially in warm weather, due to their brachycephalic build and massive body mass. Their short coat is easy to maintain with weekly brushing, but their facial wrinkles and skin folds require regular cleaning and drying to prevent bacterial infections. They drool extensively — this is an inescapable part of Mastiff ownership, and keeping towels in every room becomes second nature. They are highly prone to obesity, which is one of the most serious health management concerns; strict portion control, measured meals, and limiting treats are critical, as even a few extra kilograms dramatically increase strain on joints, heart, and respiratory system. Puppies grow at an extraordinary rate and require specially formulated large-breed puppy food that controls calcium and phosphorus to prevent developmental bone disease; avoid excessive exercise during growth (up to 18–24 months). Early socialization and training while they are still small enough to manage physically is essential — a 100 kg adult with bad habits is essentially uncontrollable.",
    "care_el": "Τα Μαστίφ χρειάζονται μέτρια καθημερινή άσκηση — σύντομες βόλτες 30–45 λεπτών — αλλά πρέπει να αποφεύγουν υπερθέρμανση και έντονη δραστηριότητα λόγω βραχυκεφαλικής διάπλασης. Το κοντό τρίχωμα είναι εύκολο στη συντήρηση, αλλά οι ρυτίδες του προσώπου απαιτούν τακτικό καθαρισμό. Σταλάζουν εκτενώς — αυτό είναι αναπόφευκτο μέρος της ιδιοκτησίας Μαστίφ. Είναι ιδιαίτερα επιρρεπή στην παχυσαρκία, που είναι μία από τις σοβαρότερες ανησυχίες· αυστηρός έλεγχος μερίδων και περιορισμός λιχουδιών είναι κρίσιμοι. Τα κουτάβια μεγαλώνουν με εξαιρετικό ρυθμό και απαιτούν ειδική διατροφή μεγάλων ρατσών· αποφεύγετε υπερβολική άσκηση κατά την ανάπτυξη (έως 18–24 μήνες). Η πρώιμη κοινωνικοποίηση και εκπαίδευση ενόσω είναι μικρά αρκετά είναι απαραίτητη — ένας ενήλικας 100 κιλών με κακές συνήθειες είναι ουσιαστικά ανεξέλεγκτος.",
    "health_en": "Mastiffs face numerous health challenges primarily related to their extreme size. Hip and elbow dysplasia are very common — OFA screening by breeders is essential, and maintaining a lean body weight is one of the most effective ways to reduce joint stress. Bloat (gastric dilatation-volvulus) is a leading cause of death; prophylactic gastropexy during spay/neuter is increasingly recommended by breed specialists. Dilated cardiomyopathy (DCM) and other cardiac conditions are significant concerns; annual cardiac screening including echocardiography is advised. Osteosarcoma (bone cancer) occurs at elevated rates in giant breeds. Brachycephalic obstructive airway syndrome (BOAS) can cause breathing difficulties and heat intolerance due to their shortened muzzle. Cystinuria, cranial cruciate ligament disease, hypothyroidism, and progressive retinal atrophy have all been reported. Cancer overall is a leading cause of death in the breed. With diligent health management, Mastiffs typically live 6–10 years, with well-bred individuals sometimes reaching the upper end of that range.",
    "health_el": "Τα Μαστίφ αντιμετωπίζουν πολυάριθμες προκλήσεις υγείας κυρίως σχετιζόμενες με το ακραίο μέγεθός τους. Η δυσπλασία ισχίου και αγκώνα είναι πολύ κοινή — ο έλεγχος OFA είναι απαραίτητος. Το φούσκωμα (GDV) είναι κύρια αιτία θανάτου· η προληπτική γαστροπηξία συνιστάται ολοένα περισσότερο. Η διαστολική καρδιομυοπάθεια (DCM) είναι σημαντική ανησυχία· συνιστάται ετήσιος καρδιακός έλεγχος. Το οστεοσάρκωμα εμφανίζεται σε αυξημένα ποσοστά. Το BOAS μπορεί να προκαλέσει αναπνευστικές δυσκολίες λόγω βραχυκεφαλίας. Κυστινουρία, νόσος χιαστών συνδέσμων, υποθυρεοειδισμός και PRA έχουν αναφερθεί. Ο καρκίνος γενικά αποτελεί κύρια αιτία θανάτου. Με επιμελή διαχείριση υγείας, τα Μαστίφ ζουν τυπικά 6–10 χρόνια."
  },
  {
    "id": "miniature-pinscher",
    "slug": "miniature-pinscher",
    "name_en": "Miniature Pinscher",
    "name_el": "Μικροσκοπικός Πίνσερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "small",
    "lifespan": "12-16 years",
    "temperament_en": ["Fearless", "Energetic", "Proud", "Playful", "Alert"],
    "temperament_el": ["Ατρόμητος", "Ενεργητικός", "Περήφανος", "Παιχνιδιάρης", "Επαγρύπνος"],
    "description_en": "The Miniature Pinscher, affectionately known as the 'Min Pin' or 'King of the Toys,' is a small, elegant German breed that predates the Doberman Pinscher by at least 200 years — despite the common misconception that they are miniaturized Dobermans, the two breeds were developed independently. The Min Pin's ancestry likely includes the German Pinscher, Dachshund, and Italian Greyhound. Originally bred in Germany as a ratter in homes and stables, they earned the nickname 'Zwergpinscher' (dwarf pinscher). Miniature Pinschers are fearless, energetic, and proud with a personality far larger than their 3–5 kg frame, strutting with a distinctive high-stepping 'hackney gait' that resembles a tiny prancing horse. They are extraordinarily alert watchdogs that will announce every visitor, delivery person, and suspicious squirrel with authority. Despite their diminutive size, they are athletic, curious, and surprisingly assertive, often taking charge of dogs many times their size. They form strong bonds with their owners but maintain an independent, self-assured attitude that sets them apart from many other toy breeds.",
    "description_el": "Το Μικροσκοπικό Πίνσερ, γνωστό στοργικά ως 'Min Pin' ή 'Βασιλιάς των Toy,' είναι μια μικρή, κομψή γερμανική ράτσα που προϋπάρχει του Ντόμπερμαν Πίνσερ τουλάχιστον 200 χρόνια — παρά τη συνηθισμένη παρανόηση ότι είναι μικρογραφίες Ντόμπερμαν. Η καταγωγή του πιθανόν περιλαμβάνει τον Γερμανικό Πίνσερ, το Dachshund και το Ιταλικό Greyhound. Αρχικά εκτράφηκε στη Γερμανία ως κυνηγός αρουραίων σε σπίτια και σταύλους. Τα Μικροσκοπικά Πίνσερ είναι ατρόμητα, ενεργητικά και περήφανα με προσωπικότητα πολύ μεγαλύτερη από τα 3–5 κιλά τους, βαδίζοντας με χαρακτηριστικό υψηλό βήμα 'hackney gait' που μοιάζει με μικροσκοπικό καμαρωτό άλογο. Είναι εξαιρετικά επαγρύπνους φύλακες που ανακοινώνουν κάθε επισκέπτη με αυθεντία. Παρά το μικρό μέγεθος, είναι αθλητικά, περίεργα και εκπληκτικά δυναμικά, συχνά επιβάλλοντας τη θέση τους σε σκυλιά πολλαπλάσιου μεγέθους. Δημιουργούν ισχυρούς δεσμούς αλλά διατηρούν ανεξάρτητη, αυτοπεπεισμένη στάση.",
    "characteristics": { "energy": 4, "grooming": 1, "friendliness": 4, "trainability": 3, "cost_index": 1 },
    "cost_annual_usd": "$500-800",
    "care_en": "Miniature Pinschers need regular daily exercise and mental stimulation — at least 30–45 minutes of walks, play sessions, and training activities — despite their small size, they are not couch potatoes and can become destructive or excessively vocal if understimulated. Their short, smooth coat is extremely low-maintenance, requiring only occasional brushing with a soft brush or grooming mitt. They are notorious escape artists — they can squeeze through surprisingly small gaps and climb or jump over barriers, so secure fencing and leash vigilance are essential. They feel the cold acutely due to their thin coat and small body mass; a warm dog coat or sweater is recommended in cold weather, and they should not be left outdoors in chilly conditions. Training requires patience and consistency, as Min Pins are intelligent but independent and can be stubborn; positive reinforcement with treats and play works best. They tend to be vocal and may need training to manage excessive barking. Supervise interactions with very young children, as their small size makes them fragile.",
    "care_el": "Τα Μικροσκοπικά Πίνσερ χρειάζονται τακτική καθημερινή άσκηση και νοητική διέγερση — τουλάχιστον 30–45 λεπτά βόλτων, παιχνιδιού και εκπαίδευσης — παρά το μικρό μέγεθος, δεν είναι αδρανή και μπορεί να γίνουν καταστροφικά αν δεν διεγερθούν. Το κοντό, λείο τρίχωμα είναι πολύ χαμηλής συντήρησης. Είναι διαβόητοι δραπέτες — μπορούν να σφηνώσουν μέσα από εκπληκτικά μικρά κενά και να σκαρφαλώσουν πάνω από εμπόδια, επομένως ασφαλής περίφραξη είναι απαραίτητη. Κρυώνουν πολύ λόγω λεπτού τριχώματος· συνιστάται ζεστό παλτό σκύλου τον χειμώνα. Η εκπαίδευση απαιτεί υπομονή καθώς είναι έξυπνα αλλά ανεξάρτητα και πεισματάρικα· η θετική ενίσχυση λειτουργεί καλύτερα. Τείνουν να είναι φωνακλά. Επιβλέπετε τις αλληλεπιδράσεις με πολύ μικρά παιδιά λόγω εύθραυστου μεγέθους.",
    "health_en": "Miniature Pinschers are generally a healthy and long-lived breed, often reaching 12–16 years with proper care. Patellar luxation (slipping kneecaps) is the most common orthopedic concern; choose breeders who screen for this condition. Legg-Calve-Perthes disease, a degeneration of the femoral head that affects the hip joint, can occur in young Min Pins and may require surgical correction. Progressive retinal atrophy (PRA) can lead to gradual vision loss, and genetic testing is available for some forms. Cardiac conditions including mitral valve disease can develop, particularly in older dogs. Hypothyroidism has been reported. Dental disease is a significant concern in toy breeds due to crowded teeth in small jaws — regular dental care including brushing and professional cleanings is essential. Mucopolysaccharidosis (MPS VI) is a rare but serious genetic storage disease that can be tested for. They can be sensitive to cold and prone to injury from jumping off furniture due to their small, fine-boned structure.",
    "health_el": "Τα Μικροσκοπικά Πίνσερ είναι γενικά υγιή και μακρόβια ράτσα, συχνά φτάνοντας 12–16 χρόνια. Η εξάρθρωση επιγονατίδας είναι η πιο κοινή ορθοπεδική ανησυχία· επιλέξτε εκτροφείς που ελέγχουν. Η νόσος Legg-Calve-Perthes μπορεί να εμφανιστεί σε νεαρά Min Pin και μπορεί να απαιτεί χειρουργική διόρθωση. Η PRA μπορεί να οδηγήσει σε σταδιακή απώλεια όρασης και υπάρχει γενετικός έλεγχος. Καρδιακές παθήσεις συμπεριλαμβανομένης νόσου μιτροειδούς βαλβίδας μπορεί να αναπτυχθούν σε ηλικιωμένα σκυλιά. Υποθυρεοειδισμός έχει αναφερθεί. Η νόσος δοντιών είναι σημαντική ανησυχία σε toy ράτσες λόγω συνωστισμού δοντιών — τακτική οδοντιατρική φροντίδα είναι απαραίτητη. Η βλεννοπολυσακχαρίδωση (MPS VI) είναι σπάνια αλλά σοβαρή γενετική νόσος. Μπορεί να είναι ευαίσθητα στο κρύο και επιρρεπή σε τραυματισμούς από πηδήματα λόγω μικρής, λεπτόκοκκης κατασκευής."
  },
  {
    "id": "miniature-schnauzer",
    "slug": "miniature-schnauzer",
    "name_en": "Miniature Schnauzer",
    "name_el": "Μικροσκοπικός Σνάουτσερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Friendly", "Obedient", "Spirited", "Intelligent", "Alert"],
    "temperament_el": ["Φιλικός", "Υπάκουος", "Ζωηρός", "Έξυπνος", "Επαγρύπνος"],
    "description_en": "The Miniature Schnauzer is the smallest of the three Schnauzer breeds, developed in late 19th-century Germany by crossing the Standard Schnauzer with smaller breeds including the Affenpinscher, Poodle, and possibly the Miniature Pinscher to create a compact ratter for farms and homes. They have become one of the most popular small dog breeds worldwide, ranking consistently in the top 20 most registered breeds in many countries. Miniature Schnauzers are instantly recognizable by their distinctive wiry coat, bushy eyebrows, walrus-like mustache, and trademark beard that gives them a wise, distinguished expression. They are friendly, spirited, and remarkably obedient for a terrier-type breed — they love being at the center of family life and are known for their strong attachment to their people. They are intelligent and highly trainable, excelling in obedience, agility, and rally competitions. Unlike many terrier breeds, they generally get along well with other dogs and children when properly socialized, making them one of the most versatile and family-friendly small breeds available. They are hypoallergenic relative to many breeds, as their wiry coat sheds minimally.",
    "description_el": "Το Μικροσκοπικό Σνάουτσερ είναι το μικρότερο από τα τρία ράτσα Σνάουτσερ, που αναπτύχθηκε στα τέλη του 19ου αιώνα στη Γερμανία διασταυρώνοντας το Κανονικό Σνάουτσερ με μικρότερες ράτσες συμπεριλαμβανομένων Αφενπίνσερ, Πούντλ και πιθανώς Μικροσκοπικού Πίνσερ. Έχουν γίνει μία από τις πιο δημοφιλείς μικρές ράτσες παγκοσμίως. Αναγνωρίζονται αμέσως από το χαρακτηριστικό σκληρό τρίχωμα, τα πυκνά φρύδια, το μουστάκι τύπου θαλάσσιου ίππου και τη γενειάδα που τους δίνει σοφή, διακεκριμένη έκφραση. Είναι φιλικά, ζωηρά και αξιοσημείωτα υπάκουα για ράτσα τύπου τεριέ — λατρεύουν να βρίσκονται στο κέντρο της οικογενειακής ζωής. Είναι έξυπνα και εξαιρετικά εκπαιδεύσιμα, διαπρέποντας σε υπακοή και ευκινησία. Σε αντίθεση με πολλές ράτσες τεριέ, τα πάνε γενικά καλά με άλλα σκυλιά και παιδιά. Είναι σχετικά υποαλλεργικά καθώς το σκληρό τρίχωμα πέφτει ελάχιστα.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Miniature Schnauzers need daily exercise and mental stimulation — about 45 minutes to 1 hour of walks, play sessions, and training activities — and they particularly enjoy interactive games and learning new tricks. Their distinctive wiry coat requires regular professional grooming every 6–8 weeks (either hand-stripping for show dogs or clipping for pets), plus brushing two to three times per week at home to prevent matting, especially around the beard and leg furnishings. They can be prone to barking and may need training to manage this tendency, as they take their self-appointed watchdog role seriously. Consistent, positive training from puppyhood prevents small-dog syndrome — they respond exceptionally well to reward-based methods and enjoy the mental challenge of training. Dietary management is particularly important for this breed due to their predisposition to pancreatitis — avoid high-fat foods and table scraps, and stick to a quality, moderate-fat diet. Regular dental care including brushing and professional cleanings helps prevent periodontal disease, which is common in small breeds. They adapt well to various living situations including apartments, provided they receive adequate exercise.",
    "care_el": "Τα Μικροσκοπικά Σνάουτσερ χρειάζονται καθημερινή άσκηση και νοητική διέγερση — περίπου 45 λεπτά έως 1 ώρα βόλτων, παιχνιδιού και εκπαίδευσης — και απολαμβάνουν ιδιαίτερα τα διαδραστικά παιχνίδια. Το χαρακτηριστικό σκληρό τρίχωμα απαιτεί τακτική επαγγελματική περιποίηση κάθε 6–8 εβδομάδες, συν βούρτσισμα δύο έως τρεις φορές την εβδομάδα στο σπίτι. Μπορεί να γαβγίζουν υπερβολικά και χρειάζονται εκπαίδευση. Η σταθερή, θετική εκπαίδευση από κουταβίστικη ηλικία αποτρέπει το σύνδρομο μικρού σκύλου. Η διαχείριση διατροφής είναι ιδιαίτερα σημαντική λόγω προδιάθεσης σε παγκρεατίτιδα — αποφεύγετε λιπαρά τρόφιμα και υπολείμματα τραπεζιού. Τακτική φροντίδα δοντιών βοηθά στην πρόληψη περιοδοντικής νόσου. Προσαρμόζονται καλά σε διάφορες συνθήκες ζωής συμπεριλαμβανομένων διαμερισμάτων.",
    "health_en": "Miniature Schnauzers have a predisposition to pancreatitis (inflammation of the pancreas), often triggered by high-fat meals or dietary indiscretion — maintaining a low-to-moderate fat diet is one of the most important health management strategies for this breed. Hyperlipidemia (elevated blood fats) is common and may contribute to pancreatitis risk; regular blood panels can monitor lipid levels. Urinary stones (particularly struvite and calcium oxalate) are more common in Mini Schnauzers than in most breeds — adequate water intake and potentially a prescription diet may be recommended by your vet. Cataracts (both hereditary juvenile cataracts and age-related) and progressive retinal atrophy (PRA) are eye conditions to watch for; CERF or OFA eye exams are recommended for breeding stock. Myotonia congenita, a condition causing muscle stiffness, has been identified in the breed and a DNA test is available. Comedone syndrome (Schnauzer bumps), a skin condition causing blackheads along the back, is unique to Miniature Schnauzers and is usually manageable. Despite these concerns, they are generally a healthy, robust breed with a typical lifespan of 12–15 years.",
    "health_el": "Τα Μικροσκοπικά Σνάουτσερ έχουν προδιάθεση σε παγκρεατίτιδα (φλεγμονή παγκρέατος), συχνά πυροδοτούμενη από λιπαρά γεύματα — η διατήρηση διατροφής χαμηλών λιπαρών είναι μία από τις σημαντικότερες στρατηγικές διαχείρισης υγείας. Η υπερλιπιδαιμία είναι κοινή και μπορεί να συμβάλει στον κίνδυνο παγκρεατίτιδας· τακτικές εξετάσεις αίματος μπορούν να παρακολουθούν τα λιπίδια. Οι ουρολογικές πέτρες είναι πιο κοινές σε Mini Schnauzers — επαρκής πρόσληψη νερού είναι σημαντική. Καταρράκτης και PRA είναι οφθαλμικές παθήσεις· συνιστώνται οφθαλμολογικές εξετάσεις. Η συγγενής μυοτονία, πάθηση που προκαλεί μυϊκή δυσκαμψία, έχει αναγνωριστεί και υπάρχει τεστ DNA. Το σύνδρομο comedone (σπυράκια Σνάουτσερ), δερματική πάθηση μοναδική στα Μικροσκοπικά Σνάουτσερ, είναι συνήθως διαχειρίσιμο. Παρά αυτές τις ανησυχίες, είναι γενικά υγιή ράτσα με τυπική διάρκεια ζωής 12–15 χρόνια."
  },
  {
    "id": "moscow-watchdog",
    "slug": "moscow-watchdog",
    "name_en": "Moscow Watchdog",
    "name_el": "Μοσχοβίτικος Φύλακας",
    "type": "dog",
    "origin": "Russia",
    "originCode": "RU",
    "images": [],
    "size": "giant",
    "lifespan": "9-11 years",
    "temperament_en": ["Confident", "Loyal", "Calm", "Protective", "Territorial"],
    "temperament_el": ["Σίγουρος", "Πιστός", "Ήρεμος", "Προστατευτικός", "Εδαφικός"],
    "description_en": "The Moscow Watchdog was developed in the Soviet Union during the late 1940s and 1950s at the Red Star Kennel, a state-run military breeding facility, to create the ideal guard dog for Soviet military and government installations. Breeders crossed Caucasian Shepherd Dogs (for fierceness and guarding instinct), Saint Bernards (for size, trainability, and gentleness with handlers), and Russian Spotted Hounds (for stamina and tracking ability). The result is a massive, imposing dog that combines the protective instincts of the Caucasian Shepherd with the more manageable, biddable temperament of the Saint Bernard. Moscow Watchdogs are confident, loyal, and calm with their families — they show genuine affection and gentleness with household members, including children, but are highly territorial and naturally suspicious of strangers. They can weigh 45–70 kg and have a thick, weather-resistant coat in white with red or reddish-brown markings, giving them a Saint Bernard-like appearance but with a more athletic build. The breed remains rare outside of Russia and the former Soviet states, where they continue to serve as guard dogs and family protectors.",
    "description_el": "Ο Μοσχοβίτικος Φύλακας αναπτύχθηκε στη Σοβιετική Ένωση στα τέλη της δεκαετίας του 1940 και 1950 στο κυνοκομείο Red Star, κρατική στρατιωτική εγκατάσταση εκτροφής, για να δημιουργήσει τον ιδανικό φύλακα σκύλο για σοβιετικές στρατιωτικές και κυβερνητικές εγκαταστάσεις. Οι εκτροφείς διασταύρωσαν Καυκάσιους Ποιμενικούς (για αγριότητα και ένστικτο φύλαξης), Σεντ Μπερνάρ (για μέγεθος, εκπαιδευσιμότητα και τρυφερότητα) και Ρωσικά Κηλιδωτά Λαγωνικά (για αντοχή). Το αποτέλεσμα είναι τεράστιος, επιβλητικός σκύλος που συνδυάζει τα προστατευτικά ένστικτα του Καυκάσιου Ποιμενικού με την πιο διαχειρίσιμη ιδιοσυγκρασία του Σεντ Μπερνάρ. Είναι σίγουροι, πιστοί και ήρεμοι με τις οικογένειές τους αλλά εξαιρετικά εδαφικοί με αγνώστους. Μπορεί να ζυγίζουν 45–70 κιλά και έχουν πυκνό, ανθεκτικό τρίχωμα σε λευκό με κόκκινα σημάδια. Η ράτσα παραμένει σπάνια εκτός Ρωσίας όπου συνεχίζουν να υπηρετούν ως φύλακες και οικογενειακοί προστάτες.",
    "characteristics": { "energy": 3, "grooming": 3, "friendliness": 3, "trainability": 3, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Moscow Watchdogs need regular daily exercise — at least 1 to 1.5 hours of walks, patrolling, or moderate activity — and a large, securely fenced property where they can fulfill their natural guarding instincts. Their thick, medium-length double coat requires brushing at least two to three times per week, with daily attention during seasonal shedding when they shed heavily. They need firm, consistent leadership and extensive early socialization with people, other animals, and various environments to channel their guarding instincts appropriately — without proper socialization, they can become overly protective or difficult to manage in normal social situations. They are absolutely not suited to apartment living or homes without significant outdoor space, and they should not be left chained or isolated, as this can increase aggression. Feeding costs for giant breeds are substantial, and diet should support joint health while preventing excessive weight gain. They thrive in homes where they have a clear role as family protectors and are included in household life.",
    "care_el": "Οι Μοσχοβίτικοι Φύλακες χρειάζονται τακτική καθημερινή άσκηση — τουλάχιστον 1 έως 1,5 ώρες βόλτων ή μέτριας δραστηριότητας — και μεγάλη, ασφαλώς περιφραγμένη ιδιοκτησία. Το πυκνό, μεσαίου μήκους διπλό τρίχωμα απαιτεί βούρτσισμα τουλάχιστον δύο έως τρεις φορές την εβδομάδα, με καθημερινή προσοχή κατά τις εποχιακές τριχοπτώσεις. Χρειάζονται σταθερή, συνεπή ηγεσία και εκτενή πρώιμη κοινωνικοποίηση — χωρίς σωστή κοινωνικοποίηση μπορεί να γίνουν υπερβολικά προστατευτικοί. Δεν είναι κατάλληλοι για διαμερίσματα ή σπίτια χωρίς σημαντικό εξωτερικό χώρο. Το κόστος διατροφής για γιγαντιαίες ράτσες είναι σημαντικό. Ευδοκιμούν σε σπίτια με σαφή ρόλο ως οικογενειακοί προστάτες.",
    "health_en": "Moscow Watchdogs may be prone to hip and elbow dysplasia, which is common in large and giant breeds — screening by breeders using OFA or similar protocols is important. Bloat (gastric dilatation-volvulus) is a serious, life-threatening risk in this deep-chested breed; feeding two or three smaller meals, using a slow-feeder bowl, and avoiding exercise around mealtimes are essential precautions. Heart conditions, including dilated cardiomyopathy, have been reported and periodic cardiac checkups are recommended. Their large size makes them susceptible to joint issues and mobility problems as they age, and maintaining a healthy weight through diet and appropriate exercise is one of the most effective preventive measures. Obesity significantly worsens joint and cardiovascular strain. Due to the breed's relatively small gene pool outside of Russia, genetic diversity is a consideration and responsible breeding practices are particularly important. Typical lifespan is about 9–11 years. Regular veterinary checkups and proactive health management support quality of life.",
    "health_el": "Οι Μοσχοβίτικοι Φύλακες μπορεί να εμφανίσουν δυσπλασία ισχίου και αγκώνα — ο έλεγχος από εκτροφείς είναι σημαντικός. Το φούσκωμα (GDV) είναι σοβαρός, απειλητικός κίνδυνος· η σίτιση μικρότερων γευμάτων και η αποφυγή άσκησης γύρω από τα γεύματα είναι απαραίτητες. Καρδιακές παθήσεις συμπεριλαμβανομένης διαστολικής καρδιομυοπάθειας έχουν αναφερθεί. Το μεγάλο μέγεθος τους καθιστά ευάλωτους σε προβλήματα αρθρώσεων και κινητικότητας — η διατήρηση υγιούς βάρους είναι κρίσιμη. Λόγω σχετικά μικρής γονιδιακής βάσης εκτός Ρωσίας, η γενετική ποικιλότητα είναι ζήτημα. Τυπική διάρκεια ζωής περίπου 9–11 χρόνια."
  },
  {
    "id": "neapolitan-mastiff",
    "slug": "neapolitan-mastiff",
    "name_en": "Neapolitan Mastiff",
    "name_el": "Ναπολιτάνικο Μαστίφ",
    "type": "dog",
    "origin": "Italy",
    "originCode": "IT",
    "images": [],
    "size": "giant",
    "lifespan": "7-9 years",
    "temperament_en": ["Loyal", "Calm", "Protective", "Majestic", "Steady"],
    "temperament_el": ["Πιστός", "Ήρεμος", "Προστατευτικός", "Μεγαλοπρεπής", "Σταθερός"],
    "description_en": "The Neapolitan Mastiff (Mastino Napoletano) is one of the most ancient dog breeds, descending directly from the war dogs and arena gladiators of the Roman Empire, with roots tracing back even further to the massive Molossus dogs of ancient Greece. These imposing dogs were bred in southern Italy, particularly around Naples, where they guarded estates, farms, and families for centuries. The Neapolitan Mastiff's most distinctive feature is their abundantly loose, wrinkled skin that hangs in heavy folds and dewlaps, originally developed to protect them during confrontations — the loose skin meant that even if an attacker bit them, their vital organs and muscles would be shielded. They have a massive, broad head, deep-set eyes that give them a somber, almost prehistoric expression, and a powerful, lumbering gait. Neo Mastiffs are deeply loyal, calm, and devoted to their families with an almost intuitive protective instinct — they are naturally suspicious of strangers and will position themselves between their family and any unfamiliar person. Despite their fearsome appearance, they are surprisingly gentle and affectionate with their own people, often leaning their massive weight against their favorite person as a sign of devotion.",
    "description_el": "Το Ναπολιτάνικο Μαστίφ (Mastino Napoletano) είναι μία από τις πιο αρχαίες ράτσες σκύλων, κατάγεται απευθείας από τα πολεμικά σκυλιά και τους μονομάχους της Ρωμαϊκής Αυτοκρατορίας, με ρίζες που ανιχνεύονται ακόμη παλαιότερα στα τεράστια σκυλιά Μολοσσούς της αρχαίας Ελλάδας. Εκτράφηκαν στη νότια Ιταλία, ιδιαίτερα γύρω από τη Νάπολη, όπου φύλαγαν κτήματα και οικογένειες για αιώνες. Το πιο χαρακτηριστικό γνώρισμα είναι το άφθονα χαλαρό, ζαρωμένο δέρμα που κρέμεται σε βαριές πτυχές, αρχικά ανεπτυγμένο για να τους προστατεύει κατά τις αντιπαραθέσεις. Έχουν τεράστιο, πλατύ κεφάλι, βαθιά μάτια που τους δίνουν σκυθρωπή, σχεδόν προϊστορική έκφραση. Είναι βαθιά πιστοί, ήρεμοι και αφοσιωμένοι στις οικογένειές τους με σχεδόν ενστικτώδες προστατευτικό ένστικτο. Παρά την τρομακτική εμφάνιση, είναι εκπληκτικά ήπια και στοργικά με τους δικούς τους, συχνά ακουμπώντας το τεράστιο βάρος τους στο αγαπημένο τους πρόσωπο.",
    "characteristics": { "energy": 2, "grooming": 3, "friendliness": 3, "trainability": 3, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Neapolitan Mastiffs need moderate daily exercise — short walks and gentle play totaling about 30–45 minutes — and must absolutely avoid overheating, as their massive body mass, brachycephalic build, and heavy skin folds make them extremely susceptible to heat stroke. Their numerous facial wrinkles and skin folds require daily inspection and regular cleaning with a damp cloth, followed by thorough drying, to prevent bacterial and yeast infections that can develop in warm, moist skin creases. They drool copiously — this is perhaps the most significant lifestyle consideration, as saliva will be found on walls, furniture, clothing, and guests. They are highly prone to obesity, so strict portion control with a giant-breed diet is essential. Early socialization and obedience training are critical — this must begin in puppyhood while they are still physically manageable, as an unsocialized or untrained adult Neo Mastiff weighing 50–70 kg can present serious management challenges. They need a spacious living environment with cool, well-ventilated areas and should never be left outdoors in warm weather. Air conditioning is practically a requirement for this breed in warm climates.",
    "care_el": "Τα Ναπολιτάνικα Μαστίφ χρειάζονται μέτρια καθημερινή άσκηση — σύντομες βόλτες και ήπιο παιχνίδι 30–45 λεπτών — και πρέπει απολύτως να αποφεύγουν υπερθέρμανση λόγω βραχυκεφαλικής διάπλασης. Οι πολυάριθμες ρυτίδες και πτυχές δέρματος απαιτούν καθημερινό έλεγχο και τακτικό καθαρισμό με υγρό ύφασμα, ακολουθούμενο από ενδελεχές στέγνωμα, για πρόληψη βακτηριακών και μυκητιακών λοιμώξεων. Σταλάζουν πλούσια σάλιο — αυτό είναι ίσως ο σημαντικότερος παράγοντας τρόπου ζωής. Είναι ιδιαίτερα επιρρεπή στην παχυσαρκία. Η πρώιμη κοινωνικοποίηση και εκπαίδευση είναι κρίσιμες — πρέπει να ξεκινήσουν κουταβίστικη ηλικία. Χρειάζονται ευρύχωρο περιβάλλον με δροσερούς, καλά αεριζόμενους χώρους. Ο κλιματισμός είναι πρακτικά απαίτηση σε ζεστά κλίματα.",
    "health_en": "Neapolitan Mastiffs face significant health challenges related to their unique physical structure. Hip and elbow dysplasia are very common — OFA screening is essential for breeding stock. Cherry eye (prolapse of the third eyelid gland), entropion (inward rolling eyelid), and ectropion (outward rolling eyelid) are frequent eye conditions that often require surgical correction. Skin fold dermatitis and pyoderma (bacterial skin infections) in the wrinkles require ongoing management. Bloat (GDV) is a serious, life-threatening risk; prophylactic gastropexy should be discussed with your veterinarian. Dilated cardiomyopathy and other cardiac conditions can occur. Heat stroke is a constant danger in warm weather and requires vigilant management. Hypothyroidism has been reported. Anterior cruciate ligament injuries are not uncommon given their heavy build. Demodicosis (mange) can affect young dogs. Their typical lifespan is about 7–9 years — choosing a health-tested breeder who prioritizes soundness over extreme type is crucial for a healthier, longer-lived companion.",
    "health_el": "Τα Ναπολιτάνικα Μαστίφ αντιμετωπίζουν σημαντικές προκλήσεις υγείας. Η δυσπλασία ισχίου και αγκώνα είναι πολύ κοινή — ο έλεγχος OFA είναι απαραίτητος. Κερασένιο μάτι, εντρόπιον και εκτρόπιον είναι συχνές οφθαλμικές παθήσεις που συχνά απαιτούν χειρουργική. Η δερματίτιδα πτυχών δέρματος απαιτεί συνεχή διαχείριση. Το φούσκωμα (GDV) είναι σοβαρός κίνδυνος· η προληπτική γαστροπηξία πρέπει να συζητηθεί. Καρδιακές παθήσεις μπορεί να εμφανιστούν. Η θερμοπληξία είναι συνεχής κίνδυνος σε ζεστό καιρό. Υποθυρεοειδισμός έχει αναφερθεί. Τραυματισμοί πρόσθιων χιαστών συνδέσμων δεν είναι ασυνήθιστοι. Η δεμοδηκίωση μπορεί να επηρεάσει νεαρά σκυλιά. Τυπική διάρκεια ζωής περίπου 7–9 χρόνια."
  },
  {
    "id": "newfoundland",
    "slug": "newfoundland",
    "name_en": "Newfoundland",
    "name_el": "Νιουφάουντλαντ",
    "type": "dog",
    "origin": "Canada",
    "originCode": "CA",
    "images": [],
    "size": "giant",
    "lifespan": "8-10 years",
    "temperament_en": ["Gentle", "Sweet-tempered", "Patient", "Loyal", "Calm"],
    "temperament_el": ["Ήπιος", "Γλυκός", "Υπομονετικός", "Πιστός", "Ήρεμος"],
    "description_en": "The Newfoundland is a giant working breed from the island of Newfoundland in Canada, where they were developed by fishermen as indispensable working partners for hauling nets, pulling boats to shore, carrying fishing equipment, and — most famously — performing dramatic water rescues of drowning sailors and swimmers. Their natural lifesaving instinct is so well-documented that they have saved countless lives throughout history; the legendary Newfoundland 'Seaman' accompanied the Lewis and Clark expedition across America, and another named 'Rigel' reportedly saved passengers of the Titanic. Newfoundlands possess a thick, water-resistant double coat, large webbed paws that function as natural paddles, and a powerful, broad-chested build that makes them among the strongest swimmers in the canine world. Despite their immense size (males typically weigh 60–70 kg), they are famous for their gentle, sweet-tempered, patient nature — often called 'nature's babysitter' for their exceptional gentleness with children. They come in black, brown, gray, and the distinctive Landseer (black-and-white) pattern. Their calm, dignified demeanor, combined with their intelligence and eagerness to please, makes them outstanding therapy dogs, family companions, and working partners. The Newfoundland is the only breed whose breed standard specifically mentions sweetness of temperament.",
    "description_el": "Το Νιουφάουντλαντ είναι γιγαντιαία εργατική ράτσα από το νησί Newfoundland στον Καναδά, όπου αναπτύχθηκε από ψαράδες ως απαραίτητος εργάτης για έλξη διχτυών, ρυμούλκηση βαρκών στην ακτή και — πιο διάσημα — εκτέλεση δραματικών διασώσεων στο νερό. Το φυσικό ένστικτο διάσωσης τους είναι τόσο τεκμηριωμένο που έχουν σώσει αμέτρητες ζωές· ο θρυλικός Newfoundland 'Seaman' συνόδευσε την αποστολή Lewis και Clark, και ένας ονόματι 'Rigel' φέρεται ότι έσωσε επιβάτες του Τιτανικού. Τα Νιουφάουντλαντ διαθέτουν πυκνό, αδιάβροχο διπλό τρίχωμα, μεγάλα ιστοπόδαρα πόδια που λειτουργούν ως φυσικά κουπιά, και ισχυρή σωματική διάπλαση. Παρά το τεράστιο μέγεθος (τα αρσενικά ζυγίζουν τυπικά 60–70 κιλά), είναι περίφημα για τη ήπια, γλυκιά, υπομονετική φύση τους — συχνά αποκαλούνται «η νταντά της φύσης» για την εξαιρετική τρυφερότητα τους με τα παιδιά. Εμφανίζονται σε μαύρο, καφέ, γκρι και ασπρόμαυρο. Το Νιουφάουντλαντ είναι η μόνη ράτσα της οποίας το πρότυπο αναφέρει ρητά τη γλυκύτητα ιδιοσυγκρασίας.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Newfoundlands need moderate daily exercise — about 1 hour of walks, play, or ideally swimming, which is the breed's most natural and beneficial form of exercise and provides excellent cardiovascular conditioning without stressing joints. Their thick, heavy double coat requires thorough brushing at least two to three times per week to prevent matting, with daily grooming during the intense seasonal shedding periods when they blow their undercoat — a powerful undercoat rake and slicker brush are essential tools. They drool significantly, especially after eating, drinking, or when warm — towels become a standard household accessory. They are very sensitive to heat and must have access to shade, cool areas, and fresh water; air conditioning is essentially required in warm climates. They are prone to obesity, which dramatically worsens joint and cardiac issues, so careful weight management with a giant-breed diet is critical. Puppies grow at an astonishing rate and require large-breed puppy food formulated to control growth speed and prevent developmental bone disease. Early socialization and training while they are still a manageable size is important, though their naturally biddable temperament makes them one of the easier giant breeds to train.",
    "care_el": "Τα Νιουφάουντλαντ χρειάζονται μέτρια καθημερινή άσκηση — περίπου 1 ώρα βόλτων, παιχνιδιού ή ιδανικά κολύμβησης, που είναι η πιο φυσική και ωφέλιμη μορφή άσκησης. Το πυκνό, βαρύ τρίχωμα απαιτεί ενδελεχές βούρτσισμα τουλάχιστον δύο έως τρεις φορές την εβδομάδα, με καθημερινή περιποίηση κατά τις εποχιακές τριχοπτώσεις. Σταλάζουν σημαντικά, ειδικά μετά το φαγητό ή στη ζέστη. Είναι πολύ ευαίσθητα στη ζέστη — κλιματισμός είναι ουσιαστικά απαραίτητος σε ζεστά κλίματα. Είναι επιρρεπή στην παχυσαρκία που επιδεινώνει δραματικά τα προβλήματα αρθρώσεων και καρδιάς. Τα κουτάβια μεγαλώνουν εκπληκτικά γρήγορα και απαιτούν ειδική διατροφή μεγάλων ρατσών. Η πρώιμη κοινωνικοποίηση και εκπαίδευση είναι σημαντικές, αν και η φυσικά υπάκουη ιδιοσυγκρασία τους τους καθιστά μία από τις ευκολότερες γιγαντιαίες ράτσες στην εκπαίδευση.",
    "health_en": "Newfoundlands have several breed-specific health concerns that require awareness and proactive management. Subvalvular aortic stenosis (SAS) is a serious congenital heart condition that is particularly prevalent in the breed — cardiac screening by a veterinary cardiologist (echocardiography) is strongly recommended for all Newfoundlands, and breeding stock should be certified clear. Hip and elbow dysplasia are common in this heavy breed; OFA or PennHIP screening is essential. Cystinuria, a genetic condition causing urinary stones that can lead to life-threatening urinary blockage (primarily in males), has been identified in the breed and a DNA test is available. Bloat (GDV) is a serious risk; prophylactic gastropexy should be discussed with your veterinarian. Cruciate ligament tears are relatively common due to their heavy build. Dilated cardiomyopathy (DCM) occurs alongside SAS as a cardiac concern. Hypothyroidism, osteosarcoma, and epilepsy have been reported. With diligent health management and health-tested breeding, Newfoundlands typically live 8–10 years.",
    "health_el": "Τα Νιουφάουντλαντ έχουν πολλές ειδικές ανησυχίες υγείας. Η υποβαλβιδική αορτική στένωση (SAS) είναι σοβαρή συγγενής καρδιακή πάθηση ιδιαίτερα διαδεδομένη — ο καρδιακός έλεγχος με ηχοκαρδιογράφημα συνιστάται ιδιαίτερα. Η δυσπλασία ισχίου και αγκώνα είναι κοινή· ο έλεγχος OFA ή PennHIP είναι απαραίτητος. Η κυστινουρία, γενετική πάθηση που προκαλεί ουρολογικές πέτρες, έχει αναγνωριστεί και υπάρχει τεστ DNA. Το φούσκωμα (GDV) είναι σοβαρός κίνδυνος· η προληπτική γαστροπηξία πρέπει να συζητηθεί. Οι ρήξεις χιαστών συνδέσμων είναι σχετικά κοινές. Η DCM εμφανίζεται ως καρδιακή ανησυχία. Υποθυρεοειδισμός, οστεοσάρκωμα και επιληψία έχουν αναφερθεί. Με επιμελή διαχείριση υγείας, τα Νιουφάουντλαντ ζουν τυπικά 8–10 χρόνια."
  },
  {
    "id": "perro-de-presa-canario",
    "slug": "perro-de-presa-canario",
    "name_en": "Perro de Presa Canario",
    "name_el": "Πέρο ντε Πρέσα Κανάριο",
    "type": "dog",
    "origin": "Spain",
    "originCode": "ES",
    "images": [],
    "size": "large",
    "lifespan": "9-11 years",
    "temperament_en": ["Calm", "Confident", "Loyal", "Protective", "Strong-willed"],
    "temperament_el": ["Ήρεμος", "Σίγουρος", "Πιστός", "Προστατευτικός", "Ανδρεῖος"],
    "description_en": "The Perro de Presa Canario (Canary Island Catch Dog) is a powerful, large molosser-type breed originating from the Canary Islands of Spain, where they were developed from pre-Hispanic indigenous mastiff-type dogs crossed with English Mastiffs and Bulldogs brought to the islands by settlers. Historically, they served multiple roles: guarding farms and livestock, driving and catching cattle, and unfortunately, dog fighting — a practice that was banned in the 1940s and nearly led to the breed's extinction before dedicated enthusiasts revived it in the 1970s. The Presa Canario is a muscular, confident dog weighing 40–65 kg, with a broad, brachycephalic head, powerful jaws, and a short, coarse coat in fawn or brindle, often with a distinctive black mask. They are calm and self-assured with their families, showing genuine loyalty and affection to those they know, but are naturally wary and assertive with strangers. They require an experienced, responsible owner who understands guardian-type breeds and can provide consistent leadership, extensive socialization, and proper containment. The breed is restricted or banned in several countries and jurisdictions, including the UK, Australia, and parts of the United States — always check local regulations before acquiring one.",
    "description_el": "Το Πέρο ντε Πρέσα Κανάριο (Σκύλος Σύλληψης Καναρίων Νήσων) είναι ισχυρή, μεγάλη ράτσα τύπου molosser με καταγωγή από τα Κανάρια Νησιά της Ισπανίας, όπου αναπτύχθηκε από αυτόχθονα σκυλιά τύπου μαστίφ διασταυρωμένα με Αγγλικά Μαστίφ και Μπουλντόγκ. Ιστορικά εξυπηρέτησαν πολλαπλούς ρόλους: φύλαξη αγροκτημάτων, οδήγηση και σύλληψη βοοειδών. Η απαγόρευση αγώνων σκύλων στη δεκαετία του 1940 σχεδόν οδήγησε στην εξαφάνιση της ράτσας πριν αφοσιωμένοι λάτρεις την αναβιώσουν στη δεκαετία του 1970. Είναι μυώδης, σίγουρος σκύλος 40–65 κιλών, με πλατύ κεφάλι, ισχυρά σαγόνια και κοντό τρίχωμα σε ξανθό ή brindle. Είναι ήρεμοι με τις οικογένειές τους αλλά φυσικά επιφυλακτικοί με αγνώστους. Απαιτούν έμπειρο, υπεύθυνο ιδιοκτήτη. Η ράτσα περιορίζεται ή απαγορεύεται σε πολλές χώρες — ελέγξτε πάντα τους τοπικούς κανονισμούς.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 3, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Presa Canarios need regular daily exercise — about 1 to 1.5 hours of walks, play, or structured activity — and mental stimulation to stay balanced and content. Their short, coarse coat is very easy to maintain with weekly brushing and occasional bathing. They require consistent, firm training from an experienced handler beginning in puppyhood — they are intelligent but can be dominant, and harsh or inconsistent methods can create behavioral problems. Extensive, ongoing socialization with people of all ages, other dogs, and various environments is critical and should continue throughout their lives; an unsocialized Presa can become dangerously aggressive toward strangers or other animals. Secure, high fencing (at least 1.8 meters) with a sturdy gate is absolutely essential — they are territorial and should not be allowed to roam freely. They are not suited to first-time dog owners, apartments, or homes with young children unless the owner has extensive guardian breed experience. Always verify that Presa Canario ownership is legal in your area before acquiring one, as breed-specific legislation exists in many jurisdictions.",
    "care_el": "Τα Πέρο ντε Πρέσα Κανάριο χρειάζονται τακτική καθημερινή άσκηση — περίπου 1 έως 1,5 ώρες βόλτων, παιχνιδιού ή δομημένης δραστηριότητας — και νοητική διέγερση. Το κοντό, σκληρό τρίχωμα είναι πολύ εύκολο στη συντήρηση. Απαιτούν σταθερή, συνεπή εκπαίδευση από έμπειρο χειριστή από κουταβίστικη ηλικία — είναι έξυπνοι αλλά κυρίαρχοι. Εκτενής, συνεχής κοινωνικοποίηση είναι κρίσιμη και πρέπει να συνεχιστεί σε όλη τη ζωή· ένα μη κοινωνικοποιημένο Πρέσα μπορεί να γίνει επικίνδυνα επιθετικό. Ασφαλής, ψηλή περίφραξη (τουλάχιστον 1,8 μέτρο) είναι απολύτως απαραίτητη. Δεν είναι κατάλληλοι για ιδιοκτήτες πρώτης φοράς ή διαμερίσματα. Πάντα επαληθεύστε ότι η ιδιοκτησία είναι νόμιμη στην περιοχή σας.",
    "health_en": "Presa Canarios may be prone to hip and elbow dysplasia — OFA or similar screening by breeders is recommended. Patellar luxation has been reported, particularly in some lines. Demodicosis (demodectic mange), a skin condition caused by Demodex mites, can affect young dogs and may indicate immune system issues. Bloat (gastric dilatation-volvulus) is a risk in large, deep-chested breeds; feeding two or three smaller meals and avoiding exercise around mealtimes are important precautions. Eye conditions including entropion have been documented. Epilepsy has been reported in some lines. As the breed was revived from a relatively small gene pool, genetic diversity can be a concern, making responsible breeding practices especially important. Cardiac screening is recommended. With proper health management, Presa Canarios typically live 9–11 years. Choosing a reputable breeder who health tests for hips, eyes, and cardiac function is strongly advised.",
    "health_el": "Τα Πέρο ντε Πρέσα Κανάριο μπορεί να εμφανίσουν δυσπλασία ισχίου και αγκώνα — ο έλεγχος OFA συνιστάται. Η εξάρθρωση επιγονατίδας έχει αναφερθεί. Η δεμοδηκίωση (δεμοδηκτική ψώρα) μπορεί να επηρεάσει νεαρά σκυλιά. Το φούσκωμα (GDV) είναι κίνδυνος· η σίτιση μικρότερων γευμάτων και η αποφυγή άσκησης γύρω από τα γεύματα είναι σημαντικές. Οφθαλμικές παθήσεις συμπεριλαμβανομένου εντροπίου έχουν τεκμηριωθεί. Επιληψία έχει αναφερθεί. Καθώς η ράτσα αναβίωσε από σχετικά μικρή γονιδιακή βάση, η γενετική ποικιλότητα μπορεί να αποτελεί ανησυχία. Συνιστάται καρδιακός έλεγχος. Τυπική διάρκεια ζωής 9–11 χρόνια."
  },
  {
    "id": "saint-bernard",
    "slug": "saint-bernard",
    "name_en": "Saint Bernard",
    "name_el": "Σεντ Μπερνάρ",
    "type": "dog",
    "origin": "Switzerland",
    "originCode": "CH",
    "images": [],
    "size": "giant",
    "lifespan": "8-10 years",
    "temperament_en": ["Gentle", "Friendly", "Patient", "Loyal", "Calm"],
    "temperament_el": ["Ήπιος", "Φιλικός", "Υπομονετικός", "Πιστός", "Ήρεμος"],
    "description_en": "The Saint Bernard is a giant Swiss breed whose legendary history is inseparable from the Hospice of the Great St. Bernard Pass, a monastery high in the Swiss Alps where monks bred these dogs beginning in the 17th century for alpine rescue work. For over 200 years, Saint Bernards and their monk handlers rescued thousands of travelers lost or buried in snow and avalanches — the most famous individual, Barry, reportedly saved over 40 lives between 1800 and 1812 and is now preserved and displayed at the Natural History Museum of Bern. The iconic image of a Saint Bernard carrying a small barrel of brandy around its neck is a romanticized legend, but the breed's rescue accomplishments are very real. Modern Saint Bernards come in two coat varieties: smooth (short-haired) and rough (long-haired), both featuring a distinctive white base coat with red, mahogany, or brindle markings and the characteristic dark face mask. They are among the largest and heaviest dog breeds, with males weighing 65–120 kg. Despite their enormous size, Saint Bernards are famously gentle, friendly, and patient — they are particularly renowned for their sweet, calm disposition with children and their deep devotion to their families. They are intelligent, eager to please, and have a calm, unflappable temperament that makes them excellent therapy dogs and family companions.",
    "description_el": "Το Σεντ Μπερνάρ είναι γιγαντιαία ελβετική ράτσα, η θρυλική ιστορία της οποίας είναι αδιαχώριστη από το Ξενοδοχείο του Μεγάλου Αγίου Βερνάρδου, μοναστήρι ψηλά στις Ελβετικές Άλπεις όπου οι μοναχοί εκτρέφουν αυτά τα σκυλιά από τον 17ο αιώνα για αλπικές διασώσεις. Για πάνω από 200 χρόνια, τα Σεντ Μπερνάρ και οι μοναχοί χειριστές τους διέσωσαν χιλιάδες ταξιδιώτες — ο πιο διάσημος, ο Barry, φέρεται ότι έσωσε πάνω από 40 ζωές μεταξύ 1800 και 1812. Τα σύγχρονα Σεντ Μπερνάρ εμφανίζονται σε δύο ποικιλίες τριχώματος: λείο (κοντότριχο) και τραχύ (μακρύτριχο), και τα δύο με λευκή βάση με κόκκινα ή brindle σημάδια. Είναι ανάμεσα στις μεγαλύτερες ράτσες, με αρσενικά 65–120 κιλά. Παρά το τεράστιο μέγεθος, είναι περίφημα ήπια, φιλικά και υπομονετικά — ιδιαίτερα γνωστά για τη γλυκιά, ήρεμη διάθεση με τα παιδιά και τη βαθιά αφοσίωση στις οικογένειές τους.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Saint Bernards need moderate daily exercise — about 1 hour of walks and gentle activity — but must avoid overheating, as their massive body mass, thick coat, and somewhat brachycephalic build make them highly vulnerable to heat stroke. Exercise should be limited to the coolest parts of the day during warm weather, and air conditioning is essential in warm climates. Their coat (whether short or long) requires thorough brushing two to three times per week, with daily attention during heavy shedding seasons. They drool heavily and continuously — keeping towels throughout the house and wiping jowls after meals and drinks is part of daily Saint Bernard life. They are significantly prone to obesity, which accelerates joint degeneration and cardiac problems; strict portion control and weight monitoring are among the most important health management practices. Large-breed puppy food that controls growth rate is essential during their rapid puppyhood growth phase, as too-fast growth can cause serious developmental bone disease. Early obedience training and socialization while they are still a manageable size is critical, as they grow enormously fast and an untrained adult weighing 80+ kg is essentially unmanageable.",
    "care_el": "Τα Σεντ Μπερνάρ χρειάζονται μέτρια καθημερινή άσκηση — περίπου 1 ώρα βόλτων και ήπιας δραστηριότητας — αλλά πρέπει να αποφεύγουν υπερθέρμανση. Η άσκηση πρέπει να περιορίζεται στις δροσερές ώρες και ο κλιματισμός είναι απαραίτητος σε ζεστά κλίματα. Το τρίχωμα απαιτεί ενδελεχές βούρτσισμα δύο έως τρεις φορές την εβδομάδα, με καθημερινή προσοχή κατά τις τριχοπτώσεις. Σταλάζουν πολύ και συνεχώς — πετσέτες σε όλο το σπίτι γίνονται μέρος της ζωής. Είναι σημαντικά επιρρεπή στην παχυσαρκία που επιταχύνει τα προβλήματα αρθρώσεων και καρδιάς· αυστηρός έλεγχος μερίδων είναι κρίσιμος. Η ειδική διατροφή κουταβιών μεγάλων ρατσών είναι απαραίτητη κατά τη ραγδαία ανάπτυξη. Η πρώιμη εκπαίδευση ενόσω είναι διαχειρίσιμα είναι κρίσιμη.",
    "health_en": "Saint Bernards face multiple health challenges related to their giant size and rapid growth. Hip and elbow dysplasia are very common — OFA screening is essential, and maintaining a lean body weight is one of the most important measures to reduce joint strain. Bloat (gastric dilatation-volvulus) is a leading cause of death; prophylactic gastropexy during spay/neuter should be strongly considered. Dilated cardiomyopathy (DCM) and other cardiac conditions are significant concerns; periodic cardiac screening is recommended. Osteosarcoma (bone cancer) occurs at elevated rates in giant breeds and typically presents as unexplained lameness in middle-aged dogs. Entropion and ectropion (eyelid rolling inward or outward) are common eye conditions that may require surgical correction. Heat stroke is a serious and constant risk in warm weather — temperatures above 25°C can be dangerous for this breed. Wobbler syndrome and epilepsy have been reported. Osteochondritis dissecans (OCD) can affect young, rapidly growing dogs. Typical lifespan is about 8–10 years with responsible breeding and proper care.",
    "health_el": "Τα Σεντ Μπερνάρ αντιμετωπίζουν πολλαπλές προκλήσεις υγείας. Η δυσπλασία ισχίου και αγκώνα είναι πολύ κοινή — ο έλεγχος OFA είναι απαραίτητος. Το φούσκωμα (GDV) είναι κύρια αιτία θανάτου· η προληπτική γαστροπηξία πρέπει να εξεταστεί σοβαρά. Η DCM και άλλες καρδιακές παθήσεις είναι σημαντικές ανησυχίες· συνιστάται περιοδικός καρδιακός έλεγχος. Το οστεοσάρκωμα εμφανίζεται σε αυξημένα ποσοστά. Εντρόπιον και εκτρόπιον είναι κοινές οφθαλμικές παθήσεις. Η θερμοπληξία είναι σοβαρός κίνδυνος — θερμοκρασίες πάνω από 25°C μπορεί να είναι επικίνδυνες. Σύνδρομο Wobbler και επιληψία έχουν αναφερθεί. Η οστεοχόνδρωση μπορεί να επηρεάσει νεαρά σκυλιά. Τυπική διάρκεια ζωής περίπου 8–10 χρόνια."
  },
  {
    "id": "shar-pei",
    "slug": "shar-pei",
    "name_en": "Shar-Pei",
    "name_el": "Σαρ Πέι",
    "type": "dog",
    "origin": "China",
    "originCode": "CN",
    "images": [],
    "size": "medium",
    "lifespan": "8-12 years",
    "temperament_en": ["Loyal", "Calm", "Independent", "Devoted", "Reserved"],
    "temperament_el": ["Πιστός", "Ήρεμος", "Ανεξάρτητος", "Αφοσιωμένος", "Προφυλακτικός"],
    "description_en": "The Shar-Pei is one of the world's most ancient and distinctive dog breeds, originating in southern China over 2,000 years ago during the Han Dynasty, where they served as all-purpose farm dogs for guarding, herding, hunting wild boar, and unfortunately, dog fighting — their loose, wrinkled skin made them difficult for opponents to grip effectively. The breed's name literally means 'sand skin' in Cantonese, referring to their rough, bristly coat texture. Their most recognizable features are the deep wrinkles covering their body (especially prominent in puppies), the distinctive blue-black or lavender tongue (shared only with the Chow Chow), their small, sunken 'hippopotamus' eyes, and their tiny, folded ears. The Shar-Pei nearly went extinct during China's Communist Revolution when the government imposed heavy taxes on dog ownership, and by the 1970s, they were recognized by the Guinness Book of World Records as the world's rarest dog breed. A Hong Kong breeder named Matgo Law made an urgent appeal to American dog fanciers in 1973, which helped save the breed from extinction. Shar-Peis are loyal, calm, and independent — they form deep bonds with their family but are naturally reserved, even aloof, with strangers, making them instinctive guardians without being unnecessarily aggressive.",
    "description_el": "Το Σαρ Πέι είναι μία από τις πιο αρχαίες και χαρακτηριστικές ράτσες σκύλων στον κόσμο, με καταγωγή από τη νότια Κίνα πάνω από 2.000 χρόνια πριν κατά τη Δυναστεία Χαν, όπου υπηρέτησαν ως πολυχρηστικοί αγροτικοί σκύλοι. Το όνομα σημαίνει κυριολεκτικά «δέρμα άμμου» στα καντονέζικα, αναφερόμενο στο τραχύ, σκληρό τρίχωμα. Τα πιο αναγνωρίσιμα χαρακτηριστικά είναι οι βαθιές ρυτίδες, η χαρακτηριστική μπλε-μαύρη γλώσσα (κοινή μόνο με το Τσόου Τσόου), τα μικρά βυθισμένα μάτια και τα μικροσκοπικά διπλωμένα αυτιά. Το Σαρ Πέι σχεδόν εξαφανίστηκε κατά τη Μαοϊκή Επανάσταση και στη δεκαετία του 1970 αναγνωρίστηκε ως η σπανιότερη ράτσα στον κόσμο. Ένας εκτροφέας στο Χονγκ Κονγκ, ο Matgo Law, έκανε επείγουσα έκκληση σε Αμερικανούς λάτρεις σκύλων το 1973, βοηθώντας να σωθεί η ράτσα. Τα Σαρ Πέι είναι πιστά, ήρεμα και ανεξάρτητα — δημιουργούν βαθιούς δεσμούς με την οικογένεια αλλά είναι φυσικά προφυλακτικά με αγνώστους.",
    "characteristics": { "energy": 3, "grooming": 3, "friendliness": 3, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Shar-Peis need moderate daily exercise — about 45 minutes to 1 hour of walks and play — and are generally calm and well-mannered indoors when their needs are met. Their distinctive skin folds, especially around the face, ears, and body, must be inspected and cleaned regularly (at least weekly, and after baths) with a damp cloth and thoroughly dried to prevent bacterial and yeast infections that thrive in warm, moist creases. Their narrow, tightly folded ear canals require regular monitoring and gentle cleaning to prevent ear infections, which are common in the breed. They can overheat in warm weather due to their wrinkled skin and somewhat brachycephalic build — ensure access to cool, shaded areas. Training a Shar-Pei requires patience and respect for their independent character; they are intelligent but may evaluate commands before deciding to comply, and respond best to positive reinforcement and short, varied training sessions. Early socialization with people, other dogs, and varied environments is critical to prevent excessive suspicion or aggression toward strangers. They may have food sensitivities; a high-quality, limited-ingredient diet can help manage skin and digestive issues. Avoid over-bathing, as it can strip natural skin oils and worsen skin problems.",
    "care_el": "Τα Σαρ Πέι χρειάζονται μέτρια καθημερινή άσκηση — περίπου 45 λεπτά έως 1 ώρα βόλτων και παιχνιδιού. Οι χαρακτηριστικές πτυχές δέρματος πρέπει να ελέγχονται και να καθαρίζονται τακτικά (τουλάχιστον εβδομαδιαία) και να στεγνώνονται ενδελεχώς για πρόληψη βακτηριακών και μυκητιακών λοιμώξεων. Οι στενοί, σφιχτά διπλωμένοι ακουστικοί πόροι απαιτούν τακτικό καθαρισμό για πρόληψη ωτίτιδας. Μπορούν να υπερθερμανθούν σε ζεστό καιρό — εξασφαλίστε δροσερούς χώρους. Η εκπαίδευση απαιτεί υπομονή και σεβασμό για τον ανεξάρτητο χαρακτήρα τους· ανταποκρίνονται καλύτερα σε θετική ενίσχυση. Η πρώιμη κοινωνικοποίηση είναι κρίσιμη. Μπορεί να εμφανίσουν τροφικές ευαισθησίες· υψηλής ποιότητας διατροφή περιορισμένων συστατικών μπορεί να βοηθήσει. Αποφεύγετε υπερβολικά μπάνια.",
    "health_en": "Shar-Peis have a unique health profile with several breed-specific conditions that require awareness. Familial Shar-Pei Fever (FSF), also known as Shar-Pei Autoinflammatory Disease (SPAID), is a hereditary condition causing recurrent episodes of unexplained fever and swollen hocks, and can lead to secondary renal amyloidosis — a potentially fatal accumulation of amyloid protein in the kidneys that can cause kidney failure. This is the most serious health concern in the breed, and a genetic test is available. Their wrinkled skin predisposes them to skin fold dermatitis, pyoderma, and demodicosis; ongoing skin care is a lifelong commitment. Entropion (inward rolling of the eyelids) is extremely common and often requires surgical correction, sometimes as early as puppyhood. Their narrow, folded ear canals make chronic ear infections (otitis) a frequent problem. Hip dysplasia, hypothyroidism, and patellar luxation can occur. Mucinosis (excessive deposits of mucin in the skin) is related to their characteristic wrinkles. Food and environmental allergies are common. With proactive health management and choosing a breeder who tests for FSF/SPAID, Shar-Peis typically live 8–12 years.",
    "health_el": "Τα Σαρ Πέι έχουν μοναδικό προφίλ υγείας με πολλές ειδικές παθήσεις. Ο Οικογενειακός Πυρετός Σαρ Πέι (FSF), γνωστός και ως SPAID, είναι κληρονομική πάθηση που προκαλεί επαναλαμβανόμενα επεισόδια ανεξήγητου πυρετού και μπορεί να οδηγήσει σε νεφρική αμυλοείδωση — δυνητικά θανατηφόρα συσσώρευση πρωτεΐνης στα νεφρά. Υπάρχει γενετικό τεστ. Το ζαρωμένο δέρμα τους προδιαθέτει σε δερματίτιδα πτυχών, πυόδερμα και δεμοδηκίωση. Το εντρόπιον είναι εξαιρετικά κοινό και συχνά απαιτεί χειρουργική. Οι στενοί ακουστικοί πόροι καθιστούν τη χρόνια ωτίτιδα συχνό πρόβλημα. Δυσπλασία ισχίου, υποθυρεοειδισμός και εξάρθρωση επιγονατίδας μπορεί να εμφανιστούν. Η βλεννίνωση σχετίζεται με τις χαρακτηριστικές ρυτίδες. Τροφικές και περιβαλλοντικές αλλεργίες είναι κοινές. Με προληπτική διαχείριση, τα Σαρ Πέι ζουν τυπικά 8–12 χρόνια."
  },
  {
    "id": "spanish-mastiff",
    "slug": "spanish-mastiff",
    "name_en": "Spanish Mastiff",
    "name_el": "Ισπανικό Μαστίφ",
    "type": "dog",
    "origin": "Spain",
    "originCode": "ES",
    "images": [],
    "size": "giant",
    "lifespan": "10-12 years",
    "temperament_en": ["Calm", "Loyal", "Protective", "Gentle", "Independent"],
    "temperament_el": ["Ήρεμος", "Πιστός", "Προστατευτικός", "Ήπιος", "Ανεξάρτητος"],
    "description_en": "The Spanish Mastiff (Mastín Español) is one of the largest dog breeds in the world and Spain's most iconic livestock guardian, developed over many centuries on the Iberian Peninsula to protect merino sheep flocks during the great transhumance migrations — the seasonal movement of enormous flocks numbering thousands of sheep across hundreds of kilometers between summer and winter pastures. For over a thousand years, Spanish Mastiffs have walked alongside shepherds and their flocks through the Castilian plains and mountain passes, defending against wolves, which remain present in parts of Spain to this day. Males can weigh 70–120 kg or more, making them among the heaviest of all dog breeds. They have a thick, medium-length coat in various colors including fawn, brindle, red, black, wolf-sable, and broken colors, often with a distinctive dewlap (loose skin hanging from the neck) that historically protected them from wolf bites. Spanish Mastiffs are calm, noble, and deeply loyal — they possess an almost serene dignity when not provoked but will defend their charges with determination and courage. They are independent thinkers bred to make decisions about threats without human intervention, a trait that requires understanding and respect from their owners.",
    "description_el": "Το Ισπανικό Μαστίφ (Mastín Español) είναι μία από τις μεγαλύτερες ράτσες σκύλων στον κόσμο και ο πιο εμβληματικός φύλακας κοπαδιών της Ισπανίας, αναπτυγμένο σε πολλούς αιώνες στην Ιβηρική Χερσόνησο για προστασία κοπαδιών μερινό προβάτων κατά τις μεγάλες μετακινήσεις μεταξύ θερινών και χειμερινών βοσκοτόπων. Για πάνω από χίλια χρόνια, τα Ισπανικά Μαστίφ βάδιζαν μαζί με βοσκούς και κοπάδια, υπερασπιζόμενα από λύκους που παραμένουν παρόντες σε τμήματα της Ισπανίας. Τα αρσενικά μπορεί να ζυγίζουν 70–120 κιλά ή περισσότερο. Έχουν πυκνό τρίχωμα σε διάφορα χρώματα, συχνά με χαρακτηριστικό χαλαρό δέρμα στον λαιμό που ιστορικά τους προστάτευε από δαγκώματα λύκων. Είναι ήρεμα, ευγενή και βαθιά πιστά — κατέχουν σχεδόν γαλήνια αξιοπρέπεια αλλά υπερασπίζονται τα προστατευόμενά τους με αποφασιστικότητα. Είναι ανεξάρτητοι στο σκέψη, εκτράφηκαν να λαμβάνουν αποφάσεις χωρίς ανθρώπινη παρέμβαση.",
    "characteristics": { "energy": 3, "grooming": 3, "friendliness": 3, "trainability": 3, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Spanish Mastiffs need regular daily exercise and, most importantly, a large, securely fenced rural or semi-rural property where they can patrol and fulfill their deeply ingrained guarding instincts — this breed is designed for wide open spaces, not suburban backyards. Their thick, medium-length coat requires brushing two to three times per week, with more frequent attention during seasonal shedding periods. They need early and ongoing socialization with people and other animals to be manageable in domestic situations — without proper socialization, their natural wariness of strangers can become problematic. Training requires patience and understanding of livestock guardian breed temperament; they are not eager-to-please obedience dogs and will evaluate commands independently. Feeding costs for a dog that can exceed 100 kg are substantial; giant-breed diet formulations that support joint health and prevent obesity are essential. They are prone to weight gain when under-exercised, and obesity dramatically worsens health outcomes for giant breeds. They are nocturnal by nature and will patrol and bark at night — neighbors should be considered.",
    "care_el": "Τα Ισπανικά Μαστίφ χρειάζονται τακτική καθημερινή άσκηση και μεγάλη, ασφαλώς περιφραγμένη αγροτική ή ημιαγροτική ιδιοκτησία. Το πυκνό τρίχωμα απαιτεί βούρτσισμα δύο έως τρεις φορές την εβδομάδα, με συχνότερη προσοχή κατά τις εποχιακές τριχοπτώσεις. Χρειάζονται πρώιμη και συνεχή κοινωνικοποίηση. Η εκπαίδευση απαιτεί υπομονή και κατανόηση — δεν είναι σκύλοι πρόθυμης υπακοής. Το κόστος διατροφής για σκύλο που μπορεί να ξεπεράσει τα 100 κιλά είναι σημαντικό· η διατροφή μεγάλων ρατσών που υποστηρίζει τις αρθρώσεις είναι απαραίτητη. Είναι επιρρεπή σε αύξηση βάρους. Είναι νυχτόβια στη φύση και θα περιπολούν και θα γαβγίζουν τη νύχτα.",
    "health_en": "Spanish Mastiffs are generally robust compared to many giant breeds, benefiting from centuries of working selection that prioritized function over appearance. However, hip and elbow dysplasia are common concerns given their enormous size — OFA or similar screening by breeders is important. Bloat (gastric dilatation-volvulus) is a serious, life-threatening risk in deep-chested giant breeds; feeding two or three smaller meals, using a slow-feeder bowl, and avoiding exercise around mealtimes are essential precautions. Cardiac conditions can occur and periodic screening is recommended. Entropion and ectropion (eyelid conditions) have been reported. Their massive size predisposes them to joint and mobility issues as they age, making weight management and controlled exercise particularly important throughout their lives. Osteosarcoma, while less common than in some other giant breeds, can occur. Growth should be carefully managed during puppyhood with appropriate large-breed diets to prevent developmental orthopedic diseases. With proper care and responsible breeding, Spanish Mastiffs typically live 10–12 years — relatively long for a breed of this size.",
    "health_el": "Τα Ισπανικά Μαστίφ είναι γενικά ανθεκτικά σε σύγκριση με πολλές γιγαντιαίες ράτσες, ωφελούμενα από αιώνες εργατικής επιλογής. Ωστόσο, η δυσπλασία ισχίου και αγκώνα είναι κοινές ανησυχίες — ο έλεγχος OFA είναι σημαντικός. Το φούσκωμα (GDV) είναι σοβαρός κίνδυνος· η σίτιση μικρότερων γευμάτων είναι απαραίτητη. Καρδιακές παθήσεις μπορεί να εμφανιστούν. Εντρόπιον και εκτρόπιον έχουν αναφερθεί. Το τεράστιο μέγεθος τους προδιαθέτει σε προβλήματα αρθρώσεων, καθιστώντας τη διαχείριση βάρους ιδιαίτερα σημαντική. Το οστεοσάρκωμα μπορεί να εμφανιστεί. Η ανάπτυξη πρέπει να διαχειρίζεται προσεκτικά κατά τη νεανική ηλικία. Με σωστή φροντίδα, τα Ισπανικά Μαστίφ ζουν τυπικά 10–12 χρόνια — σχετικά μεγάλη ηλικία για ράτσα αυτού του μεγέθους."
  },
  {
    "id": "standard-schnauzer",
    "slug": "standard-schnauzer",
    "name_en": "Standard Schnauzer",
    "name_el": "Κανονικό Σνάουτσερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "medium",
    "lifespan": "13-16 years",
    "temperament_en": ["Spirited", "Intelligent", "Loyal", "Trainable", "Alert"],
    "temperament_el": ["Ζωηρός", "Έξυπνος", "Πιστός", "Εκπαιδεύσιμος", "Επαγρύπνος"],
    "description_en": "The Standard Schnauzer is the original Schnauzer breed — the prototype from which both the Miniature and Giant Schnauzer were subsequently developed — making it one of the oldest and most historically significant German dog breeds. Dating back to at least the 15th century, Standard Schnauzers appear in works by renowned artists including Albrecht Dürer and Rembrandt, depicted as loyal companions and versatile working dogs. In their native Germany, they served as ratters in homes, stables, and markets, as livestock guardians, cart dogs, and all-purpose farm helpers — their German nickname 'Mittelschnauzer' (middle Schnauzer) reflects their position between the smaller and larger varieties. The breed's name comes from the German word 'Schnauze' (muzzle/snout), referring to their distinctive bearded, whiskered face. Standard Schnauzers are spirited, highly intelligent, and fiercely loyal — they combine the alertness and bravery of a terrier with the trainability and steadiness of a working dog. They are highly trainable, excelling in obedience, agility, tracking, herding, and therapy work, and they approach every task with enthusiasm and determination. They have a distinctive wiry, weather-resistant double coat that comes in solid black or pepper-and-salt (a mix of black and white banded hairs) and is considered hypoallergenic, shedding minimally.",
    "description_el": "Το Κανονικό Σνάουτσερ είναι η αρχική ράτσα Σνάουτσερ — το πρότυπο από το οποίο αναπτύχθηκαν στη συνέχεια και οι δύο ποικιλίες Μικροσκοπικό και Γιγαντιαίο — καθιστώντας το μία από τις παλαιότερες και πιο ιστορικά σημαντικές γερμανικές ράτσες. Χρονολογούμενο τουλάχιστον από τον 15ο αιώνα, εμφανίζεται σε έργα καλλιτεχνών όπως ο Albrecht Dürer και ο Rembrandt. Στην πατρίδα τους τη Γερμανία, υπηρέτησαν ως κυνηγοί αρουραίων, φύλακες ζώων και βοηθοί αγροκτημάτων. Το όνομα προέρχεται από τη γερμανική λέξη «Schnauze» (ρύγχος), αναφερόμενο στο χαρακτηριστικό γενειοφόρο πρόσωπο. Είναι ζωηρά, εξαιρετικά έξυπνα και βαθιά πιστά — συνδυάζουν την εγρήγορση τεριέ με την εκπαιδευσιμότητα εργατικού σκύλου. Είναι εξαιρετικά εκπαιδεύσιμα, διαπρέποντας σε υπακοή, ευκινησία, ιχνηλασία και θεραπεία. Έχουν χαρακτηριστικό σκληρό, ανθεκτικό τρίχωμα σε μαύρο ή πιπέρι-αλάτι, θεωρούμενο υποαλλεργικό.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 4, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Standard Schnauzers need substantial daily exercise and mental stimulation — at least 1 to 1.5 hours of walks, runs, play sessions, or dog sport activities — and they excel when given a job to do, whether that's agility training, obedience work, barn hunt, or tracking. Their distinctive wiry coat requires regular professional grooming every 6–8 weeks (hand-stripping preserves proper coat texture and color for show dogs, while clipping is fine for pets) plus brushing two to three times per week at home, with particular attention to the beard and leg furnishings which can trap food and debris. They are intelligent and learn quickly but can be strong-willed and may test boundaries, so consistent, positive training from an experienced handler works best — they thrive with clear rules and mental challenges. Early socialization with people, other dogs, and various environments is important to develop their naturally balanced, confident temperament. They can be vocal and take their self-appointed watchdog role seriously, which may need management in close-quartered living. They adapt remarkably well to various lifestyles — from active outdoor families to urban apartments — provided they receive adequate exercise and mental engagement.",
    "care_el": "Τα Κανονικά Σνάουτσερ χρειάζονται σημαντική καθημερινή άσκηση και νοητική διέγερση — τουλάχιστον 1 έως 1,5 ώρες βόλτων, τρεξίματος ή αθλημάτων σκύλων — και διαπρέπουν όταν τους δίνεται δουλειά. Το σκληρό τρίχωμα απαιτεί τακτική επαγγελματική περιποίηση κάθε 6–8 εβδομάδες συν βούρτσισμα δύο έως τρεις φορές την εβδομάδα, με ιδιαίτερη προσοχή στη γενειάδα. Είναι έξυπνα και μαθαίνουν γρήγορα αλλά μπορεί να δοκιμάζουν όρια, επομένως σταθερή, θετική εκπαίδευση λειτουργεί καλύτερα. Η πρώιμη κοινωνικοποίηση είναι σημαντική. Μπορεί να είναι φωνακλά και παίρνουν σοβαρά τον αυτοανακηρυχθέντα ρόλο φύλακα. Προσαρμόζονται αξιοσημείωτα σε διάφορους τρόπους ζωής υπό την προϋπόθεση επαρκούς άσκησης.",
    "health_en": "Standard Schnauzers are one of the healthiest medium-sized breeds, with fewer hereditary health issues than many comparable breeds, a testament to centuries of selection for working ability and soundness. Hip dysplasia can occur but is less common than in many breeds of similar size; OFA screening by breeders is still recommended. Eye conditions including cataracts, progressive retinal atrophy (PRA), and retinal dysplasia have been reported; CERF or OFA eye exams are recommended for breeding stock. Hypothyroidism can develop and is manageable with daily medication. Dilated cardiomyopathy has been reported in some lines; cardiac screening may be recommended. Pancreatitis can occur, though at lower rates than in Miniature Schnauzers — a moderate-fat diet is still advisable. Bladder stones have been occasionally reported. Overall, they are a robust, healthy breed with excellent longevity — a typical lifespan of 13–16 years, which is outstanding for a medium-sized dog. Choosing a breeder who health tests for eyes and hips further reduces risk.",
    "health_el": "Τα Κανονικά Σνάουτσερ είναι μία από τις πιο υγιείς μεσαίες ράτσες, με λιγότερα κληρονομικά προβλήματα υγείας. Η δυσπλασία ισχίου μπορεί να εμφανιστεί αλλά είναι λιγότερο κοινή· ο έλεγχος OFA συνιστάται. Οφθαλμικές παθήσεις συμπεριλαμβανομένων καταρράκτη, PRA και δυσπλασίας αμφιβληστροειδούς έχουν αναφερθεί· συνιστώνται οφθαλμολογικές εξετάσεις. Ο υποθυρεοειδισμός μπορεί να αναπτυχθεί και αντιμετωπίζεται με φαρμακευτική αγωγή. Η DCM έχει αναφερθεί σε ορισμένες σειρές. Η παγκρεατίτιδα μπορεί να εμφανιστεί, αν και σε χαμηλότερα ποσοστά από τα Μικροσκοπικά Σνάουτσερ. Γενικά είναι ανθεκτική, υγιή ράτσα με εξαιρετική μακροζωία — τυπική διάρκεια ζωής 13–16 χρόνια, εκπληκτική για μεσαίο σκύλο."
  },
  {
    "id": "tibetan-mastiff",
    "slug": "tibetan-mastiff",
    "name_en": "Tibetan Mastiff",
    "name_el": "Θιβετιανό Μαστίφ",
    "type": "dog",
    "origin": "China",
    "originCode": "CN",
    "images": [],
    "size": "giant",
    "lifespan": "10-12 years",
    "temperament_en": ["Independent", "Reserved", "Loyal", "Protective", "Strong-willed"],
    "temperament_el": ["Ανεξάρτητος", "Προφυλακτικός", "Πιστός", "Προστατευτικός", "Ανδρεῖος"],
    "description_en": "The Tibetan Mastiff (Do-Khyi, meaning 'tied dog' in Tibetan, as they were traditionally tied at the gate during the day and released at night to guard) is one of the most ancient and primitive dog breeds, with DNA studies suggesting it diverged from other domestic dogs approximately 58,000 years ago. Originating from the high-altitude Himalayan region of Tibet, Nepal, and Central Asia, they have guarded Tibetan Buddhist monasteries, nomadic camps, and livestock for thousands of years at altitudes exceeding 4,000 meters, where temperatures can plunge far below freezing. Their massive, luxurious double coat — with a dense, woolly undercoat and a long, coarse outer coat forming an impressive lion-like mane around the neck and shoulders — is specifically adapted to these extreme conditions. Tibetan Mastiffs are large, powerful dogs weighing 45–75 kg or more, with a majestic, somewhat primitive appearance that has led to comparisons with bears and lions. They are fiercely independent, deeply reserved with strangers, and intensely loyal to their family — traits that make them extraordinary natural guardians but challenging pets. The breed gained international notoriety in 2011 when a red Tibetan Mastiff puppy named 'Big Splash' sold in China for 10 million yuan (approximately $1.5 million), though this reflected a speculative luxury pet bubble rather than typical breed pricing. They are primarily nocturnal, becoming most active and alert during nighttime hours — a behavior deeply rooted in their millennia of nighttime guarding duties.",
    "description_el": "Το Θιβετιανό Μαστίφ (Do-Khyi, σημαίνοντας 'δεμένο σκυλί' στα θιβετιανά) είναι μία από τις πιο αρχαίες ράτσες σκύλων, με μελέτες DNA που υποδεικνύουν απόκλιση από άλλα οικόσιτα σκυλιά πριν από περίπου 58.000 χρόνια. Με καταγωγή από την υψηλού υψομέτρου Ιμαλαϊκή περιοχή, φυλάγουν θιβετιανά βουδιστικά μοναστήρια, νομαδικές κατασκηνώσεις και ζώα εδώ και χιλιάδες χρόνια σε υψόμετρα πάνω από 4.000 μέτρα. Το τεράστιο, πλούσιο διπλό τρίχωμα — με πυκνό μάλλινο εσωτερικό και μακρύ εξωτερικό τρίχωμα που σχηματίζει εντυπωσιακή χαίτη — είναι ειδικά προσαρμοσμένο σε αυτές τις ακραίες συνθήκες. Είναι μεγάλα, ισχυρά σκυλιά 45–75 κιλών ή περισσότερο. Είναι βαθιά ανεξάρτητα, προφυλακτικά με αγνώστους και βαθιά πιστά στην οικογένεια. Η ράτσα απέκτησε διεθνή φήμη το 2011 όταν ένα κόκκινο κουτάβι πωλήθηκε στην Κίνα για 10 εκατομμύρια γιουάν. Είναι κυρίως νυχτόβια, γινόμενα πιο ενεργά τη νύχτα — συμπεριφορά βαθιά ριζωμένη σε χιλιετίες νυχτερινής φύλαξης.",
    "characteristics": { "energy": 3, "grooming": 5, "friendliness": 2, "trainability": 2, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Tibetan Mastiffs need regular daily exercise and a large, securely fenced property — tall fencing of at least 1.8 meters is essential, as they are territorial and will attempt to expand their patrol area. Their immense double coat requires extensive grooming: thorough brushing several times per week year-round, escalating to daily during the annual 'coat blow' (typically in late spring) when they shed their entire undercoat in massive quantities over several weeks. They are deeply independent and among the most challenging breeds to train — they were bred for millennia to think for themselves and make autonomous decisions about threats, so they tend to evaluate commands rather than blindly obey, and traditional obedience methods often fail. Training requires patience, respect, and realistic expectations; positive reinforcement and building a trust-based relationship work better than trying to dominate them. They are strongly nocturnal and will bark extensively at night — this deeply ingrained behavior is virtually impossible to eliminate and makes them unsuitable for suburban neighborhoods. They are extremely intolerant of heat and should only be kept in cool or cold climates with air conditioning available in summer. Socialization must begin very early and continue throughout life to prevent excessive wariness that crosses into aggression toward strangers.",
    "care_el": "Τα Θιβετιανά Μαστίφ χρειάζονται τακτική άσκηση και μεγάλη, ασφαλώς περιφραγμένη ιδιοκτησία — ψηλή περίφραξη τουλάχιστον 1,8 μέτρα είναι απαραίτητη. Το τεράστιο διπλό τρίχωμα απαιτεί εκτενή περιποίηση: ενδελεχές βούρτσισμα αρκετές φορές την εβδομάδα, κλιμακούμενο σε καθημερινό κατά τη ετήσια αλλαγή τριχώματος. Είναι βαθιά ανεξάρτητα και ανάμεσα στις πιο δύσκολες ράτσες στην εκπαίδευση — εκτράφηκαν για χιλιετίες να σκέφτονται μόνα τους. Η εκπαίδευση απαιτεί υπομονή, σεβασμό και ρεαλιστικές προσδοκίες· η θετική ενίσχυση λειτουργεί καλύτερα. Είναι νυχτόβια και γαβγίζουν εκτενώς τη νύχτα — αυτή η συμπεριφορά είναι σχεδόν αδύνατο να εξαλειφθεί. Είναι εξαιρετικά μη ανεκτικά στη ζέστη. Η κοινωνικοποίηση πρέπει να ξεκινήσει πολύ νωρίς.",
    "health_en": "Tibetan Mastiffs are generally a robust breed, benefiting from millennia of natural selection in extremely harsh conditions, though they are not without health concerns. Hip and elbow dysplasia can occur, and OFA screening is recommended, though rates are moderate compared to some other large breeds. Hypothyroidism is relatively common in the breed, but standard thyroid values may differ from other breeds because Tibetan Mastiffs naturally have lower thyroid hormone levels — a veterinarian familiar with the breed should interpret results accordingly. Canine inherited demyelinative neuropathy (CIDN), a serious neurological condition affecting puppies, has been identified in some lines. Entropion and ectropion (eyelid conditions) can occur. Autoimmune conditions, including autoimmune hypothyroidism, have been reported. They are extremely susceptible to heat stroke and should never be exercised or kept outdoors in warm temperatures. Skin conditions and ear infections can develop if the coat and ears are not properly maintained. With proper care in an appropriate climate, Tibetan Mastiffs typically live 10–12 years — respectable longevity for a breed of their size.",
    "health_el": "Τα Θιβετιανά Μαστίφ είναι γενικά ανθεκτική ράτσα, ωφελούμενη από χιλιετίες φυσικής επιλογής σε εξαιρετικά σκληρές συνθήκες. Η δυσπλασία ισχίου και αγκώνα μπορεί να εμφανιστεί· ο έλεγχος OFA συνιστάται. Ο υποθυρεοειδισμός είναι σχετικά κοινός, αλλά οι τυπικές τιμές θυρεοειδούς μπορεί να διαφέρουν καθώς τα Θιβετιανά Μαστίφ έχουν φυσικά χαμηλότερα επίπεδα θυρεοειδικών ορμονών. Η CIDN, σοβαρή νευρολογική πάθηση, έχει αναγνωριστεί σε ορισμένες σειρές. Εντρόπιον και εκτρόπιον μπορεί να εμφανιστούν. Αυτοάνοσες παθήσεις έχουν αναφερθεί. Είναι εξαιρετικά ευάλωτα στη θερμοπληξία. Δερματικές παθήσεις και ωτίτιδα μπορεί να αναπτυχθούν χωρίς σωστή περιποίηση. Με σωστή φροντίδα σε κατάλληλο κλίμα, ζουν τυπικά 10–12 χρόνια."
  },
  {
    "id": "tosa-inu",
    "slug": "tosa-inu",
    "name_en": "Tosa Inu",
    "name_el": "Τόσα Ίνου",
    "type": "dog",
    "origin": "Japan",
    "originCode": "JP",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Calm", "Patient", "Loyal", "Fearless", "Reserved"],
    "temperament_el": ["Ήρεμος", "Υπομονετικός", "Πιστός", "Ατρόμητος", "Προφυλακτικός"],
    "description_en": "The Tosa Inu (also called the Tosa Ken, Tosa Token, or Japanese Mastiff) is a rare, large molosser-type breed developed in Japan's Tosa province (modern-day Kochi Prefecture on the island of Shikoku) during the late 19th century specifically for a ritualized form of Japanese dog fighting called 'token' — a tradition modeled on sumo wrestling where dogs compete in a silent, pushing contest rather than the savage fighting associated with Western dog fighting. Japanese breeders crossed the indigenous Shikoku Inu with Western breeds including Mastiffs, Bulldogs, Bull Terriers, Great Danes, Saint Bernards, and German Pointers to create a larger, stronger fighting dog. In Japanese culture, champion Tosas are given elaborate ceremonial aprons and titles, similar to sumo wrestlers. Tosa Inus are remarkably calm, patient, and dignified dogs — they are naturally stoic and rarely bark or vocalize, traits prized in their homeland. With their families, they are deeply loyal, affectionate, and gentle, showing a devotion that can be surprisingly tender for such a powerful dog (males can weigh 45–80 kg). However, they can be reserved or assertive with unfamiliar dogs and people, requiring experienced, responsible ownership. The breed is banned or restricted in numerous countries including the UK, Australia, New Zealand, Denmark, Norway, Iceland, and parts of the United States.",
    "description_el": "Το Τόσα Ίνου (επίσης γνωστό ως Tosa Ken, Tosa Token ή Ιαπωνικό Μαστίφ) είναι σπάνια, μεγάλη ράτσα τύπου molosser που αναπτύχθηκε στην ιαπωνική επαρχία Tosa (σημερινή Kochi) στα τέλη του 19ου αιώνα ειδικά για μια τελετουργική μορφή ιαπωνικών αγώνων σκύλων — παράδοση βασισμένη στο σούμο. Οι Ιάπωνες εκτροφείς διασταύρωσαν το ιθαγενές Shikoku Inu με δυτικές ράτσες συμπεριλαμβανομένων Μαστίφ, Μπουλντόγκ, Great Danes και Σεντ Μπερνάρ. Στην ιαπωνική κουλτούρα, οι πρωταθλητές Tosa λαμβάνουν περίτεχνες τελετουργικές ποδιές και τίτλους, παρόμοια με παλαιστές σούμο. Τα Τόσα Ίνου είναι αξιοσημείωτα ήρεμα, υπομονετικά και αξιοπρεπή — φυσικά στωικά και σπάνια γαβγίζουν. Με τις οικογένειές τους είναι βαθιά πιστά, στοργικά και ήπια. Ωστόσο, μπορεί να είναι προφυλακτικά ή δυναμικά με άγνωστα σκυλιά και ανθρώπους. Η ράτσα απαγορεύεται ή περιορίζεται σε πολυάριθμες χώρες συμπεριλαμβανομένων ΗΒ, Αυστραλίας, Νέας Ζηλανδίας, Δανίας, Νορβηγίας και τμημάτων των ΗΠΑ.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 3, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Tosa Inus need regular daily exercise — about 1 to 1.5 hours of walks and moderate activity — and mental stimulation to stay balanced and content; despite their size, they are not hyperactive and tend to be calm and composed indoors. Their short, dense coat is very easy to maintain with weekly brushing and occasional bathing. They require extensive, ongoing socialization from a very early age — exposure to diverse people, dogs, animals, environments, and situations is critical to developing a stable, manageable adult, as undersocialized Tosas can become unpredictably reactive or aggressive. Consistent, firm (but never harsh) training from an experienced handler is essential; they are intelligent but can be willful, and they respond best to calm, confident leadership. Secure, tall fencing (at least 1.8 meters) is absolutely necessary, and they should always be kept on a strong leash in public. They should never be left unsupervised with unfamiliar dogs. Always verify that Tosa Inu ownership is legal in your jurisdiction before acquiring one — breed-specific legislation is widespread.",
    "care_el": "Τα Τόσα Ίνου χρειάζονται τακτική καθημερινή άσκηση — περίπου 1 έως 1,5 ώρες βόλτων και μέτριας δραστηριότητας — και νοητική διέγερση· παρά το μέγεθός τους, δεν είναι υπερκινητικά και τείνουν να είναι ήρεμα στο εσωτερικό. Το κοντό, πυκνό τρίχωμα είναι πολύ εύκολο στη συντήρηση. Απαιτούν εκτενή, συνεχή κοινωνικοποίηση από πολύ μικρή ηλικία — η έκθεση σε ποικίλους ανθρώπους, σκυλιά και καταστάσεις είναι κρίσιμη. Σταθερή, σταθερή (αλλά ποτέ σκληρή) εκπαίδευση από έμπειρο χειριστή είναι απαραίτητη. Ασφαλής, ψηλή περίφραξη (τουλάχιστον 1,8 μέτρο) είναι απολύτως αναγκαία και πρέπει πάντα να κρατούνται σε ισχυρό λουρί σε δημόσιους χώρους. Δεν πρέπει ποτέ να αφήνονται χωρίς επίβλεψη με άγνωστα σκυλιά. Πάντα επαληθεύστε ότι η ιδιοκτησία είναι νόμιμη.",
    "health_en": "Tosa Inus are generally a fairly robust breed, though their large size and molosser heritage bring some health considerations. Hip and elbow dysplasia can occur — OFA screening by breeders is recommended. Bloat (gastric dilatation-volvulus) is a serious risk in large, deep-chested breeds; feeding two or three smaller meals, using a slow-feeder bowl, and avoiding exercise around mealtimes are important preventive measures. Heart conditions, including dilated cardiomyopathy, have been reported and periodic cardiac screening is advisable. Eye conditions including entropion and cherry eye can occur. Hypothyroidism has been documented. Allergies and skin conditions can develop. Due to the breed's relatively small gene pool outside Japan, genetic diversity is a consideration, and responsible breeding practices are particularly important. With proper care, Tosa Inus typically live 10–12 years. Choosing a reputable breeder who conducts health testing for hips, heart, and eyes is strongly recommended.",
    "health_el": "Τα Τόσα Ίνου είναι γενικά αρκετά ανθεκτική ράτσα, αν και το μεγάλο μέγεθος φέρνει ορισμένες ανησυχίες υγείας. Η δυσπλασία ισχίου και αγκώνα μπορεί να εμφανιστεί — ο έλεγχος OFA συνιστάται. Το φούσκωμα (GDV) είναι σοβαρός κίνδυνος· η σίτιση μικρότερων γευμάτων και η αποφυγή άσκησης γύρω από τα γεύματα είναι σημαντικά μέτρα. Καρδιακές παθήσεις συμπεριλαμβανομένης DCM έχουν αναφερθεί· συνιστάται περιοδικός καρδιακός έλεγχος. Οφθαλμικές παθήσεις συμπεριλαμβανομένων εντροπίου και κερασένιου ματιού μπορεί να εμφανιστούν. Υποθυρεοειδισμός έχει τεκμηριωθεί. Αλλεργίες και δερματικές παθήσεις μπορεί να αναπτυχθούν. Λόγω σχετικά μικρής γονιδιακής βάσης εκτός Ιαπωνίας, οι υπεύθυνες πρακτικές εκτροφής είναι σημαντικές. Με σωστή φροντίδα, ζουν τυπικά 10–12 χρόνια."
  }
]
