[
  {
    "id": "labrador-retriever",
    "slug": "labrador-retriever",
    "name_en": "Labrador Retriever",
    "name_el": "Λαμπραντόρ Ρετρίβερ",
    "type": "dog",
    "origin": "Canada",
    "originCode": "CA",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Friendly", "Active", "Outgoing", "Gentle", "Intelligent"],
    "temperament_el": ["Φιλικός", "Δραστήριος", "Κοινωνικός", "Ήπιος", "Έξυπνος"],
    "description_en": "The Labrador Retriever is one of the most popular dog breeds in the world, beloved for their friendly, outgoing nature and remarkable versatility. Originally bred in Newfoundland to help fishermen retrieve nets and catch, Labs have evolved into exceptional family companions, service dogs, search and rescue workers, and hunting partners. Their intelligence, combined with an eager-to-please attitude, makes them highly trainable for virtually any task. Labs come in three colors: black, yellow, and chocolate, each equally charming and capable.",
    "description_el": "Το Λαμπραντόρ Ρετρίβερ είναι μία από τις πιο δημοφιλείς ράτσες σκύλων στον κόσμο, αγαπημένη για τη φιλική, εξωστρεφή φύση και την αξιοσημείωτη ευελιξία της. Αρχικά εκτράφηκε στη Νέα Γη για να βοηθά τους ψαράδες να ανασύρουν δίχτυα και ψάρια, τα Λαμπραντόρ έχουν εξελιχθεί σε εξαιρετικούς οικογενειακούς συντρόφους, σκύλους υπηρεσίας, εργάτες έρευνας και διάσωσης, και συντρόφους κυνηγιού. Η ευφυΐα τους, σε συνδυασμό με τη διάθεση να ευχαριστούν, τα καθιστά εξαιρετικά εκπαιδεύσιμα για σχεδόν κάθε εργασία. Τα Λαμπραντόρ έρχονται σε τρία χρώματα: μαύρο, κίτρινο και σοκολατί, το καθένα εξίσου γοητευτικό και ικανό.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Labrador Retrievers require plenty of daily exercise - at least 1-2 hours of activity including walks, runs, swimming, or fetch games. They are natural swimmers and thrive with access to water. Their double coat sheds moderately year-round and heavily during seasonal changes, requiring weekly brushing. Labs are prone to obesity, so careful portion control and limiting treats is essential. Mental stimulation through training, puzzle toys, and interactive play helps prevent boredom-related behaviors. Early socialization and obedience training are highly recommended.",
    "care_el": "Τα Λαμπραντόρ Ρετρίβερ χρειάζονται πολλή καθημερινή άσκηση - τουλάχιστον 1-2 ώρες δραστηριότητας συμπεριλαμβανομένων βόλτων, τρεξίματος, κολύμβησης ή παιχνιδιών ανάκτησης. Είναι φυσικοί κολυμβητές και ευδοκιμούν με πρόσβαση σε νερό. Το διπλό τρίχωμά τους αλλάζει μέτρια όλο το χρόνο και έντονα κατά τις εποχιακές αλλαγές, απαιτώντας εβδομαδιαίο βούρτσισμα. Τα Λαμπραντόρ είναι επιρρεπή στην παχυσαρκία, επομένως ο προσεκτικός έλεγχος μερίδων και ο περιορισμός των λιχουδιών είναι απαραίτητος. Η νοητική διέγερση μέσω εκπαίδευσης, παιχνιδιών παζλ και διαδραστικού παιχνιδιού βοηθά στην πρόληψη συμπεριφορών που σχετίζονται με την πλήξη.",
    "health_en": "Labrador Retrievers are generally healthy but can be prone to several conditions. Hip and elbow dysplasia are common concerns, so choosing a reputable breeder who screens for these conditions is important. They may also develop progressive retinal atrophy (PRA), exercise-induced collapse (EIC), and obesity-related issues. Regular veterinary checkups, maintaining a healthy weight, and appropriate exercise help ensure a long, healthy life. Some Labs may also experience ear infections due to their floppy ears trapping moisture.",
    "health_el": "Τα Λαμπραντόρ Ρετρίβερ είναι γενικά υγιή αλλά μπορεί να είναι επιρρεπή σε αρκετές παθήσεις. Η δυσπλασία ισχίου και αγκώνα είναι συχνές ανησυχίες, επομένως η επιλογή αξιόπιστου εκτροφέα που ελέγχει για αυτές τις παθήσεις είναι σημαντική. Μπορεί επίσης να αναπτύξουν προοδευτική ατροφία αμφιβληστροειδούς (PRA), κατάρρευση προκαλούμενη από άσκηση (EIC) και προβλήματα που σχετίζονται με την παχυσαρκία. Οι τακτικοί κτηνιατρικοί έλεγχοι, η διατήρηση υγιούς βάρους και η κατάλληλη άσκηση βοηθούν να εξασφαλιστεί μια μακρά, υγιής ζωή. Ορισμένα Λαμπραντόρ μπορεί επίσης να εμφανίσουν λοιμώξεις αυτιών λόγω των χαμηλωμένων αυτιών τους που παγιδεύουν υγρασία."
  },
  {
    "id": "german-shepherd",
    "slug": "german-shepherd",
    "name_en": "German Shepherd",
    "name_el": "Γερμανικός Ποιμενικός",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "large",
    "lifespan": "9-13 years",
    "temperament_en": ["Loyal", "Confident", "Courageous", "Intelligent", "Watchful"],
    "temperament_el": ["Πιστός", "Σίγουρος", "Θαρραλέος", "Έξυπνος", "Επαγρύπνος"],
    "description_en": "The German Shepherd is one of the world's most versatile and capable working dogs, excelling in police work, military service, search and rescue, and as guide dogs for the visually impaired. Developed in Germany in the late 19th century by Captain Max von Stephanitz, the breed was created to be the ultimate herding and working dog. German Shepherds are known for their intelligence, which ranks among the highest of all dog breeds, and their unwavering loyalty to their families. They form deep bonds with their owners and are naturally protective without being aggressive.",
    "description_el": "Ο Γερμανικός Ποιμενικός είναι ένας από τους πιο ευέλικτους και ικανούς σκύλους εργασίας στον κόσμο, διαπρέποντας στην αστυνομική εργασία, τη στρατιωτική υπηρεσία, την έρευνα και διάσωση, και ως σκύλοι-οδηγοί για τα άτομα με προβλήματα όρασης. Αναπτύχθηκε στη Γερμανία στα τέλη του 19ου αιώνα από τον Λοχαγό Max von Stephanitz, η ράτσα δημιουργήθηκε για να είναι ο απόλυτος ποιμενικός και εργατικός σκύλος. Οι Γερμανικοί Ποιμενικοί είναι γνωστοί για τη νοημοσύνη τους, που κατατάσσεται ανάμεσα στις υψηλότερες όλων των ρατσών σκύλων, και την ακλόνητη αφοσίωσή τους στις οικογένειές τους. Δημιουργούν βαθιούς δεσμούς με τους ιδιοκτήτες τους και είναι φυσικά προστατευτικοί χωρίς να είναι επιθετικοί.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 3, "trainability": 5, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "German Shepherds require significant daily exercise and mental stimulation - at least 2 hours of activity is recommended. They excel at obedience training, agility, tracking, and protection sports. Their double coat sheds heavily, especially during spring and fall 'blowing coat' seasons, requiring frequent brushing (daily during heavy shedding periods). Early socialization is crucial to develop a well-adjusted adult dog. They thrive with a job to do and can become destructive or develop behavioral issues if understimulated. Consistent, positive training methods work best with this intelligent breed.",
    "care_el": "Οι Γερμανικοί Ποιμενικοί απαιτούν σημαντική καθημερινή άσκηση και νοητική διέγερση - συνιστώνται τουλάχιστον 2 ώρες δραστηριότητας. Διαπρέπουν στην εκπαίδευση υπακοής, την ευκινησία, την ιχνηλασία και τα αθλήματα προστασίας. Το διπλό τρίχωμά τους αλλάζει έντονα, ειδικά κατά τη διάρκεια της άνοιξης και του φθινοπώρου, απαιτώντας συχνό βούρτσισμα (καθημερινά κατά τις περιόδους έντονης αλλαγής τριχώματος). Η πρώιμη κοινωνικοποίηση είναι κρίσιμη για την ανάπτυξη ενός καλά προσαρμοσμένου ενήλικου σκύλου. Ευδοκιμούν με μια δουλειά να κάνουν και μπορεί να γίνουν καταστροφικοί ή να αναπτύξουν προβλήματα συμπεριφοράς αν δεν διεγερθούν επαρκώς.",
    "health_en": "German Shepherds may be prone to hip and elbow dysplasia, which are hereditary conditions affecting joint development. Degenerative myelopathy, a progressive spinal cord disease, is another concern in the breed. They may also develop bloat (gastric dilatation-volvulus), which is a life-threatening emergency requiring immediate veterinary care. Regular health screenings, maintaining proper weight, and avoiding excessive exercise during puppyhood can help prevent some issues. Working with a reputable breeder who tests for genetic conditions is strongly recommended.",
    "health_el": "Οι Γερμανικοί Ποιμενικοί μπορεί να είναι επιρρεπείς σε δυσπλασία ισχίου και αγκώνα, που είναι κληρονομικές παθήσεις που επηρεάζουν την ανάπτυξη των αρθρώσεων. Η εκφυλιστική μυελοπάθεια, μια προοδευτική νόσος του νωτιαίου μυελού, είναι επίσης ανησυχία στη ράτσα. Μπορεί επίσης να αναπτύξουν φούσκωμα (γαστρική διάταση-συστροφή), που είναι επείγουσα κατάσταση απειλητική για τη ζωή που απαιτεί άμεση κτηνιατρική φροντίδα. Οι τακτικοί έλεγχοι υγείας, η διατήρηση σωστού βάρους και η αποφυγή υπερβολικής άσκησης κατά τη διάρκεια της κουταβίστικης ηλικίας μπορούν να βοηθήσουν στην πρόληψη ορισμένων προβλημάτων."
  },
  {
    "id": "golden-retriever",
    "slug": "golden-retriever",
    "name_en": "Golden Retriever",
    "name_el": "Γκόλντεν Ρετρίβερ",
    "type": "dog",
    "origin": "Scotland",
    "originCode": "GB",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Friendly", "Reliable", "Trustworthy", "Kind", "Confident"],
    "temperament_el": ["Φιλικός", "Αξιόπιστος", "Έμπιστος", "Καλόκαρδος", "Σίγουρος"],
    "description_en": "The Golden Retriever is one of the most beloved dog breeds worldwide, cherished for their gentle temperament, intelligence, and stunning golden coat. Developed in the Scottish Highlands in the mid-19th century by Lord Tweedmouth, Goldens were bred to retrieve waterfowl during hunting. Today, they excel as family companions, therapy dogs, service animals, and search and rescue workers. Their patient, tolerant nature makes them exceptional with children, and their eagerness to please makes training a joy. Golden Retrievers maintain their puppy-like enthusiasm well into adulthood.",
    "description_el": "Το Γκόλντεν Ρετρίβερ είναι μία από τις πιο αγαπημένες ράτσες σκύλων παγκοσμίως, αγαπημένη για την ήπια ιδιοσυγκρασία, τη νοημοσύνη και το εκπληκτικό χρυσό τρίχωμά της. Αναπτύχθηκε στα σκωτσέζικα υψίπεδα στα μέσα του 19ου αιώνα από τον Λόρδο Tweedmouth, τα Γκόλντεν εκτράφηκαν για να ανακτούν υδρόβια πτηνά κατά το κυνήγι. Σήμερα, διαπρέπουν ως οικογενειακοί σύντροφοι, σκύλοι θεραπείας, ζώα υπηρεσίας και εργάτες έρευνας και διάσωσης. Η υπομονετική, ανεκτική φύση τους τα καθιστά εξαιρετικά με τα παιδιά, και η διάθεσή τους να ευχαριστούν κάνει την εκπαίδευση χαρά. Τα Γκόλντεν Ρετρίβερ διατηρούν τον ενθουσιασμό τους σαν κουτάβια μέχρι την ενηλικίωση.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Golden Retrievers need regular exercise - at least 1-2 hours daily of walking, running, swimming, or playing fetch. They are natural swimmers and usually love water activities. Their beautiful double coat requires regular brushing (2-3 times per week, daily during shedding seasons) to prevent matting and manage shedding. Goldens are highly food-motivated, which aids training but also means weight management is important. They thrive on human companionship and should not be left alone for extended periods. Regular ear cleaning helps prevent infections.",
    "care_el": "Τα Γκόλντεν Ρετρίβερ χρειάζονται τακτική άσκηση - τουλάχιστον 1-2 ώρες καθημερινά περπάτημα, τρέξιμο, κολύμβηση ή παιχνίδι. Είναι φυσικοί κολυμβητές και συνήθως λατρεύουν τις υδάτινες δραστηριότητες. Το όμορφο διπλό τρίχωμά τους απαιτεί τακτικό βούρτσισμα (2-3 φορές την εβδομάδα, καθημερινά κατά τις εποχές αλλαγής τριχώματος) για να αποφευχθούν οι κόμποι και να διαχειριστεί η τριχόπτωση. Τα Γκόλντεν είναι πολύ παρακινημένα από το φαγητό, που βοηθά στην εκπαίδευση αλλά σημαίνει επίσης ότι η διαχείριση βάρους είναι σημαντική. Ευδοκιμούν με την ανθρώπινη συντροφιά και δεν πρέπει να αφήνονται μόνα για παρατεταμένες περιόδους.",
    "health_en": "Golden Retrievers unfortunately have a higher incidence of certain cancers, including hemangiosarcoma and lymphoma, compared to other breeds. Hip and elbow dysplasia are also concerns, as are heart conditions like subvalvular aortic stenosis. Progressive retinal atrophy and cataracts may affect their vision. Regular veterinary checkups, maintaining a healthy weight, and choosing a breeder who screens for genetic conditions can help ensure the healthiest possible pet. Some research suggests that delaying spaying/neutering may reduce cancer risk.",
    "health_el": "Τα Γκόλντεν Ρετρίβερ δυστυχώς έχουν υψηλότερη επίπτωση ορισμένων καρκίνων, συμπεριλαμβανομένου του αιμαγγειοσαρκώματος και του λεμφώματος, σε σύγκριση με άλλες ράτσες. Η δυσπλασία ισχίου και αγκώνα είναι επίσης ανησυχίες, όπως και οι καρδιακές παθήσεις όπως η υποβαλβιδική αορτική στένωση. Η προοδευτική ατροφία αμφιβληστροειδούς και ο καταρράκτης μπορεί να επηρεάσουν την όρασή τους. Οι τακτικοί κτηνιατρικοί έλεγχοι, η διατήρηση υγιούς βάρους και η επιλογή εκτροφέα που ελέγχει για γενετικές παθήσεις μπορούν να βοηθήσουν στην εξασφάλιση του πιο υγιούς δυνατού κατοικίδιου."
  },
  {
    "id": "bulldog",
    "slug": "bulldog",
    "name_en": "Bulldog",
    "name_el": "Μπουλντόγκ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "8-10 years",
    "temperament_en": ["Docile", "Willful", "Friendly", "Gregarious", "Calm"],
    "temperament_el": ["Πειθήνιος", "Πεισματάρης", "Φιλικός", "Κοινωνικός", "Ήρεμος"],
    "description_en": "The Bulldog, also known as the English Bulldog, is a medium-sized breed known for its distinctive wrinkled face, pushed-in nose, and muscular build. Despite their somewhat intimidating appearance, Bulldogs are gentle, affectionate companions that form strong bonds with their families. Originally bred for bull-baiting in 13th century England, modern Bulldogs have been bred for companionship and have a much calmer temperament. They are known for their patience with children and their ability to adapt well to apartment living due to their lower exercise needs.",
    "description_el": "Το Μπουλντόγκ, γνωστό και ως Αγγλικό Μπουλντόγκ, είναι μια μεσαίου μεγέθους ράτσα γνωστή για το χαρακτηριστικό ζαρωμένο πρόσωπο, την πλακωμένη μύτη και τη μυώδη σωματική διάπλαση. Παρά την κάπως επιβλητική εμφάνισή τους, τα Μπουλντόγκ είναι ήπιοι, στοργικοί σύντροφοι που δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους. Αρχικά εκτράφηκαν για μάχες με ταύρους στην Αγγλία του 13ου αιώνα, τα σύγχρονα Μπουλντόγκ έχουν εκτραφεί για συντροφιά και έχουν πολύ πιο ήρεμη ιδιοσυγκρασία. Είναι γνωστά για την υπομονή τους με τα παιδιά και την ικανότητά τους να προσαρμόζονται καλά στη διαβίωση σε διαμέρισμα λόγω των χαμηλότερων αναγκών τους σε άσκηση.",
    "characteristics": { "energy": 2, "grooming": 2, "friendliness": 4, "trainability": 3, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Bulldogs require moderate exercise - short daily walks are sufficient, but they should avoid strenuous activity, especially in hot or humid weather. Their brachycephalic (flat-faced) structure makes them prone to overheating and breathing difficulties. Facial wrinkles must be cleaned regularly (daily is ideal) to prevent skin infections. They may snore, drool, and have flatulence. Bulldogs are sensitive to temperature extremes and should be kept in climate-controlled environments. Weight management is crucial as obesity worsens their breathing issues.",
    "care_el": "Τα Μπουλντόγκ χρειάζονται μέτρια άσκηση - σύντομες καθημερινές βόλτες είναι αρκετές, αλλά πρέπει να αποφεύγουν την έντονη δραστηριότητα, ειδικά σε ζεστό ή υγρό καιρό. Η βραχυκεφαλική (επίπεδο πρόσωπο) δομή τους τα καθιστά επιρρεπή σε υπερθέρμανση και αναπνευστικές δυσκολίες. Οι ρυτίδες του προσώπου πρέπει να καθαρίζονται τακτικά (το ιδανικό είναι καθημερινά) για να αποφευχθούν δερματικές λοιμώξεις. Μπορεί να ροχαλίζουν, να σταλάζουν σάλιο και να έχουν μετεωρισμό. Τα Μπουλντόγκ είναι ευαίσθητα στα ακραία θερμοκρασίας και πρέπει να διατηρούνται σε κλιματιζόμενα περιβάλλοντα. Η διαχείριση βάρους είναι κρίσιμη καθώς η παχυσαρκία επιδεινώνει τα αναπνευστικά τους προβλήματα.",
    "health_en": "Bulldogs face several health challenges primarily related to their brachycephalic anatomy. Brachycephalic Obstructive Airway Syndrome (BOAS) causes breathing difficulties and exercise intolerance. They are prone to hip dysplasia, cherry eye, skin fold dermatitis, and allergies. Heat stroke is a serious risk due to their inability to cool themselves efficiently. Many Bulldogs require cesarean sections for breeding due to their large heads and narrow hips. Regular veterinary care and choosing a responsible breeder who prioritizes health over extreme features is essential.",
    "health_el": "Τα Μπουλντόγκ αντιμετωπίζουν αρκετές υγειονομικές προκλήσεις που σχετίζονται κυρίως με τη βραχυκεφαλική ανατομία τους. Το Σύνδρομο Βραχυκεφαλικής Απόφραξης Αεραγωγών (BOAS) προκαλεί αναπνευστικές δυσκολίες και δυσανεξία στην άσκηση. Είναι επιρρεπείς σε δυσπλασία ισχίου, κερασί στο μάτι, δερματίτιδα δερματικών πτυχών και αλλεργίες. Η θερμοπληξία είναι σοβαρός κίνδυνος λόγω της αδυναμίας τους να δροσίζονται αποτελεσματικά. Πολλά Μπουλντόγκ απαιτούν καισαρική τομή για αναπαραγωγή λόγω των μεγάλων κεφαλιών και των στενών ισχίων τους. Η τακτική κτηνιατρική φροντίδα και η επιλογή υπεύθυνου εκτροφέα που δίνει προτεραιότητα στην υγεία είναι απαραίτητη."
  },
  {
    "id": "beagle",
    "slug": "beagle",
    "name_en": "Beagle",
    "name_el": "Μπιγκλ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Merry", "Friendly", "Curious", "Determined", "Gentle"],
    "temperament_el": ["Χαρούμενος", "Φιλικός", "Περίεργος", "Αποφασιστικός", "Ήπιος"],
    "description_en": "The Beagle is a small to medium-sized hound known for its exceptional sense of smell and tracking instinct. Originally bred in England for hunting rabbits and hare, Beagles are now popular family pets known for their merry disposition and friendly nature. Their compact size, short easy-care coat, and generally good health make them excellent companions. Beagles are pack animals and get along well with other dogs and children. They are curious explorers who follow their noses everywhere, which can sometimes lead them into mischief.",
    "description_el": "Το Μπιγκλ είναι ένα μικρό έως μεσαίου μεγέθους κυνηγόσκυλο γνωστό για την εξαιρετική αίσθηση της όσφρησης και το ένστικτο ιχνηλασίας. Αρχικά εκτράφηκε στην Αγγλία για κυνήγι κουνελιών και λαγών, τα Μπιγκλ είναι τώρα δημοφιλή οικογενειακά κατοικίδια γνωστά για τη χαρούμενη διάθεση και τη φιλική φύση τους. Το συμπαγές μέγεθός τους, το κοντό εύκολο στη φροντίδα τρίχωμα και η γενικά καλή υγεία τους τα καθιστούν εξαιρετικούς συντρόφους. Τα Μπιγκλ είναι ζώα αγέλης και τα πάνε καλά με άλλα σκυλιά και παιδιά. Είναι περίεργοι εξερευνητές που ακολουθούν τη μύτη τους παντού, κάτι που μερικές φορές μπορεί να τα οδηγήσει σε σκανδαλιές.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 3, "cost_index": 1 },
    "cost_annual_usd": "$500-800",
    "care_en": "Beagles need daily exercise - at least an hour of walking, running, or play. Their strong scent drive means they should always be on a leash or in a securely fenced area, as they will follow interesting scents without regard for traffic or boundaries. Their short coat is easy to maintain with weekly brushing. Beagles are food-motivated, which helps with training but means treats should be counted as part of their daily calories to prevent obesity. They can be vocal and may howl, which is worth considering for apartment dwellers.",
    "care_el": "Τα Μπιγκλ χρειάζονται καθημερινή άσκηση - τουλάχιστον μία ώρα περπάτημα, τρέξιμο ή παιχνίδι. Η ισχυρή οσφρητική τους τάση σημαίνει ότι πρέπει πάντα να είναι σε λουρί ή σε ασφαλώς περιφραγμένη περιοχή, καθώς θα ακολουθήσουν ενδιαφέρουσες μυρωδιές χωρίς να λαμβάνουν υπόψη την κυκλοφορία ή τα όρια. Το κοντό τρίχωμά τους είναι εύκολο στη συντήρηση με εβδομαδιαίο βούρτσισμα. Τα Μπιγκλ παρακινούνται από το φαγητό, που βοηθά στην εκπαίδευση αλλά σημαίνει ότι οι λιχουδιές πρέπει να υπολογίζονται ως μέρος των καθημερινών θερμίδων τους για να αποφευχθεί η παχυσαρκία. Μπορεί να είναι φωνακλά και μπορεί να ουρλιάζουν, κάτι που αξίζει να ληφθεί υπόψη για όσους μένουν σε διαμέρισμα.",
    "health_en": "Beagles are generally healthy dogs but may be prone to certain conditions. Epilepsy is seen in some lines and can usually be managed with medication. Hypothyroidism and intervertebral disc disease may occur. Their floppy ears require regular cleaning to prevent infections. Cherry eye and glaucoma are occasional eye concerns. Beagles are prone to obesity, so diet management is essential. Musladin-Lueke Syndrome is a rare genetic condition specific to Beagles. Working with a reputable breeder and maintaining regular veterinary care helps ensure a healthy pet.",
    "health_el": "Τα Μπιγκλ είναι γενικά υγιή σκυλιά αλλά μπορεί να είναι επιρρεπή σε ορισμένες παθήσεις. Η επιληψία εμφανίζεται σε ορισμένες σειρές και συνήθως μπορεί να διαχειριστεί με φαρμακευτική αγωγή. Ο υποθυρεοειδισμός και η μεσοσπονδύλια δισκοπάθεια μπορεί να εμφανιστούν. Τα χαμηλωμένα αυτιά τους απαιτούν τακτικό καθαρισμό για να αποφευχθούν λοιμώξεις. Το κερασί στο μάτι και το γλαύκωμα είναι περιστασιακές ανησυχίες για τα μάτια. Τα Μπιγκλ είναι επιρρεπή στην παχυσαρκία, οπότε η διαχείριση της διατροφής είναι απαραίτητη. Το Σύνδρομο Musladin-Lueke είναι μια σπάνια γενετική πάθηση ειδική για τα Μπιγκλ. Η συνεργασία με αξιόπιστο εκτροφέα και η διατήρηση τακτικής κτηνιατρικής φροντίδας βοηθά στην εξασφάλιση ενός υγιούς κατοικίδιου."
  },
  {
    "id": "poodle",
    "slug": "poodle",
    "name_en": "Poodle",
    "name_el": "Κανίς",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Intelligent", "Active", "Alert", "Faithful", "Trainable"],
    "temperament_el": ["Έξυπνος", "Δραστήριος", "Επαγρύπνος", "Πιστός", "Εκπαιδεύσιμος"],
    "description_en": "The Poodle is one of the most intelligent dog breeds, known for its distinctive curly coat and elegant appearance. Despite common misconceptions, Poodles were originally bred in Germany as water retrievers, not as fancy lap dogs. They come in three sizes (Standard, Miniature, and Toy) and various colors. Poodles are highly versatile, excelling in obedience, agility, hunting, and as service dogs. Their hypoallergenic coat makes them popular among allergy sufferers, though they require regular professional grooming to maintain their appearance.",
    "description_el": "Το Κανίς είναι μία από τις πιο έξυπνες ράτσες σκύλων, γνωστή για το χαρακτηριστικό σγουρό τρίχωμα και την κομψή εμφάνισή της. Παρά τις συνήθεις παρανοήσεις, τα Κανίς αρχικά εκτράφηκαν στη Γερμανία ως υδάτινοι ανακτητές, όχι ως φανταχτεροί σκύλοι αγκαλιάς. Έρχονται σε τρία μεγέθη (Standard, Miniature και Toy) και διάφορα χρώματα. Τα Κανίς είναι εξαιρετικά ευέλικτα, διαπρέποντας στην υπακοή, την ευκινησία, το κυνήγι και ως σκύλοι υπηρεσίας. Το υποαλλεργικό τρίχωμά τους τα καθιστά δημοφιλή μεταξύ αυτών που πάσχουν από αλλεργίες, αν και απαιτούν τακτική επαγγελματική περιποίηση για να διατηρήσουν την εμφάνισή τους.",
    "characteristics": { "energy": 4, "grooming": 5, "friendliness": 4, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Poodles require regular professional grooming every 4-6 weeks to maintain their coat, which grows continuously like human hair. Daily brushing prevents matting between grooming appointments. They need daily mental stimulation as their high intelligence means they can become bored easily. Standard Poodles need more exercise than Miniature or Toy varieties. They excel at dog sports and enjoy learning new tricks. Poodles are social dogs that bond closely with their families and may develop separation anxiety if left alone frequently.",
    "care_el": "Τα Κανίς απαιτούν τακτική επαγγελματική περιποίηση κάθε 4-6 εβδομάδες για να διατηρήσουν το τρίχωμά τους, που μεγαλώνει συνεχώς όπως τα ανθρώπινα μαλλιά. Το καθημερινό βούρτσισμα αποτρέπει τους κόμπους μεταξύ των ραντεβού περιποίησης. Χρειάζονται καθημερινή νοητική διέγερση καθώς η υψηλή νοημοσύνη τους σημαίνει ότι μπορούν να βαρεθούν εύκολα. Τα Standard Κανίς χρειάζονται περισσότερη άσκηση από τις ποικιλίες Miniature ή Toy. Διαπρέπουν στα αθλήματα σκύλων και απολαμβάνουν να μαθαίνουν νέα κόλπα. Τα Κανίς είναι κοινωνικά σκυλιά που δένονται στενά με τις οικογένειές τους και μπορεί να αναπτύξουν άγχος αποχωρισμού αν αφήνονται συχνά μόνα.",
    "health_en": "Poodles may be prone to hip dysplasia, particularly in Standard Poodles. Progressive retinal atrophy (PRA) can affect their vision, and reputable breeders screen for this condition. Addison's disease, bloat (in Standards), and sebaceous adenitis are other concerns. Toy and Miniature Poodles may experience patellar luxation and Legg-Calve-Perthes disease. Ear infections can occur due to hair growth in the ear canal. Regular veterinary care and genetic testing help ensure a healthy pet.",
    "health_el": "Τα Κανίς μπορεί να είναι επιρρεπή σε δυσπλασία ισχίου, ιδιαίτερα στα Standard Κανίς. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) μπορεί να επηρεάσει την όρασή τους, και οι αξιόπιστοι εκτροφείς ελέγχουν για αυτή την κατάσταση. Η νόσος του Addison, το φούσκωμα (στα Standard) και η σμηγματογόνος αδενίτιδα είναι άλλες ανησυχίες. Τα Toy και Miniature Κανίς μπορεί να εμφανίσουν εξάρθρωση επιγονατίδας και νόσο Legg-Calve-Perthes. Λοιμώξεις αυτιών μπορεί να εμφανιστούν λόγω ανάπτυξης τριχών στον ακουστικό πόρο. Η τακτική κτηνιατρική φροντίδα και ο γενετικός έλεγχος βοηθούν στην εξασφάλιση ενός υγιούς κατοικίδιου."
  },
  {
    "id": "rottweiler",
    "slug": "rottweiler",
    "name_en": "Rottweiler",
    "name_el": "Ροτβάιλερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "large",
    "lifespan": "8-10 years",
    "temperament_en": ["Loyal", "Confident", "Protective", "Calm", "Courageous"],
    "temperament_el": ["Πιστός", "Σίγουρος", "Προστατευτικός", "Ήρεμος", "Θαρραλέος"],
    "description_en": "The Rottweiler is a powerful, confident breed with ancient Roman origins, where they were used to drive cattle and pull carts for butchers in the German town of Rottweil. Today, Rottweilers serve as police dogs, service animals, therapy dogs, and devoted family guardians. Despite their intimidating appearance, well-bred and properly socialized Rottweilers are calm, confident companions who are deeply loyal to their families. They are naturally protective without being aggressive and are known for their intelligence and trainability.",
    "description_el": "Το Ροτβάιλερ είναι μια ισχυρή, σίγουρη ράτσα με αρχαία ρωμαϊκή καταγωγή, όπου χρησιμοποιούνταν για να οδηγούν βοοειδή και να σέρνουν καρότσες για τους κρεοπώλες στη γερμανική πόλη Rottweil. Σήμερα, τα Ροτβάιλερ υπηρετούν ως αστυνομικοί σκύλοι, ζώα υπηρεσίας, σκύλοι θεραπείας και αφοσιωμένοι οικογενειακοί φύλακες. Παρά την επιβλητική εμφάνισή τους, τα καλά εκτρεφόμενα και σωστά κοινωνικοποιημένα Ροτβάιλερ είναι ήρεμοι, σίγουροι σύντροφοι που είναι βαθιά πιστοί στις οικογένειές τους. Είναι φυσικά προστατευτικοί χωρίς να είναι επιθετικοί και είναι γνωστοί για τη νοημοσύνη και την εκπαιδευσιμότητά τους.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 3, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Rottweilers need firm, consistent training from puppyhood, using positive reinforcement methods. Early socialization is crucial to develop a well-adjusted adult dog. They require at least 1-2 hours of daily exercise, including mental stimulation through training and puzzle toys. Their short double coat sheds moderately and needs weekly brushing. Rottweilers are people-oriented and should not be isolated in a backyard. They thrive with a job to do and excel at obedience, tracking, and protection sports. A securely fenced yard is recommended.",
    "care_el": "Τα Ροτβάιλερ χρειάζονται σταθερή, συνεπή εκπαίδευση από κουταβάκια, χρησιμοποιώντας μεθόδους θετικής ενίσχυσης. Η πρώιμη κοινωνικοποίηση είναι κρίσιμη για την ανάπτυξη ενός καλά προσαρμοσμένου ενήλικου σκύλου. Απαιτούν τουλάχιστον 1-2 ώρες καθημερινής άσκησης, συμπεριλαμβανομένης της νοητικής διέγερσης μέσω εκπαίδευσης και παιχνιδιών παζλ. Το κοντό διπλό τρίχωμά τους αλλάζει μέτρια και χρειάζεται εβδομαδιαίο βούρτσισμα. Τα Ροτβάιλερ είναι προσανατολισμένα στους ανθρώπους και δεν πρέπει να απομονώνονται σε μια αυλή. Ευδοκιμούν με μια δουλειά να κάνουν και διαπρέπουν στην υπακοή, την ιχνηλασία και τα αθλήματα προστασίας. Συνιστάται ασφαλώς περιφραγμένη αυλή.",
    "health_en": "Rottweilers may be prone to hip and elbow dysplasia, which are hereditary conditions that reputable breeders screen for. Aortic stenosis (a heart condition) and osteosarcoma (bone cancer) are concerns in the breed. They may also develop bloat (gastric dilatation-volvulus), a life-threatening emergency. Cruciate ligament injuries can occur due to their size and activity level. Maintaining proper weight and avoiding excessive exercise during puppyhood helps protect their joints. Regular veterinary checkups and health screening are recommended.",
    "health_el": "Τα Ροτβάιλερ μπορεί να είναι επιρρεπή σε δυσπλασία ισχίου και αγκώνα, που είναι κληρονομικές παθήσεις για τις οποίες οι αξιόπιστοι εκτροφείς κάνουν έλεγχο. Η αορτική στένωση (καρδιακή πάθηση) και το οστεοσάρκωμα (καρκίνος των οστών) είναι ανησυχίες στη ράτσα. Μπορεί επίσης να αναπτύξουν φούσκωμα (γαστρική διάταση-συστροφή), μια απειλητική για τη ζωή επείγουσα κατάσταση. Τραυματισμοί χιαστού συνδέσμου μπορεί να εμφανιστούν λόγω του μεγέθους και του επιπέδου δραστηριότητάς τους. Η διατήρηση σωστού βάρους και η αποφυγή υπερβολικής άσκησης κατά τη διάρκεια της κουταβίστικης ηλικίας βοηθά στην προστασία των αρθρώσεών τους."
  },
  {
    "id": "yorkshire-terrier",
    "slug": "yorkshire-terrier",
    "name_en": "Yorkshire Terrier",
    "name_el": "Γιόρκσαϊρ Τεριέ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "small",
    "lifespan": "13-16 years",
    "temperament_en": ["Feisty", "Affectionate", "Sprightly", "Bold", "Confident"],
    "temperament_el": ["Ζωηρός", "Στοργικός", "Ζωντανός", "Τολμηρός", "Σίγουρος"],
    "description_en": "The Yorkshire Terrier, affectionately called the Yorkie, is a small breed with a big personality. Developed in 19th century Yorkshire, England, to catch rats in clothing mills, today's Yorkies are beloved companion dogs. Despite their tiny size (typically 4-7 pounds), they are bold, confident terriers with an adventurous spirit. Their beautiful, silky coat is similar to human hair and comes in the distinctive blue and tan coloring. Yorkies are devoted to their owners and make excellent watchdogs, always alert to their surroundings.",
    "description_el": "Το Γιόρκσαϊρ Τεριέ, στοργικά αποκαλούμενο Γιόρκι, είναι μια μικρή ράτσα με μεγάλη προσωπικότητα. Αναπτύχθηκε στο Γιόρκσαϊρ της Αγγλίας του 19ου αιώνα για να πιάνει αρουραίους σε υφαντουργεία, τα σημερινά Γιόρκι είναι αγαπημένοι σκύλοι συντροφιάς. Παρά το μικροσκοπικό τους μέγεθος (τυπικά 2-3 κιλά), είναι τολμηρά, σίγουρα τεριέ με περιπετειώδες πνεύμα. Το όμορφο, μεταξένιο τρίχωμά τους είναι παρόμοιο με τα ανθρώπινα μαλλιά και έρχεται στο χαρακτηριστικό μπλε και ταν χρωματισμό. Τα Γιόρκι είναι αφοσιωμένα στους ιδιοκτήτες τους και είναι εξαιρετικοί φύλακες, πάντα σε εγρήγορση για το περιβάλλον τους.",
    "characteristics": { "energy": 4, "grooming": 5, "friendliness": 4, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Yorkshire Terriers require daily brushing if kept in a long coat, or can be trimmed short (puppy cut) for easier maintenance. Their fine, silky hair is prone to tangling and matting. Regular professional grooming every 4-6 weeks is recommended. Dental care is especially important as small breeds are prone to dental disease - daily tooth brushing is ideal. Yorkies have moderate exercise needs and adapt well to apartment living. They should be protected from very cold weather due to their small size. Early socialization prevents timidity or excessive barking.",
    "care_el": "Τα Γιόρκσαϊρ Τεριέ απαιτούν καθημερινό βούρτσισμα αν διατηρούνται με μακρύ τρίχωμα, ή μπορούν να κουρευτούν κοντά (κούρεμα κουταβιού) για ευκολότερη συντήρηση. Το λεπτό, μεταξένιο τρίχωμά τους είναι επιρρεπές σε μπερδέματα και κόμπους. Συνιστάται τακτική επαγγελματική περιποίηση κάθε 4-6 εβδομάδες. Η οδοντική φροντίδα είναι ιδιαίτερα σημαντική καθώς οι μικρές ράτσες είναι επιρρεπείς σε οδοντικές νόσους - το καθημερινό βούρτσισμα δοντιών είναι ιδανικό. Τα Γιόρκι έχουν μέτριες ανάγκες άσκησης και προσαρμόζονται καλά στη διαβίωση σε διαμέρισμα. Πρέπει να προστατεύονται από πολύ κρύο καιρό λόγω του μικρού τους μεγέθους. Η πρώιμη κοινωνικοποίηση αποτρέπει τη δειλία ή το υπερβολικό γαύγισμα.",
    "health_en": "Yorkshire Terriers may experience dental problems due to their small mouths, making regular dental care essential. Patellar luxation (slipping kneecaps) and Legg-Calve-Perthes disease (hip joint deterioration) are common concerns. Collapsed trachea can cause a characteristic honking cough. Hypoglycemia (low blood sugar) can affect toy breeds, especially puppies. Progressive retinal atrophy may affect vision. Their small size makes them fragile - falls or rough handling can cause injuries. Liver shunts are occasionally seen in the breed.",
    "health_el": "Τα Γιόρκσαϊρ Τεριέ μπορεί να αντιμετωπίσουν οδοντικά προβλήματα λόγω του μικρού στόματός τους, καθιστώντας την τακτική οδοντική φροντίδα απαραίτητη. Η εξάρθρωση επιγονατίδας (ολισθαίνουσες επιγονατίδες) και η νόσος Legg-Calve-Perthes (εκφύλιση άρθρωσης ισχίου) είναι συχνές ανησυχίες. Η κατάρρευση τραχείας μπορεί να προκαλέσει χαρακτηριστικό βήχα σαν κόρνα. Η υπογλυκαιμία (χαμηλό σάκχαρο αίματος) μπορεί να επηρεάσει τις ράτσες παιχνιδιού, ειδικά τα κουτάβια. Η προοδευτική ατροφία αμφιβληστροειδούς μπορεί να επηρεάσει την όραση. Το μικρό τους μέγεθος τα καθιστά εύθραυστα - πτώσεις ή τραχύς χειρισμός μπορεί να προκαλέσει τραυματισμούς. Ηπατικά shunts εμφανίζονται περιστασιακά στη ράτσα."
  },
  {
    "id": "boxer",
    "slug": "boxer",
    "name_en": "Boxer",
    "name_el": "Μπόξερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Playful", "Loyal", "Bright", "Active", "Fun-Loving"],
    "temperament_el": ["Παιχνιδιάρης", "Πιστός", "Έξυπνος", "Δραστήριος", "Διασκεδαστικός"],
    "description_en": "The Boxer is a muscular, medium-to-large breed known for its playful nature, boundless energy, and deep devotion to family. Developed in Germany from the now-extinct Bullenbeisser and English Bulldogs, Boxers were originally used for hunting large game. Today, they are beloved family companions, excellent with children, and serve as therapy dogs and service animals. Boxers are known for their characteristic 'boxing' play style, standing on hind legs and pawing. They maintain puppy-like playfulness well into adulthood.",
    "description_el": "Το Μπόξερ είναι μια μυώδη, μεσαίου έως μεγάλου μεγέθους ράτσα γνωστή για την παιχνιδιάρικη φύση, την ανεξάντλητη ενέργεια και τη βαθιά αφοσίωσή της στην οικογένεια. Αναπτύχθηκε στη Γερμανία από το πλέον εξαφανισμένο Bullenbeisser και Αγγλικά Μπουλντόγκ, τα Μπόξερ χρησιμοποιούνταν αρχικά για κυνήγι μεγάλων θηραμάτων. Σήμερα, είναι αγαπημένοι οικογενειακοί σύντροφοι, εξαιρετικοί με τα παιδιά, και υπηρετούν ως σκύλοι θεραπείας και ζώα υπηρεσίας. Τα Μπόξερ είναι γνωστά για το χαρακτηριστικό στυλ παιχνιδιού 'πυγμαχίας', στέκονται στα πίσω πόδια και χτυπούν με τα μπροστινά. Διατηρούν την παιχνιδιάρικη διάθεση σαν κουτάβια μέχρι την ενηλικίωση.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Boxers need significant daily exercise - at least 1-2 hours of activity including walks, runs, and playtime. They are excellent companions for active families and enjoy dog sports like agility. Their short coat requires minimal grooming - weekly brushing is sufficient. Boxers are brachycephalic and don't tolerate extreme heat well, so exercise should be limited during hot weather. They are people-oriented dogs that thrive on family interaction and may develop separation anxiety if left alone frequently. Early socialization and positive training are recommended.",
    "care_el": "Τα Μπόξερ χρειάζονται σημαντική καθημερινή άσκηση - τουλάχιστον 1-2 ώρες δραστηριότητας συμπεριλαμβανομένων βόλτων, τρεξίματος και παιχνιδιού. Είναι εξαιρετικοί σύντροφοι για δραστήριες οικογένειες και απολαμβάνουν αθλήματα σκύλων όπως η ευκινησία. Το κοντό τρίχωμά τους απαιτεί ελάχιστη περιποίηση - το εβδομαδιαίο βούρτσισμα είναι αρκετό. Τα Μπόξερ είναι βραχυκεφαλικά και δεν ανέχονται καλά την ακραία ζέστη, οπότε η άσκηση πρέπει να περιορίζεται κατά τη διάρκεια ζεστού καιρού. Είναι σκύλοι προσανατολισμένοι στους ανθρώπους που ευδοκιμούν με την οικογενειακή αλληλεπίδραση και μπορεί να αναπτύξουν άγχος αποχωρισμού αν αφήνονται συχνά μόνοι. Συνιστάται η πρώιμη κοινωνικοποίηση και η θετική εκπαίδευση.",
    "health_en": "Boxers may be prone to certain health conditions including heart problems such as boxer cardiomyopathy and aortic stenosis. They have a higher-than-average incidence of certain cancers including mast cell tumors and lymphoma. Hip dysplasia, hypothyroidism, and degenerative myelopathy may also occur. Bloat (gastric dilatation-volvulus) is a concern in deep-chested breeds. Their brachycephalic structure can contribute to breathing difficulties in extreme heat. Regular veterinary checkups and awareness of breed-specific health issues help ensure early detection and treatment.",
    "health_el": "Τα Μπόξερ μπορεί να είναι επιρρεπή σε ορισμένες υγειονομικές παθήσεις συμπεριλαμβανομένων καρδιακών προβλημάτων όπως η μυοκαρδιοπάθεια Μπόξερ και η αορτική στένωση. Έχουν υψηλότερη από τη μέση επίπτωση ορισμένων καρκίνων συμπεριλαμβανομένων όγκων μαστοκυττάρων και λεμφώματος. Η δυσπλασία ισχίου, ο υποθυρεοειδισμός και η εκφυλιστική μυελοπάθεια μπορεί επίσης να εμφανιστούν. Το φούσκωμα (γαστρική διάταση-συστροφή) είναι ανησυχία σε ράτσες με βαθύ θώρακα. Η βραχυκεφαλική τους δομή μπορεί να συμβάλει σε αναπνευστικές δυσκολίες σε ακραία ζέστη. Οι τακτικοί κτηνιατρικοί έλεγχοι και η επίγνωση των ειδικών για τη ράτσα υγειονομικών προβλημάτων βοηθούν στην πρώιμη ανίχνευση και θεραπεία."
  },
  {
    "id": "dachshund",
    "slug": "dachshund",
    "name_en": "Dachshund",
    "name_el": "Ντάτσχουντ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "small",
    "lifespan": "12-16 years",
    "temperament_en": ["Clever", "Stubborn", "Devoted", "Lively", "Playful"],
    "temperament_el": ["Έξυπνος", "Πεισματάρης", "Αφοσιωμένος", "Ζωηρός", "Παιχνιδιάρης"],
    "description_en": "The Dachshund, affectionately called the 'wiener dog' or 'sausage dog', is a distinctive breed with a long body and short legs. Developed in Germany over 300 years ago to hunt badgers (Dachs means badger in German), these brave little dogs come in two sizes (standard and miniature) and three coat types (smooth, longhaired, and wirehaired). Despite their small stature, Dachshunds have bold, sometimes stubborn personalities. They are devoted to their families and can be surprisingly good watchdogs with their deep, loud bark.",
    "description_el": "Το Ντάτσχουντ, στοργικά αποκαλούμενο 'λουκάνικο σκυλί', είναι μια χαρακτηριστική ράτσα με μακρύ σώμα και κοντά πόδια. Αναπτύχθηκε στη Γερμανία πριν από περισσότερα από 300 χρόνια για να κυνηγά ασβούς (Dachs σημαίνει ασβός στα γερμανικά), αυτά τα γενναία μικρά σκυλιά έρχονται σε δύο μεγέθη (standard και miniature) και τρεις τύπους τριχώματος (λείο, μακρύτριχο και σκληρότριχο). Παρά το μικρό τους ανάστημα, τα Ντάτσχουντ έχουν τολμηρές, μερικές φορές πεισματάρικες προσωπικότητες. Είναι αφοσιωμένα στις οικογένειές τους και μπορεί να είναι εκπληκτικά καλοί φύλακες με το βαθύ, δυνατό τους γαύγισμα.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 4, "trainability": 2, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Dachshunds require special care for their unique body structure. They should avoid jumping on and off furniture, and ramps or steps should be provided to protect their long backs. Maintaining a healthy weight is crucial - extra pounds significantly increase the risk of back problems. Moderate daily exercise is important, but they should not be over-exercised as puppies. Smooth-coated Dachshunds need minimal grooming, while longhaired and wirehaired varieties require more brushing. Their intelligence requires mental stimulation to prevent boredom-related behaviors.",
    "care_el": "Τα Ντάτσχουντ απαιτούν ειδική φροντίδα για τη μοναδική σωματική τους δομή. Πρέπει να αποφεύγουν να πηδούν πάνω και κάτω από έπιπλα, και πρέπει να παρέχονται ράμπες ή σκαλοπάτια για να προστατεύονται οι μακριές πλάτες τους. Η διατήρηση υγιούς βάρους είναι κρίσιμη - τα επιπλέον κιλά αυξάνουν σημαντικά τον κίνδυνο προβλημάτων πλάτης. Η μέτρια καθημερινή άσκηση είναι σημαντική, αλλά δεν πρέπει να υπερασκούνται ως κουτάβια. Τα λεία Ντάτσχουντ χρειάζονται ελάχιστη περιποίηση, ενώ οι μακρύτριχες και σκληρότριχες ποικιλίες απαιτούν περισσότερο βούρτσισμα. Η νοημοσύνη τους απαιτεί νοητική διέγερση για να αποφευχθούν συμπεριφορές που σχετίζονται με την πλήξη.",
    "health_en": "The Dachshund's unique body structure makes them highly prone to intervertebral disc disease (IVDD), a serious spinal condition. An estimated 25% of Dachshunds will experience back problems during their lifetime. Keeping them lean and preventing jumping helps reduce risk. Patellar luxation, eye problems including progressive retinal atrophy, and obesity are other concerns. Bloat can occur, particularly in older dogs. Responsible breeding practices and maintaining appropriate weight are the best preventive measures for this breed's health issues.",
    "health_el": "Η μοναδική σωματική δομή του Ντάτσχουντ τα καθιστά πολύ επιρρεπή σε μεσοσπονδύλια δισκοπάθεια (IVDD), μια σοβαρή πάθηση της σπονδυλικής στήλης. Υπολογίζεται ότι το 25% των Ντάτσχουντ θα αντιμετωπίσουν προβλήματα πλάτης κατά τη διάρκεια της ζωής τους. Η διατήρησή τους αδύνατων και η αποφυγή των αλμάτων βοηθά στη μείωση του κινδύνου. Η εξάρθρωση επιγονατίδας, τα προβλήματα ματιών συμπεριλαμβανομένης της προοδευτικής ατροφίας αμφιβληστροειδούς, και η παχυσαρκία είναι άλλες ανησυχίες. Το φούσκωμα μπορεί να εμφανιστεί, ιδιαίτερα σε ηλικιωμένα σκυλιά. Οι υπεύθυνες πρακτικές εκτροφής και η διατήρηση κατάλληλου βάρους είναι τα καλύτερα προληπτικά μέτρα για τα υγειονομικά προβλήματα αυτής της ράτσας."
  },
  {
    "id": "siberian-husky",
    "slug": "siberian-husky",
    "name_en": "Siberian Husky",
    "name_el": "Σιβηριανό Χάσκι",
    "type": "dog",
    "origin": "Russia",
    "originCode": "RU",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Friendly", "Outgoing", "Mischievous", "Loyal", "Energetic"],
    "temperament_el": ["Φιλικός", "Εξωστρεφής", "Αταξιάρης", "Πιστός", "Ενεργητικός"],
    "description_en": "The Siberian Husky is a beautiful, athletic breed originally developed by the Chukchi people of northeastern Asia for sled-pulling across vast frozen territories. Known for their striking appearance with blue or multi-colored eyes, erect triangular ears, and distinctive facial markings, Huskies have become popular family pets worldwide. They are friendly, outgoing dogs that generally get along well with people and other dogs. Huskies are pack-oriented and thrive with company, whether human or canine. Their adventurous, sometimes mischievous nature requires experienced ownership.",
    "description_el": "Το Σιβηριανό Χάσκι είναι μια όμορφη, αθλητική ράτσα που αρχικά αναπτύχθηκε από τους Τσούκτσι της βορειοανατολικής Ασίας για το τράβηγμα ελκήθρων σε απέραντα παγωμένα εδάφη. Γνωστά για την εντυπωσιακή εμφάνισή τους με μπλε ή πολύχρωμα μάτια, όρθια τριγωνικά αυτιά και χαρακτηριστικά σημάδια στο πρόσωπο, τα Χάσκι έχουν γίνει δημοφιλή οικογενειακά κατοικίδια παγκοσμίως. Είναι φιλικά, εξωστρεφή σκυλιά που γενικά τα πάνε καλά με ανθρώπους και άλλα σκυλιά. Τα Χάσκι είναι προσανατολισμένα στην αγέλη και ευδοκιμούν με συντροφιά, είτε ανθρώπινη είτε σκυλίσια. Η περιπετειώδης, μερικές φορές αταξιάρικη φύση τους απαιτεί έμπειρη ιδιοκτησία.",
    "characteristics": { "energy": 5, "grooming": 4, "friendliness": 4, "trainability": 2, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Siberian Huskies require extensive daily exercise - at least 2 hours of vigorous activity. They excel at running, hiking, and of course, sledding. A securely fenced yard is essential as they are notorious escape artists who can jump, dig, and squeeze through small openings. Their thick double coat sheds heavily twice a year during 'coat blowing' seasons, requiring daily brushing during these periods. Huskies are independent thinkers which can make training challenging - patience and consistency are key. They may not be suitable for first-time dog owners.",
    "care_el": "Τα Σιβηριανά Χάσκι απαιτούν εκτεταμένη καθημερινή άσκηση - τουλάχιστον 2 ώρες έντονης δραστηριότητας. Διαπρέπουν στο τρέξιμο, την πεζοπορία και φυσικά το έλκηθρο. Μια ασφαλώς περιφραγμένη αυλή είναι απαραίτητη καθώς είναι διαβόητοι δραπέτες που μπορούν να πηδήξουν, να σκάψουν και να στριμωχτούν μέσα από μικρά ανοίγματα. Το παχύ διπλό τρίχωμά τους αλλάζει έντονα δύο φορές το χρόνο κατά τις εποχές 'εκτόξευσης τριχώματος', απαιτώντας καθημερινό βούρτσισμα κατά τη διάρκεια αυτών των περιόδων. Τα Χάσκι είναι ανεξάρτητοι σκεπτόμενοι που μπορεί να κάνουν την εκπαίδευση προκλητική - η υπομονή και η συνέπεια είναι το κλειδί. Μπορεί να μην είναι κατάλληλα για ιδιοκτήτες σκύλων για πρώτη φορά.",
    "health_en": "Siberian Huskies are generally healthy dogs but can be prone to certain eye conditions including juvenile cataracts, corneal dystrophy, and progressive retinal atrophy. Hip dysplasia occurs less frequently than in many large breeds but can still be a concern. Hypothyroidism may develop in some dogs. Zinc-responsive dermatosis, a skin condition, is sometimes seen in northern breeds. Responsible breeders screen for hereditary eye conditions and hip dysplasia. Regular veterinary checkups help ensure early detection of any health issues.",
    "health_el": "Τα Σιβηριανά Χάσκι είναι γενικά υγιή σκυλιά αλλά μπορεί να είναι επιρρεπή σε ορισμένες παθήσεις των ματιών συμπεριλαμβανομένου του νεανικού καταρράκτη, της δυστροφίας κερατοειδούς και της προοδευτικής ατροφίας αμφιβληστροειδούς. Η δυσπλασία ισχίου εμφανίζεται λιγότερο συχνά από ό,τι σε πολλές μεγάλες ράτσες αλλά μπορεί ακόμα να είναι ανησυχία. Ο υποθυρεοειδισμός μπορεί να αναπτυχθεί σε ορισμένα σκυλιά. Η δερματοπάθεια που ανταποκρίνεται στον ψευδάργυρο, μια δερματική πάθηση, εμφανίζεται μερικές φορές σε βόρειες ράτσες. Οι υπεύθυνοι εκτροφείς ελέγχουν για κληρονομικές παθήσεις ματιών και δυσπλασία ισχίου. Οι τακτικοί κτηνιατρικοί έλεγχοι βοηθούν στην πρώιμη ανίχνευση τυχόν υγειονομικών προβλημάτων."
  },
  {
    "id": "shih-tzu",
    "slug": "shih-tzu",
    "name_en": "Shih Tzu",
    "name_el": "Σι Τσου",
    "type": "dog",
    "origin": "China",
    "originCode": "CN",
    "images": [],
    "size": "small",
    "lifespan": "10-16 years",
    "temperament_en": ["Affectionate", "Playful", "Outgoing", "Loyal", "Gentle"],
    "temperament_el": ["Στοργικός", "Παιχνιδιάρης", "Εξωστρεφής", "Πιστός", "Ήπιος"],
    "description_en": "The Shih Tzu is a charming toy breed with roots in ancient China, where they were bred exclusively for Chinese royalty as prized companion dogs. Their name means 'lion dog' in Mandarin, reflecting their flowing mane-like coat and regal bearing. Despite their aristocratic heritage, Shih Tzus are friendly, outgoing dogs that love people and adapt well to various living situations. They are true companion dogs, happiest when spending time with their families. Their sweet, trusting nature makes them wonderful therapy dogs and gentle playmates for children.",
    "description_el": "Το Σι Τσου είναι μια γοητευτική ράτσα παιχνιδιού με ρίζες στην αρχαία Κίνα, όπου εκτρέφονταν αποκλειστικά για τη κινεζική βασιλεία ως πολύτιμοι σκύλοι συντροφιάς. Το όνομά τους σημαίνει 'σκύλος λιοντάρι' στα μανδαρινικά, αντανακλώντας το ρέον τρίχωμα τους που μοιάζει με χαίτη και τη βασιλική τους στάση. Παρά τη αριστοκρατική τους κληρονομιά, τα Σι Τσου είναι φιλικά, εξωστρεφή σκυλιά που αγαπούν τους ανθρώπους και προσαρμόζονται καλά σε διάφορες συνθήκες διαβίωσης. Είναι αληθινοί σκύλοι συντροφιάς, πιο ευτυχισμένοι όταν περνούν χρόνο με τις οικογένειές τους. Η γλυκιά, εμπιστευτική φύση τους τα καθιστά υπέροχους σκύλους θεραπείας και ήπιους συντρόφους παιχνιδιού για τα παιδιά.",
    "characteristics": { "energy": 2, "grooming": 5, "friendliness": 5, "trainability": 3, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Shih Tzus require daily brushing to prevent matting of their long, flowing coat, or can be kept in a shorter 'puppy cut' for easier maintenance. Regular professional grooming every 4-6 weeks is recommended. Their facial hair needs daily attention to keep it clean and out of their eyes. As a brachycephalic (flat-faced) breed, they should avoid strenuous exercise and extreme heat. Shih Tzus have moderate exercise needs - short daily walks and playtime are sufficient. Regular dental care is important as small breeds are prone to dental disease.",
    "care_el": "Τα Σι Τσου απαιτούν καθημερινό βούρτσισμα για να αποφευχθούν οι κόμποι στο μακρύ, ρέον τρίχωμά τους, ή μπορούν να διατηρηθούν σε κοντότερο 'κούρεμα κουταβιού' για ευκολότερη συντήρηση. Συνιστάται τακτική επαγγελματική περιποίηση κάθε 4-6 εβδομάδες. Το τρίχωμα του προσώπου τους χρειάζεται καθημερινή προσοχή για να παραμένει καθαρό και μακριά από τα μάτια τους. Ως βραχυκεφαλική (επίπεδο πρόσωπο) ράτσα, πρέπει να αποφεύγουν την έντονη άσκηση και την ακραία ζέστη. Τα Σι Τσου έχουν μέτριες ανάγκες άσκησης - σύντομες καθημερινές βόλτες και παιχνίδι είναι αρκετά. Η τακτική οδοντική φροντίδα είναι σημαντική καθώς οι μικρές ράτσες είναι επιρρεπείς σε οδοντικές νόσους.",
    "health_en": "Shih Tzus may be prone to several health conditions related to their brachycephalic structure, including Brachycephalic Obstructive Airway Syndrome (BOAS) which can cause breathing difficulties. Eye problems are common due to their prominent eyes, including proptosis, keratitis, and progressive retinal atrophy. Hip dysplasia and patellar luxation may occur. Ear infections can develop due to their droopy, hairy ears. Liver shunts are occasionally seen in the breed. Intervertebral disc disease may affect their spine. Regular veterinary care helps manage these potential issues.",
    "health_el": "Τα Σι Τσου μπορεί να είναι επιρρεπή σε αρκετές υγειονομικές παθήσεις που σχετίζονται με τη βραχυκεφαλική τους δομή, συμπεριλαμβανομένου του Συνδρόμου Βραχυκεφαλικής Απόφραξης Αεραγωγών (BOAS) που μπορεί να προκαλέσει αναπνευστικές δυσκολίες. Τα προβλήματα ματιών είναι συχνά λόγω των προεξεχόντων ματιών τους, συμπεριλαμβανομένης της πρόπτωσης, της κερατίτιδας και της προοδευτικής ατροφίας αμφιβληστροειδούς. Η δυσπλασία ισχίου και η εξάρθρωση επιγονατίδας μπορεί να εμφανιστούν. Λοιμώξεις αυτιών μπορεί να αναπτυχθούν λόγω των χαμηλωμένων, τριχωτών αυτιών τους. Ηπατικά shunts εμφανίζονται περιστασιακά στη ράτσα. Η μεσοσπονδύλια δισκοπάθεια μπορεί να επηρεάσει τη σπονδυλική τους στήλη. Η τακτική κτηνιατρική φροντίδα βοηθά στη διαχείριση αυτών των πιθανών προβλημάτων."
  },
  {
    "id": "chihuahua",
    "slug": "chihuahua",
    "name_en": "Chihuahua",
    "name_el": "Τσιουάουα",
    "type": "dog",
    "origin": "Mexico",
    "originCode": "MX",
    "images": [],
    "size": "small",
    "lifespan": "12-20 years",
    "temperament_en": ["Charming", "Sassy", "Graceful", "Alert", "Quick"],
    "temperament_el": ["Γοητευτικός", "Θαρραλέος", "Κομψός", "Επαγρύπνος", "Γρήγορος"],
    "description_en": "The Chihuahua is the smallest recognized dog breed in the world, yet these tiny dogs possess enormous personalities. Named after the Mexican state where they were discovered, Chihuahuas have ancient roots possibly tracing back to the Toltec civilization. They come in two coat varieties (smooth and long) and a wide range of colors. Despite their diminutive size (typically 2-6 pounds), Chihuahuas are confident, bold companions fiercely loyal to their owners. They often bond especially closely with one person and can live remarkably long lives, sometimes exceeding 18 years.",
    "description_el": "Το Τσιουάουα είναι η μικρότερη αναγνωρισμένη ράτσα σκύλων στον κόσμο, ωστόσο αυτά τα μικροσκοπικά σκυλιά διαθέτουν τεράστιες προσωπικότητες. Πήραν το όνομά τους από το μεξικανικό κράτος όπου ανακαλύφθηκαν, τα Τσιουάουα έχουν αρχαίες ρίζες που πιθανώς ανάγονται στον πολιτισμό των Τολτέκων. Έρχονται σε δύο ποικιλίες τριχώματος (λείο και μακρύ) και ευρύ φάσμα χρωμάτων. Παρά το μικροσκοπικό τους μέγεθος (τυπικά 1-3 κιλά), τα Τσιουάουα είναι σίγουροι, τολμηροί σύντροφοι έντονα πιστοί στους ιδιοκτήτες τους. Συχνά δένονται ιδιαίτερα στενά με ένα άτομο και μπορούν να ζήσουν αξιοσημείωτα μακροχρόνιες ζωές, μερικές φορές ξεπερνώντας τα 18 χρόνια.",
    "characteristics": { "energy": 3, "grooming": 2, "friendliness": 3, "trainability": 3, "cost_index": 1 },
    "cost_annual_usd": "$500-800",
    "care_en": "Chihuahuas are sensitive to cold weather due to their small size and often need sweaters or coats in cooler temperatures. They have moderate exercise needs - short daily walks and indoor play are usually sufficient. Dental care is especially important as toy breeds are highly prone to dental disease - daily brushing is ideal. Their small size makes them fragile, so they should be handled carefully and may not be suitable for homes with young children or large dogs. Early socialization helps prevent excessive timidity or aggression toward strangers.",
    "care_el": "Τα Τσιουάουα είναι ευαίσθητα στο κρύο καιρό λόγω του μικρού τους μεγέθους και συχνά χρειάζονται πουλόβερ ή παλτά σε πιο κρύες θερμοκρασίες. Έχουν μέτριες ανάγκες άσκησης - σύντομες καθημερινές βόλτες και εσωτερικό παιχνίδι είναι συνήθως αρκετά. Η οδοντική φροντίδα είναι ιδιαίτερα σημαντική καθώς οι ράτσες παιχνιδιού είναι πολύ επιρρεπείς σε οδοντικές νόσους - το καθημερινό βούρτσισμα είναι ιδανικό. Το μικρό τους μέγεθος τα καθιστά εύθραυστα, επομένως πρέπει να χειρίζονται προσεκτικά και μπορεί να μην είναι κατάλληλα για σπίτια με μικρά παιδιά ή μεγάλα σκυλιά. Η πρώιμη κοινωνικοποίηση βοηθά στην πρόληψη υπερβολικής δειλίας ή επιθετικότητας προς τους ξένους.",
    "health_en": "Chihuahuas may experience several health concerns including patellar luxation (slipping kneecaps), which is common in toy breeds. Heart disease, including mitral valve disease and patent ductus arteriosus, can occur. Their soft spot (molera) on the skull, present at birth, may never fully close. Hypoglycemia (low blood sugar) can affect small puppies. Collapsed trachea is another concern. Hydrocephalus (water on the brain) occasionally occurs. Despite these potential issues, Chihuahuas are often remarkably long-lived with proper care, regularly reaching 15-18 years.",
    "health_el": "Τα Τσιουάουα μπορεί να αντιμετωπίσουν αρκετές υγειονομικές ανησυχίες συμπεριλαμβανομένης της εξάρθρωσης επιγονατίδας (ολισθαίνουσες επιγονατίδες), που είναι συχνή σε ράτσες παιχνιδιού. Καρδιακές παθήσεις, συμπεριλαμβανομένης της νόσου της μιτροειδούς βαλβίδας και του ανοικτού αρτηριακού πόρου, μπορεί να εμφανιστούν. Το μαλακό τους σημείο (molera) στο κρανίο, που υπάρχει κατά τη γέννηση, μπορεί να μην κλείσει ποτέ εντελώς. Η υπογλυκαιμία (χαμηλό σάκχαρο αίματος) μπορεί να επηρεάσει τα μικρά κουτάβια. Η κατάρρευση τραχείας είναι επίσης ανησυχία. Ο υδροκέφαλος (νερό στον εγκέφαλο) εμφανίζεται περιστασιακά. Παρά αυτά τα πιθανά προβλήματα, τα Τσιουάουα συχνά ζουν αξιοσημείωτα πολύ με σωστή φροντίδα, φτάνοντας τακτικά τα 15-18 χρόνια."
  },
  {
    "id": "border-collie",
    "slug": "border-collie",
    "name_en": "Border Collie",
    "name_el": "Μπόρντερ Κόλι",
    "type": "dog",
    "origin": "United Kingdom",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Intelligent", "Energetic", "Alert", "Athletic", "Workaholic"],
    "temperament_el": ["Έξυπνος", "Ενεργητικός", "Επαγρύπνος", "Αθλητικός", "Εργατικός"],
    "description_en": "The Border Collie is widely considered the most intelligent dog breed in the world. Developed along the Anglo-Scottish border for herding sheep, these remarkable dogs are known for their intense focus, incredible work ethic, and ability to learn complex commands. Border Collies are athletes in every sense, excelling at agility, flyball, disc dog, obedience, and of course, herding. Their famous 'herding eye' - an intense gaze used to control livestock - reflects their focused, driven nature. While incredibly rewarding for active, experienced owners, Border Collies can be challenging for novice dog owners.",
    "description_el": "Το Μπόρντερ Κόλι θεωρείται ευρέως η πιο έξυπνη ράτσα σκύλων στον κόσμο. Αναπτύχθηκε κατά μήκος των αγγλοσκωτικών συνόρων για τη βόσκηση προβάτων, αυτά τα αξιοσημείωτα σκυλιά είναι γνωστά για την έντονη εστίασή τους, την απίστευτη εργατική ηθική και την ικανότητά τους να μαθαίνουν πολύπλοκες εντολές. Τα Μπόρντερ Κόλι είναι αθλητές με κάθε έννοια, διαπρέποντας στην ευκινησία, το flyball, τον δισκόσκυλο, την υπακοή και φυσικά τη βόσκηση. Το διάσημο 'βλέμμα βόσκησης' - ένα έντονο βλέμμα που χρησιμοποιείται για τον έλεγχο του ζωικού κεφαλαίου - αντανακλά την εστιασμένη, αποφασισμένη φύση τους. Ενώ είναι απίστευτα ανταποδοτικά για δραστήριους, έμπειρους ιδιοκτήτες, τα Μπόρντερ Κόλι μπορεί να είναι προκλητικά για αρχάριους ιδιοκτήτες σκύλων.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 3, "trainability": 5, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Border Collies have extremely high exercise and mental stimulation needs - they truly need a job to do. At least 2 hours of vigorous daily exercise is recommended, plus mental challenges like puzzle toys, training sessions, and dog sports. Without adequate stimulation, they can develop destructive behaviors, excessive barking, or neurotic habits. Their medium-length coat requires regular brushing, especially during shedding seasons. Border Collies are not well-suited to sedentary lifestyles or apartment living. They excel with active owners who can channel their energy into constructive activities.",
    "care_el": "Τα Μπόρντερ Κόλι έχουν εξαιρετικά υψηλές ανάγκες άσκησης και νοητικής διέγερσης - πραγματικά χρειάζονται μια δουλειά να κάνουν. Συνιστώνται τουλάχιστον 2 ώρες έντονης καθημερινής άσκησης, συν νοητικές προκλήσεις όπως παιχνίδια παζλ, συνεδρίες εκπαίδευσης και αθλήματα σκύλων. Χωρίς επαρκή διέγερση, μπορεί να αναπτύξουν καταστροφικές συμπεριφορές, υπερβολικό γαύγισμα ή νευρωτικές συνήθειες. Το μεσαίου μήκους τρίχωμά τους απαιτεί τακτικό βούρτσισμα, ειδικά κατά τις εποχές αλλαγής τριχώματος. Τα Μπόρντερ Κόλι δεν είναι κατάλληλα για καθιστική ζωή ή διαβίωση σε διαμέρισμα. Διαπρέπουν με δραστήριους ιδιοκτήτες που μπορούν να διοχετεύσουν την ενέργειά τους σε εποικοδομητικές δραστηριότητες.",
    "health_en": "Border Collies are generally healthy but may be prone to certain conditions. Hip dysplasia can occur and reputable breeders screen for this. Collie Eye Anomaly (CEA) is a hereditary eye condition that breeders should test for. Epilepsy is seen in some lines. Progressive retinal atrophy may affect vision. Trapped Neutrophil Syndrome (TNS) and Neuronal Ceroid Lipofuscinosis (CL) are breed-specific conditions that genetic testing can identify. MDR1 drug sensitivity affects some Border Collies, making certain medications dangerous. Regular veterinary care and genetic testing help ensure a healthy dog.",
    "health_el": "Τα Μπόρντερ Κόλι είναι γενικά υγιή αλλά μπορεί να είναι επιρρεπή σε ορισμένες παθήσεις. Η δυσπλασία ισχίου μπορεί να εμφανιστεί και οι αξιόπιστοι εκτροφείς ελέγχουν για αυτό. Η Ανωμαλία Ματιού Κόλι (CEA) είναι μια κληρονομική πάθηση ματιών που οι εκτροφείς πρέπει να ελέγχουν. Η επιληψία εμφανίζεται σε ορισμένες σειρές. Η προοδευτική ατροφία αμφιβληστροειδούς μπορεί να επηρεάσει την όραση. Το Σύνδρομο Παγιδευμένου Ουδετερόφιλου (TNS) και η Νευρωνική Κηροειδής Λιποφουσκίνωση (CL) είναι ειδικές για τη ράτσα παθήσεις που ο γενετικός έλεγχος μπορεί να εντοπίσει. Η ευαισθησία στο φάρμακο MDR1 επηρεάζει ορισμένα Μπόρντερ Κόλι, καθιστώντας ορισμένα φάρμακα επικίνδυνα."
  },
  {
    "id": "pomeranian",
    "slug": "pomeranian",
    "name_en": "Pomeranian",
    "name_el": "Πομερανιάν",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "small",
    "lifespan": "12-16 years",
    "temperament_en": ["Lively", "Bold", "Inquisitive", "Playful", "Extroverted"],
    "temperament_el": ["Ζωηρός", "Τολμηρός", "Περίεργος", "Παιχνιδιάρης", "Εξωστρεφής"],
    "description_en": "The Pomeranian is a small, fluffy spitz breed that descends from larger sled dogs of the Arctic region. Named after the Pomerania region spanning Germany and Poland, these tiny dogs (typically 3-7 pounds) have outsized personalities. They have a distinctive fox-like face, erect triangular ears, and a plume-like tail that arches over their back. Pomeranians gained popularity in the 18th century when Queen Victoria fell in love with the breed. Despite their small size, they are confident, curious dogs that make excellent companions and surprisingly capable watchdogs.",
    "description_el": "Το Πομερανιάν είναι μια μικρή, χνουδωτή ράτσα σπιτς που κατάγεται από μεγαλύτερους σκύλους ελκήθρου της αρκτικής περιοχής. Πήρε το όνομά του από την περιοχή Πομερανία που εκτείνεται στη Γερμανία και την Πολωνία, αυτά τα μικροσκοπικά σκυλιά (τυπικά 1,5-3 κιλά) έχουν υπερμεγέθεις προσωπικότητες. Έχουν ένα χαρακτηριστικό πρόσωπο που μοιάζει με αλεπού, όρθια τριγωνικά αυτιά και μια φτερωτή ουρά που καμπυλώνει πάνω από την πλάτη τους. Τα Πομερανιάν κέρδισαν δημοτικότητα τον 18ο αιώνα όταν η Βασίλισσα Βικτωρία ερωτεύτηκε τη ράτσα. Παρά το μικρό τους μέγεθος, είναι σίγουρα, περίεργα σκυλιά που είναι εξαιρετικοί σύντροφοι και εκπληκτικά ικανοί φύλακες.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 4, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Pomeranians require regular brushing (at least 2-3 times per week) to maintain their fluffy double coat and prevent matting. Professional grooming every 4-6 weeks helps keep their coat in optimal condition. They have moderate exercise needs - short daily walks and play sessions are usually sufficient. Dental care is especially important as small breeds are prone to dental problems. Due to their small size, they should be protected from very cold or hot weather. Early socialization helps prevent excessive barking and wariness of strangers, which can be issues with the breed.",
    "care_el": "Τα Πομερανιάν απαιτούν τακτικό βούρτσισμα (τουλάχιστον 2-3 φορές την εβδομάδα) για να διατηρήσουν το χνουδωτό διπλό τρίχωμά τους και να αποφευχθούν οι κόμποι. Η επαγγελματική περιποίηση κάθε 4-6 εβδομάδες βοηθά να διατηρηθεί το τρίχωμά τους σε βέλτιστη κατάσταση. Έχουν μέτριες ανάγκες άσκησης - σύντομες καθημερινές βόλτες και συνεδρίες παιχνιδιού είναι συνήθως αρκετές. Η οδοντική φροντίδα είναι ιδιαίτερα σημαντική καθώς οι μικρές ράτσες είναι επιρρεπείς σε οδοντικά προβλήματα. Λόγω του μικρού τους μεγέθους, πρέπει να προστατεύονται από πολύ κρύο ή ζεστό καιρό. Η πρώιμη κοινωνικοποίηση βοηθά στην πρόληψη υπερβολικού γαυγίσματος και επιφυλακτικότητας απέναντι σε ξένους, που μπορεί να είναι προβλήματα της ράτσας.",
    "health_en": "Pomeranians may be prone to several health conditions common in toy breeds. Patellar luxation (slipping kneecaps) is frequently seen and may require surgical correction in severe cases. Collapsed trachea can cause a characteristic honking cough. Alopecia X (black skin disease) causes coat loss and is relatively common in the breed. Heart disease, including patent ductus arteriosus, may occur. Dental disease is prevalent due to their small mouths. Hypoglycemia can affect puppies. Despite these potential issues, well-bred Pomeranians often enjoy long, healthy lives of 15 years or more.",
    "health_el": "Τα Πομερανιάν μπορεί να είναι επιρρεπή σε αρκετές υγειονομικές παθήσεις που είναι συχνές σε ράτσες παιχνιδιού. Η εξάρθρωση επιγονατίδας (ολισθαίνουσες επιγονατίδες) εμφανίζεται συχνά και μπορεί να απαιτεί χειρουργική διόρθωση σε σοβαρές περιπτώσεις. Η κατάρρευση τραχείας μπορεί να προκαλέσει χαρακτηριστικό βήχα σαν κόρνα. Η Αλωπεκία X (νόσος μαύρου δέρματος) προκαλεί απώλεια τριχώματος και είναι σχετικά συχνή στη ράτσα. Καρδιακές παθήσεις, συμπεριλαμβανομένου του ανοικτού αρτηριακού πόρου, μπορεί να εμφανιστούν. Η οδοντική νόσος είναι διαδεδομένη λόγω του μικρού τους στόματος. Η υπογλυκαιμία μπορεί να επηρεάσει τα κουτάβια. Παρά αυτά τα πιθανά προβλήματα, τα καλά εκτρεφόμενα Πομερανιάν συχνά απολαμβάνουν μακρές, υγιείς ζωές 15 ετών ή περισσότερο."
  }
]
