[
  {
    "id": "australian-cattle-dog",
    "slug": "australian-cattle-dog",
    "name_en": "Australian Cattle Dog",
    "name_el": "Αυστραλιανός Βοσκός",
    "type": "dog",
    "origin": "Australia",
    "originCode": "AU",
    "images": [],
    "size": "medium",
    "lifespan": "12-16 years",
    "temperament_en": ["Energetic", "Loyal", "Intelligent", "Alert", "Protective"],
    "temperament_el": ["Ενεργητικός", "Πιστός", "Έξυπνος", "Επαγρύπνος", "Προστατευτικός"],
    "description_en": "The Australian Cattle Dog, also known as the Blue Heeler or Red Heeler depending on coat color, was developed in 19th-century Australia to drive cattle over vast distances across harsh, unforgiving terrain. The breed was created by crossing native Dingoes with imported British herding dogs including Collies, Dalmatians, and Black and Tan Kelpies, resulting in an exceptionally tough and resilient working dog. Australian Cattle Dogs are compact, muscular, and incredibly agile, with a distinctive speckled blue or red coat pattern. They are ranked among the most intelligent dog breeds in the world, capable of independent problem-solving while remaining deeply loyal to their primary handler. The breed holds the Guinness World Record for the longest-lived dog — an ACD named Bluey lived to 29 years and 5 months. These dogs form intense bonds with their owners, often becoming devoted 'Velcro dogs' that follow their person everywhere, and they retain a strong herding instinct that may manifest as nipping at heels.",
    "description_el": "Ο Αυστραλιανός Βοσκός, γνωστός επίσης ως Blue Heeler ή Red Heeler ανάλογα με το χρώμα του τριχώματος, αναπτύχθηκε στην Αυστραλία τον 19ο αιώνα για την οδήγηση βοοειδών σε τεράστιες αποστάσεις μέσα από σκληρό, αφιλόξενο έδαφος. Η ράτσα δημιουργήθηκε διασταυρώνοντας ιθαγενή Dingo με εισαγόμενους βρετανικούς ποιμενικούς σκύλους, συμπεριλαμβανομένων Collie, Dalmatian και Black and Tan Kelpie, δημιουργώντας έναν εξαιρετικά σκληρό και ανθεκτικό εργατικό σκύλο. Οι Αυστραλιανοί Βοσκοί είναι συμπαγείς, μυώδεις και απίστευτα ευκίνητοι, με χαρακτηριστικό στίγματα μπλε ή κόκκινο τρίχωμα. Κατατάσσονται ανάμεσα στις πιο έξυπνες ράτσες σκύλων στον κόσμο, ικανοί για ανεξάρτητη επίλυση προβλημάτων ενώ παραμένουν βαθιά πιστοί στον κύριο χειριστή τους. Η ράτσα κατέχει το ρεκόρ Guinness για τον πιο μακρόβιο σκύλο — ένας ACD ονόματι Bluey έζησε 29 χρόνια και 5 μήνες. Αυτοί οι σκύλοι δημιουργούν έντονους δεσμούς με τους ιδιοκτήτες τους, συχνά γινόμενοι αφοσιωμένοι σκύλοι που ακολουθούν το άτομό τους παντού, και διατηρούν ισχυρό ποιμενικό ένστικτο που μπορεί να εκδηλωθεί ως δάγκωμα στις φτέρνες.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 3, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Australian Cattle Dogs require substantial daily exercise — a minimum of 2 hours of vigorous physical activity including running, hiking, swimming, or intense play sessions. They are working dogs at heart and thrive when given a job, whether that's herding, agility courses, flyball, or advanced obedience training. Their short, weather-resistant double coat is relatively low-maintenance, requiring only weekly brushing, though shedding increases significantly during seasonal coat changes. Mental stimulation is just as important as physical exercise; puzzle toys, scent work, and training challenges help prevent boredom-related destructive behaviors. ACDs can be reserved or suspicious of strangers and may display territorial behavior, making early and ongoing socialization essential. They are known to 'heel' or nip at moving objects, children, and other animals — this natural herding behavior should be redirected through training rather than punished. These dogs do best in homes with experienced owners who understand working breed needs and can provide consistent, firm leadership.",
    "care_el": "Οι Αυστραλιανοί Βοσκοί απαιτούν σημαντική καθημερινή άσκηση — τουλάχιστον 2 ώρες έντονης σωματικής δραστηριότητας συμπεριλαμβανομένου τρεξίματος, πεζοπορίας, κολύμβησης ή έντονων συνεδριών παιχνιδιού. Είναι εργατικοί σκύλοι στην ψυχή τους και ευδοκιμούν όταν τους δίνεται δουλειά, είτε αυτή είναι ποίμανση, αγώνες ευκινησίας, flyball ή προχωρημένη εκπαίδευση υπακοής. Το κοντό, ανθεκτικό στον καιρό διπλό τρίχωμά τους είναι σχετικά χαμηλής συντήρησης, απαιτώντας μόνο εβδομαδιαίο βούρτσισμα, αν και η τριχόπτωση αυξάνεται σημαντικά κατά τις εποχιακές αλλαγές. Η νοητική διέγερση είναι εξίσου σημαντική με τη σωματική άσκηση· παιχνίδια παζλ, εργασία όσφρησης και προκλήσεις εκπαίδευσης βοηθούν στην πρόληψη καταστροφικών συμπεριφορών από πλήξη. Οι ACD μπορεί να είναι επιφυλακτικοί ή καχύποπτοι με αγνώστους και μπορεί να εμφανίσουν εδαφική συμπεριφορά, καθιστώντας την πρώιμη και συνεχή κοινωνικοποίηση απαραίτητη. Είναι γνωστοί για το τσίμπημα στις φτέρνες κινούμενων αντικειμένων, παιδιών και ζώων — αυτή η φυσική ποιμενική συμπεριφορά πρέπει να ανακατευθυνθεί μέσω εκπαίδευσης.",
    "health_en": "Australian Cattle Dogs are generally robust and long-lived, but they can be predisposed to several hereditary conditions. Hip and elbow dysplasia affect some dogs, particularly those from lines not screened for joint health. Progressive retinal atrophy (PRA) can lead to gradual vision loss, and congenital hereditary sensorineural deafness (CHSD) is linked to the breed's coat color genetics — dogs with excessive white markings are at higher risk. Osteochondritis dissecans (OCD) can affect young, rapidly growing dogs. The breed may also develop lens luxation and other eye conditions. Regular veterinary checkups, maintaining a healthy weight, and choosing a breeder who performs BAER hearing tests, hip evaluations, and eye certifications are important steps to ensure a healthy pet. With proper care, Australian Cattle Dogs regularly live well into their mid-teens.",
    "health_el": "Οι Αυστραλιανοί Βοσκοί είναι γενικά ανθεκτικοί και μακρόβιοι, αλλά μπορεί να είναι προδιατεθειμένοι σε αρκετές κληρονομικές παθήσεις. Η δυσπλασία ισχίου και αγκώνα επηρεάζει ορισμένους σκύλους, ιδιαίτερα αυτούς από γραμμές που δεν ελέγχονται για υγεία αρθρώσεων. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) μπορεί να οδηγήσει σε σταδιακή απώλεια όρασης, και η συγγενής κληρονομική νευροαισθητήρια κώφωση (CHSD) συνδέεται με τη γενετική χρώματος τριχώματος — σκύλοι με υπερβολικά λευκά σημάδια κινδυνεύουν περισσότερο. Η οστεοχόνδρωση μπορεί να επηρεάσει νεαρούς, ταχέως αναπτυσσόμενους σκύλους. Η ράτσα μπορεί επίσης να αναπτύξει εξάρθρωση φακού και άλλες οφθαλμολογικές παθήσεις. Οι τακτικοί κτηνιατρικοί έλεγχοι, η διατήρηση υγιούς βάρους και η επιλογή εκτροφέα που πραγματοποιεί τεστ ακοής BAER, αξιολογήσεις ισχίου και πιστοποιήσεις ματιών είναι σημαντικά βήματα. Με σωστή φροντίδα, οι Αυστραλιανοί Βοσκοί ζουν τακτικά μέχρι τα μέσα της δεκαετίας τους."
  },
  {
    "id": "australian-shepherd",
    "slug": "australian-shepherd",
    "name_en": "Australian Shepherd",
    "name_el": "Αυστραλιανός Ποιμενικός",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Intelligent", "Energetic", "Loyal", "Playful", "Protective"],
    "temperament_el": ["Έξυπνος", "Ενεργητικός", "Πιστός", "Παιχνιδιάρης", "Προστατευτικός"],
    "description_en": "The Australian Shepherd, despite its name, was actually developed in the western United States during the 19th century to herd livestock on ranches and farms. The breed's name likely comes from their association with Basque shepherds who emigrated from Australia to America in the 1800s. Aussies are strikingly beautiful dogs, known for their stunning merle coats that come in blue merle, red merle, black, and red, often paired with captivating heterochromatic or blue eyes. They are consistently ranked among the most intelligent dog breeds and are natural athletes that excel in virtually every canine sport, from agility and flyball to dock diving and disc dog competitions. Australian Shepherds are deeply loyal and form intense bonds with their families, often choosing one person as their primary companion. They retain strong herding instincts and may try to herd children, other pets, or even visitors by circling and nudging. Their combination of beauty, intelligence, and versatility has made them one of the most popular breeds in the United States.",
    "description_el": "Ο Αυστραλιανός Ποιμενικός, παρά το όνομά του, αναπτύχθηκε στις δυτικές Ηνωμένες Πολιτείες κατά τον 19ο αιώνα για την ποίμανση ζώων σε ράντσα και φάρμες. Το όνομα της ράτσας πιθανότατα προέρχεται από τη σύνδεσή τους με Βάσκους βοσκούς που μετανάστευσαν από την Αυστραλία στην Αμερική τη δεκαετία του 1800. Οι Aussie είναι εντυπωσιακά όμορφοι σκύλοι, γνωστοί για τα εκπληκτικά merle τριχώματά τους που έρχονται σε blue merle, red merle, μαύρο και κόκκινο, συχνά σε συνδυασμό με εντυπωσιακά ετερόχρωμα ή μπλε μάτια. Κατατάσσονται συνεχώς ανάμεσα στις πιο έξυπνες ράτσες σκύλων και είναι φυσικοί αθλητές που διαπρέπουν σε σχεδόν κάθε αγώνισμα σκύλων, από ευκινησία και flyball μέχρι dock diving. Οι Αυστραλιανοί Ποιμενικοί είναι βαθιά πιστοί και δημιουργούν έντονους δεσμούς με τις οικογένειές τους, συχνά επιλέγοντας ένα άτομο ως κύριο σύντροφό τους. Διατηρούν ισχυρά ποιμενικά ένστικτα και μπορεί να προσπαθήσουν να ποιμάνουν παιδιά, άλλα κατοικίδια ή ακόμα και επισκέπτες. Ο συνδυασμός ομορφιάς, νοημοσύνης και ευελιξίας τους τα έχει καταστήσει μία από τις πιο δημοφιλείς ράτσες στις Ηνωμένες Πολιτείες.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 4, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Australian Shepherds need at least 1-2 hours of vigorous daily exercise, and they truly thrive with even more activity. They are not suited to a sedentary lifestyle and will develop destructive behaviors, excessive barking, or anxiety if under-exercised. Their medium-length double coat requires brushing 2-3 times per week and daily brushing during heavy shedding periods in spring and fall. Aussies are highly food-motivated, which makes training enjoyable but also means portion control is important to prevent weight gain. They excel in agility, herding trials, obedience, rally, and trick training — mental stimulation is as crucial as physical exercise for this breed. Early socialization is vital as some Aussies can develop shyness or reactivity if not exposed to a variety of people, animals, and environments during puppyhood. They are best suited to active families, outdoor enthusiasts, or owners who participate in dog sports.",
    "care_el": "Οι Αυστραλιανοί Ποιμενικοί χρειάζονται τουλάχιστον 1-2 ώρες έντονης καθημερινής άσκησης, και πραγματικά ευδοκιμούν με ακόμα περισσότερη δραστηριότητα. Δεν είναι κατάλληλοι για καθιστική ζωή και θα αναπτύξουν καταστροφικές συμπεριφορές, υπερβολικό γαύγισμα ή άγχος αν δεν ασκηθούν επαρκώς. Το μεσαίου μήκους διπλό τρίχωμά τους απαιτεί βούρτσισμα 2-3 φορές την εβδομάδα και καθημερινό βούρτσισμα κατά τις περιόδους έντονης τριχόπτωσης την άνοιξη και το φθινόπωρο. Οι Aussie είναι πολύ παρακινημένοι από το φαγητό, κάτι που κάνει την εκπαίδευση ευχάριστη αλλά σημαίνει ότι ο έλεγχος μερίδων είναι σημαντικός. Διαπρέπουν στην ευκινησία, δοκιμές ποίμανσης, υπακοή, rally και εκπαίδευση κόλπων — η νοητική διέγερση είναι εξίσου κρίσιμη με τη σωματική άσκηση. Η πρώιμη κοινωνικοποίηση είναι ζωτικής σημασίας καθώς ορισμένοι Aussie μπορεί να αναπτύξουν ντροπαλότητα ή αντιδραστικότητα αν δεν εκτεθούν σε ποικιλία ανθρώπων, ζώων και περιβαλλόντων κατά την κουταβίστικη ηλικία.",
    "health_en": "Australian Shepherds can be prone to hip and elbow dysplasia, which are joint conditions that affect mobility and comfort. Several eye conditions are prevalent in the breed, including cataracts, collie eye anomaly (CEA), progressive retinal atrophy (PRA), and iris coloboma. The MDR1 gene mutation is common in Australian Shepherds, making them dangerously sensitive to certain common medications including ivermectin, loperamide, and some anesthetics — every Aussie should be MDR1 tested. Epilepsy occurs in some lines and can usually be managed with medication. Merle-to-merle breeding must be strictly avoided as it can produce double merle puppies with severe vision and hearing deficits. Some Aussies may also develop autoimmune thyroiditis and certain cancers. Regular health screenings, genetic testing (particularly for MDR1, CEA, and PRA), and choosing a reputable breeder who tests parent dogs are essential for a healthy Australian Shepherd.",
    "health_el": "Οι Αυστραλιανοί Ποιμενικοί μπορεί να είναι επιρρεπείς σε δυσπλασία ισχίου και αγκώνα, παθήσεις αρθρώσεων που επηρεάζουν την κινητικότητα. Αρκετές οφθαλμολογικές παθήσεις είναι διαδεδομένες στη ράτσα, συμπεριλαμβανομένων καταρράκτη, collie eye anomaly (CEA), προοδευτικής ατροφίας αμφιβληστροειδούς (PRA) και κολοβώματος ίριδας. Η γονιδιακή μετάλλαξη MDR1 είναι κοινή στους Αυστραλιανούς Ποιμενικούς, καθιστώντας τους επικίνδυνα ευαίσθητους σε ορισμένα κοινά φάρμακα όπως ιβερμεκτίνη, λοπεραμίδη και ορισμένα αναισθητικά — κάθε Aussie πρέπει να ελέγχεται για MDR1. Η επιληψία εμφανίζεται σε ορισμένες γραμμές και συνήθως μπορεί να αντιμετωπιστεί με φαρμακευτική αγωγή. Η εκτροφή merle με merle πρέπει αυστηρά να αποφεύγεται καθώς μπορεί να παράγει κουτάβια double merle με σοβαρές οπτικές και ακουστικές ελλείψεις. Οι τακτικοί έλεγχοι υγείας, ο γενετικός έλεγχος και η επιλογή αξιόπιστου εκτροφέα είναι απαραίτητα."
  },
  {
    "id": "bearded-collie",
    "slug": "bearded-collie",
    "name_en": "Bearded Collie",
    "name_el": "Γενειοφόρος Κόλλι",
    "type": "dog",
    "origin": "Scotland",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Lively", "Friendly", "Confident", "Independent", "Playful"],
    "temperament_el": ["Ζωηρός", "Φιλικός", "Σίγουρος", "Ανεξάρτητος", "Παιχνιδιάρης"],
    "description_en": "The Bearded Collie, affectionately known as the 'Beardie,' is one of Scotland's oldest and most charming herding breeds, with roots dating back to the 16th century when Polish Lowland Sheepdogs may have been crossed with local Scottish herding dogs. They were used for centuries in the Scottish Highlands to drive sheep and cattle through rugged, hilly terrain and in all types of weather. Beardies are medium-sized, athletic dogs with a distinctive long, shaggy double coat that parts naturally down the middle of the back and a characteristic 'beard' of longer hair on the chin. Their coat color changes as they mature — born dark, they lighten with age, and many owners are delighted by this gradual transformation. Bearded Collies are renowned for their bouncy, energetic gait and their perpetually cheerful disposition. They retain a puppy-like enthusiasm well into their senior years, earning them the nickname 'bouncing Beardies.' They are naturally friendly with people, other dogs, and even strangers, making them poor guard dogs but wonderful family companions.",
    "description_el": "Ο Γενειοφόρος Κόλλι, γνωστός στοργικά ως 'Beardie,' είναι μία από τις παλαιότερες και πιο γοητευτικές ποιμενικές ράτσες της Σκωτίας, με ρίζες που χρονολογούνται στον 16ο αιώνα όταν Πολωνικοί Πεδινοί Ποιμενικοί πιθανώς διασταυρώθηκαν με τοπικούς σκωτσέζικους ποιμενικούς σκύλους. Χρησιμοποιούνταν για αιώνες στα Σκωτσέζικα Υψίπεδα για να οδηγούν πρόβατα και βοοειδή μέσα από τραχύ, λοφώδες έδαφος και σε κάθε είδους καιρικές συνθήκες. Οι Beardie είναι μεσαίου μεγέθους, αθλητικοί σκύλοι με χαρακτηριστικό μακρύ, ατημέλητο διπλό τρίχωμα που χωρίζεται φυσικά στη μέση της πλάτης και ένα χαρακτηριστικό 'γένι' μακρύτερης τρίχας στο πηγούνι. Το χρώμα του τριχώματός τους αλλάζει καθώς ωριμάζουν — γεννιούνται σκούρα, ανοίγουν με την ηλικία, και πολλοί ιδιοκτήτες ενθουσιάζονται με αυτή τη σταδιακή μεταμόρφωση. Οι Γενειοφόροι Κόλλι είναι φημισμένοι για το αναπηδητικό, ενεργητικό τους βάδισμα και τη μόνιμα χαρούμενη διάθεσή τους. Διατηρούν έναν ενθουσιασμό σαν κουτάβι μέχρι τα γηρατειά τους, κερδίζοντας το παρατσούκλι 'αναπηδώντα Beardies.' Είναι φυσικά φιλικοί με ανθρώπους, άλλους σκύλους, ακόμα και αγνώστους, κάτι που τα κάνει φτωχούς φύλακες αλλά υπέροχους οικογενειακούς συντρόφους.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Bearded Collies need at least 1-2 hours of daily exercise, and they particularly enjoy hiking, playing in open fields, and participating in herding activities or agility courses. Their long, flowing coat is perhaps their most demanding feature, requiring thorough brushing at least 3-4 times per week — and daily during shedding — to prevent painful mats from forming close to the skin. Many owners keep their Beardies in a shorter 'puppy clip' to reduce grooming time while still preserving the breed's charming appearance. Beardies can be independent-minded and may try to do things their own way, so patient, positive, and consistent training methods work best. Harsh corrections can make them stubborn or shut down emotionally. They tend to be vocal dogs that bark to express excitement, alertness, or simply to communicate with their family. Early socialization is beneficial, though Beardies are naturally social and usually adapt well to new people and situations.",
    "care_el": "Οι Γενειοφόροι Κόλλι χρειάζονται τουλάχιστον 1-2 ώρες καθημερινής άσκησης, και ιδιαίτερα απολαμβάνουν πεζοπορία, παιχνίδι σε ανοιχτά χωράφια και συμμετοχή σε ποιμενικές δραστηριότητες ή αγώνες ευκινησίας. Το μακρύ, κυματιστό τρίχωμά τους είναι ίσως το πιο απαιτητικό χαρακτηριστικό τους, απαιτώντας διεξοδικό βούρτσισμα τουλάχιστον 3-4 φορές την εβδομάδα — και καθημερινά κατά την τριχόπτωση — για να αποφευχθούν οδυνηροί κόμποι κοντά στο δέρμα. Πολλοί ιδιοκτήτες κρατούν τα Beardie τους σε κοντότερο 'κούρεμα κουταβιού' για να μειώσουν τον χρόνο περιποίησης. Οι Beardie μπορεί να είναι ανεξάρτητοι στη σκέψη, οπότε υπομονετικές, θετικές και συνεπείς μέθοδοι εκπαίδευσης λειτουργούν καλύτερα. Σκληρές διορθώσεις μπορεί να τα κάνουν πεισματάρικα ή να κλείσουν συναισθηματικά. Τείνουν να είναι φωνακλά σκυλιά που γαυγίζουν για να εκφράσουν ενθουσιασμό, εγρήγορση ή απλά για να επικοινωνήσουν με την οικογένειά τους. Η πρώιμη κοινωνικοποίηση είναι ωφέλιμη, αν και οι Beardie είναι φυσικά κοινωνικοί.",
    "health_en": "Bearded Collies are generally healthy dogs but can be susceptible to several conditions. Hip dysplasia is the most commonly screened orthopedic condition in the breed. Hypothyroidism, where the thyroid gland doesn't produce enough hormones, is relatively common and can cause weight gain, lethargy, and coat changes — it's easily managed with daily medication. Addison's disease (hypoadrenocorticism) occurs more frequently in Beardies than in many other breeds and can be life-threatening if undiagnosed. Autoimmune conditions, including pemphigus and systemic lupus, are seen in some lines. Progressive retinal atrophy (PRA) and cataracts can affect vision. Regular veterinary screenings, including thyroid panels and eye exams, are recommended. Reputable breeders test for hip dysplasia and eye conditions and are transparent about any autoimmune history in their lines.",
    "health_el": "Οι Γενειοφόροι Κόλλι είναι γενικά υγιείς σκύλοι αλλά μπορεί να είναι ευαίσθητοι σε αρκετές παθήσεις. Η δυσπλασία ισχίου είναι η πιο συχνά ελεγχόμενη ορθοπεδική πάθηση στη ράτσα. Ο υποθυρεοειδισμός, όπου ο θυρεοειδής αδένας δεν παράγει αρκετές ορμόνες, είναι σχετικά κοινός και μπορεί να προκαλέσει αύξηση βάρους, λήθαργο και αλλαγές τριχώματος — αντιμετωπίζεται εύκολα με καθημερινή φαρμακευτική αγωγή. Η νόσος Addison (υπάδρενοφλοιοκορτικισμός) εμφανίζεται πιο συχνά στους Beardie από πολλές άλλες ράτσες και μπορεί να είναι απειλητική για τη ζωή αν δεν διαγνωστεί. Αυτοάνοσες παθήσεις, συμπεριλαμβανομένου πεμφιγοειδούς και συστηματικού λύκου, εμφανίζονται σε ορισμένες γραμμές. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) και ο καταρράκτης μπορεί να επηρεάσουν την όραση. Συνιστώνται τακτικοί κτηνιατρικοί έλεγχοι, συμπεριλαμβανομένων θυρεοειδικών πάνελ και οφθαλμολογικών εξετάσεων."
  },
  {
    "id": "beauceron",
    "slug": "beauceron",
    "name_en": "Beauceron",
    "name_el": "Μποσερόν",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Loyal", "Fearless", "Intelligent", "Protective", "Calm"],
    "temperament_el": ["Πιστός", "Ατρόμητος", "Έξυπνος", "Προστατευτικός", "Ήρεμος"],
    "description_en": "The Beauceron, also known as the Berger de Beauce or Bas Rouge ('red stockings'), is a large, powerful French herding and guardian breed that has been documented since the Renaissance period. They are one of the oldest and largest French sheepdogs, developed on the vast plains of the Beauce region south of Paris to both herd and protect large flocks of sheep. Beaucerons are distinguished by their muscular, athletic build, their short, dense black and tan (or harlequin) coat, and most notably their unique double dewclaws on the hind legs — a breed-defining trait required by the standard. They were extensively used by the French military in both World Wars as messenger dogs, mine detectors, and sentries. The Beauceron is a deeply loyal and confident dog that bonds intensely with its family while maintaining a natural wariness of strangers. They are highly intelligent and trainable but possess a strong, independent will that demands an experienced, firm handler.",
    "description_el": "Το Μποσερόν, γνωστό επίσης ως Berger de Beauce ή Bas Rouge ('κόκκινες κάλτσες'), είναι μια μεγάλη, δυνατή γαλλική ράτσα ποιμενικού και φύλακα που έχει τεκμηριωθεί από την εποχή της Αναγέννησης. Είναι ένα από τα παλαιότερα και μεγαλύτερα γαλλικά ποιμενικά σκυλιά, αναπτυγμένο στις αχανείς πεδιάδες της περιοχής Beauce νότια του Παρισιού τόσο για ποίμανση όσο και για προστασία μεγάλων κοπαδιών προβάτων. Τα Μποσερόν διακρίνονται για τη μυώδη, αθλητική σωματική τους διάπλαση, το κοντό, πυκνό μαύρο και ταν (ή αρλεκίνο) τρίχωμά τους, και κυρίως τα μοναδικά διπλά πίσω αντίχειρα — ένα χαρακτηριστικό που απαιτείται από το πρότυπο της ράτσας. Χρησιμοποιήθηκαν εκτενώς από τον γαλλικό στρατό και στους δύο Παγκοσμίους Πολέμους ως σκύλοι αγγελιοφόροι, ανιχνευτές ναρκών και φρουροί. Το Μποσερόν είναι βαθιά πιστός και σίγουρος σκύλος που δημιουργεί έντονο δεσμό με την οικογένειά του διατηρώντας φυσική επιφυλακτικότητα απέναντι σε αγνώστους. Είναι εξαιρετικά έξυπνοι και εκπαιδεύσιμοι αλλά διαθέτουν ισχυρή, ανεξάρτητη θέληση που απαιτεί έμπειρο, σταθερό χειριστή.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 3, "trainability": 5, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Beaucerons require substantial daily exercise — at least 1.5 to 2 hours of vigorous activity including long walks, runs, hikes, or structured work like herding, protection training, or agility. They are large, powerful dogs that need space and should not be confined to small apartments. Their short, dense double coat is relatively low-maintenance, requiring weekly brushing and only occasional bathing, though they do shed moderately year-round and more heavily during seasonal coat changes. Beaucerons are slow to mature mentally and may not reach full emotional adulthood until 2-3 years of age, requiring patience and consistency in training throughout this period. They respond best to firm but fair, reward-based training methods; harsh or punitive approaches can create a defensive or stubborn dog. Early socialization is absolutely critical for this naturally protective breed — exposure to many different people, animals, environments, and situations during puppyhood helps develop a well-balanced adult. They do best with experienced owners who understand large working breeds.",
    "care_el": "Τα Μποσερόν απαιτούν σημαντική καθημερινή άσκηση — τουλάχιστον 1,5 με 2 ώρες έντονης δραστηριότητας συμπεριλαμβανομένων μεγάλων βόλτων, τρεξίματος, πεζοπορίας ή δομημένης εργασίας όπως ποίμανση, εκπαίδευση προστασίας ή ευκινησία. Είναι μεγάλοι, δυνατοί σκύλοι που χρειάζονται χώρο και δεν πρέπει να περιορίζονται σε μικρά διαμερίσματα. Το κοντό, πυκνό διπλό τρίχωμά τους είναι σχετικά χαμηλής συντήρησης, απαιτώντας εβδομαδιαίο βούρτσισμα, αν και τρίχουν μέτρια όλο τον χρόνο. Τα Μποσερόν ωριμάζουν αργά νοητικά και μπορεί να μην φτάσουν πλήρη συναισθηματική ενηλικίωση μέχρι τα 2-3 χρόνια, απαιτώντας υπομονή και συνέπεια στην εκπαίδευση. Αποκρίνονται καλύτερα σε σταθερές αλλά δίκαιες, μεθόδους εκπαίδευσης βασισμένες σε ανταμοιβή· σκληρές ή τιμωρητικές προσεγγίσεις μπορεί να δημιουργήσουν αμυντικό ή πεισματάρικο σκύλο. Η πρώιμη κοινωνικοποίηση είναι απολύτως κρίσιμη για αυτή τη φυσικά προστατευτική ράτσα — η έκθεση σε πολλούς διαφορετικούς ανθρώπους, ζώα και περιβάλλοντα κατά την κουταβίστικη ηλικία βοηθά στην ανάπτυξη ισορροπημένου ενήλικα.",
    "health_en": "Beaucerons are generally a hardy breed but can be susceptible to several health conditions common in large dogs. Hip and elbow dysplasia are the primary orthopedic concerns, and responsible breeders should have breeding stock evaluated by OFA or PennHIP. Gastric dilatation-volvulus (bloat/GDV) is a serious, potentially fatal emergency that can affect deep-chested breeds like the Beauceron — feeding smaller, more frequent meals and avoiding vigorous exercise immediately after eating can help reduce risk. Dilated cardiomyopathy (DCM) and other cardiac conditions have been reported in some lines. Osteochondritis dissecans (OCD) can affect young, growing dogs. Some Beaucerons may develop allergies or skin conditions. Regular cardiac screenings, hip and elbow evaluations, and annual veterinary checkups are recommended. The Beauceron's double dewclaws should be monitored and kept trimmed to prevent snagging or injury.",
    "health_el": "Τα Μποσερόν είναι γενικά ανθεκτική ράτσα αλλά μπορεί να είναι ευαίσθητα σε αρκετές παθήσεις υγείας κοινές σε μεγάλους σκύλους. Η δυσπλασία ισχίου και αγκώνα είναι οι κύριες ορθοπεδικές ανησυχίες, και οι υπεύθυνοι εκτροφείς πρέπει να αξιολογούν τα ζώα αναπαραγωγής. Η γαστρική διάταση-συστροφή (φούσκωμα/GDV) είναι σοβαρό, δυνητικά θανατηφόρο επείγον που μπορεί να επηρεάσει ράτσες με βαθύ θώρακα όπως το Μποσερόν — η σίτιση μικρότερων, πιο συχνών γευμάτων και η αποφυγή έντονης άσκησης αμέσως μετά το φαγητό μπορεί να μειώσει τον κίνδυνο. Η διατατική μυοκαρδιοπάθεια (DCM) και άλλες καρδιακές παθήσεις έχουν αναφερθεί σε ορισμένες γραμμές. Η οστεοχόνδρωση μπορεί να επηρεάσει νεαρούς, αναπτυσσόμενους σκύλους. Συνιστώνται τακτικοί καρδιακοί έλεγχοι, αξιολογήσεις ισχίου και αγκώνα, και ετήσιοι κτηνιατρικοί έλεγχοι. Τα διπλά αντίχειρα του Μποσερόν πρέπει να παρακολουθούνται και να κόβονται για να αποφευχθεί τραυματισμός."
  },
  {
    "id": "belgian-malinois",
    "slug": "belgian-malinois",
    "name_en": "Belgian Malinois",
    "name_el": "Βελγικός Μαλινουά",
    "type": "dog",
    "origin": "Belgium",
    "originCode": "BE",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Confident", "Intelligent", "Hardworking", "Protective", "Alert"],
    "temperament_el": ["Σίγουρος", "Έξυπνος", "Εργατικός", "Προστατευτικός", "Επαγρύπνος"],
    "description_en": "The Belgian Malinois is one of four varieties of the Belgian Shepherd, named after the city of Malines (Mechelen) in Belgium. Originally bred for herding sheep, the Malinois has become the world's premier working dog, extensively used by military forces, police departments, and security agencies globally. They gained widespread public fame when a Malinois named Cairo participated in the Navy SEAL mission that located Osama bin Laden. Belgian Malinois are medium-sized, square-built dogs with a short fawn to mahogany coat and distinctive black mask and ears. They possess an extraordinary drive to work, exceptional intelligence, and remarkable physical abilities including impressive jumping and climbing capabilities. Malinois form intense, devoted bonds with their handlers but can be aloof with strangers. They are not recommended for casual pet homes or first-time dog owners due to their extremely high energy, drive, and need for structured activity and leadership.",
    "description_el": "Το Βελγικό Μαλινουά είναι μία από τις τέσσερις ποικιλίες του Βελγικού Ποιμενικού, πήρε το όνομά του από την πόλη Malines (Μεχελεν) στο Βέλγιο. Αρχικά εκτρεφόταν για ποίμανση προβάτων, το Μαλινουά έχει γίνει ο κορυφαίος εργαζόμενος σκύλος στον κόσμο, χρησιμοποιούμενο εκτενώς από στρατιωτικές δυνάμεις, αστυνομικά τμήματα και υπηρεσίες ασφαλείας παγκοσμίως. Κέρδισαν ευρεία δημοσιότητα όταν ένα Μαλινουά ονόματι Cairo συμμετείχε στην αποστολή Navy SEAL που εντόπισε τον Οσάμα μπιν Λάντεν. Τα Βελγικά Μαλινουά είναι μεσαίου μεγέθους, τετράγωνα σκυλιά με κοντό φαιό ώς μαόνι τρίχωμα και χαρακτηριστική μαύρη μάσκα και αυτιά. Διαθέτουν εξαιρετική ενέργεια για εργασία, εξαιρετική νοημοσύνη και αξιοσημείωτες σωματικές ικανότητες συμπεριλαμβανομένων εντυπωσιακών ικανοτήτων πήδησης και αναρρίχησης. Τα Μαλινουά δημιουργούν έντονους, αφοσιωμένους δεσμούς με τους χειριστές τους αλλά μπορεί να είναι απόμακρα με αγνώστους. Δεν συνιστώνται για τυπικά σπίτια κατοικίδιων ή πρωτάρηδες ιδιοκτήτες λόγω της εξαιρετικά υψηλής ενέργειας και ανάγκης για δομημένη δραστηριότητα.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 3, "trainability": 5, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Belgian Malinois require an extraordinary amount of daily exercise and mental stimulation — often 2+ hours of intense physical activity combined with training sessions, scent work, or protection exercises. A simple walk around the block is wholly insufficient for this breed. They excel in IPO/Schutzhund, French Ring Sport, agility, dock diving, and virtually any canine sport that challenges them physically and mentally. Their short, waterproof double coat is low-maintenance, requiring only weekly brushing and seasonal shedding management. Without adequate outlets for their energy and drive, Malinois can become anxious, destructive, or develop neurotic behaviors like excessive spinning or shadow chasing. They need clear, consistent leadership and benefit from structured daily routines. Socialization should begin early and continue throughout their lives to prevent over-protectiveness or reactivity. They are best suited to experienced handlers, working dog enthusiasts, or active individuals who can commit to the significant time and energy this breed demands.",
    "care_el": "Τα Βελγικά Μαλινουά απαιτούν εξαιρετική ποσότητα καθημερινής άσκησης και νοητικής διέγερσης — συχνά 2+ ώρες έντονης σωματικής δραστηριότητας σε συνδυασμό με εκπαιδευτικές συνεδρίες, εργασία όσφρησης ή ασκήσεις προστασίας. Μια απλή βόλτα στο τετράγωνο είναι εντελώς ανεπαρκής για αυτή τη ράτσα. Διαπρέπουν σε IPO/Schutzhund, French Ring Sport, ευκινησία, dock diving και σχεδόν κάθε αγώνισμα σκύλων. Το κοντό, αδιάβροχο διπλό τρίχωμά τους είναι χαμηλής συντήρησης, απαιτώντας μόνο εβδομαδιαίο βούρτσισμα. Χωρίς επαρκείς διεξόδους για την ενέργεια και την ορμή τους, τα Μαλινουά μπορεί να γίνουν αγχωμένα, καταστροφικά ή να αναπτύξουν νευρωτικές συμπεριφορές. Χρειάζονται σαφή, συνεπή ηγεσία και επωφελούνται από δομημένες καθημερινές ρουτίνες. Η κοινωνικοποίηση πρέπει να ξεκινά νωρίς και να συνεχίζεται σε όλη τη ζωή τους για να αποφευχθεί υπερπροστατευτικότητα ή αντιδραστικότητα. Είναι καταλληλότεροι για έμπειρους χειριστές ή ενεργά άτομα που μπορούν να αφιερώσουν σημαντικό χρόνο και ενέργεια.",
    "health_en": "Belgian Malinois are generally healthy dogs with good longevity for their size. Hip and elbow dysplasia are the most common orthopedic concerns and should be screened for in breeding stock. Progressive retinal atrophy (PRA) and cataracts can affect their vision, so annual eye exams are recommended. Some lines may be prone to epilepsy, which can usually be managed with medication. Hemangiosarcoma and other cancers occur at moderate rates. Pannus (chronic superficial keratitis) is occasionally seen. Working Malinois may be prone to injuries related to their intense physical activities, including torn cruciate ligaments and spinal issues. Proper conditioning, warm-up before intense exercise, and avoiding repetitive high-impact activities during growth can help prevent injuries. Choosing a breeder who performs OFA evaluations for hips, elbows, and eyes is essential for a healthy Belgian Malinois.",
    "health_el": "Τα Βελγικά Μαλινουά είναι γενικά υγιείς σκύλοι με καλή μακροζωία για το μέγεθός τους. Η δυσπλασία ισχίου και αγκώνα είναι οι πιο κοινές ορθοπεδικές ανησυχίες και πρέπει να ελέγχονται στα ζώα αναπαραγωγής. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) και ο καταρράκτης μπορεί να επηρεάσουν την όρασή τους, οπότε συνιστώνται ετήσιες οφθαλμολογικές εξετάσεις. Ορισμένες γραμμές μπορεί να είναι επιρρεπείς σε επιληψία, η οποία συνήθως μπορεί να αντιμετωπιστεί φαρμακευτικά. Αιμαγγειοσαρκώματα και άλλοι καρκίνοι εμφανίζονται σε μέτρια ποσοστά. Τα εργαζόμενα Μαλινουά μπορεί να είναι επιρρεπή σε τραυματισμούς σχετικούς με τις έντονες σωματικές δραστηριότητές τους, συμπεριλαμβανομένων ρήξεων χιαστού συνδέσμου και σπονδυλικών προβλημάτων. Η σωστή φυσική κατάσταση, η προθέρμανση πριν από έντονη άσκηση και η αποφυγή επαναλαμβανόμενων δραστηριοτήτων υψηλού αντίκτυπου κατά την ανάπτυξη μπορούν να βοηθήσουν στην πρόληψη τραυματισμών."
  },
  {
    "id": "belgian-sheepdog-groenendael",
    "slug": "belgian-sheepdog-groenendael",
    "name_en": "Belgian Sheepdog (Groenendael)",
    "name_el": "Βελγικός Ποιμενικός (Γκρενενντάελ)",
    "type": "dog",
    "origin": "Belgium",
    "originCode": "BE",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Intelligent", "Loyal", "Alert", "Protective", "Sensitive"],
    "temperament_el": ["Έξυπνος", "Πιστός", "Επαγρύπνος", "Προστατευτικός", "Ευαίσθητος"],
    "description_en": "The Belgian Sheepdog, known internationally as the Groenendael, is the long-haired black variety of the Belgian Shepherd, named after the village of Groenendael near Brussels where breeder Nicolas Rose established the foundation of the breed in the late 1800s. These strikingly beautiful dogs have a profuse, flowing black coat that gives them an elegant, almost regal appearance. They were originally bred for herding sheep but quickly proved themselves as versatile working dogs, serving in World War I as ambulance dogs, messengers, and sentry dogs. Belgian Sheepdogs are exceptionally intelligent and sensitive, forming deep emotional bonds with their families. They are alert and naturally protective without being overly aggressive, making them excellent watchdogs. However, they can be reserved or cautious with strangers, and some individuals may be shy if not properly socialized. Their combination of beauty, intelligence, and devotion makes them outstanding companions for dedicated, active owners.",
    "description_el": "Ο Βελγικός Ποιμενικός, γνωστός διεθνώς ως Γκρενενντάελ, είναι η μακρυτρίχωμη μαύρη ποικιλία του Βελγικού Ποιμενικού, πήρε το όνομά του από το χωριό Groenendael κοντά στις Βρυξέλλες όπου ο εκτροφέας Nicolas Rose εγκαθίδρυσε τη βάση της ράτσας στα τέλη του 1800. Αυτοί οι εντυπωσιακά όμορφοι σκύλοι έχουν πλούσιο, κυματιστό μαύρο τρίχωμα που τους δίνει κομψή, σχεδόν βασιλική εμφάνιση. Αρχικά εκτράφηκαν για ποίμανση προβάτων αλλά γρήγορα απέδειξαν τον εαυτό τους ως ευέλικτους εργατικούς σκύλους, υπηρετώντας στον Α' Παγκόσμιο Πόλεμο ως σκύλοι ασθενοφόρου, αγγελιοφόροι και φρουροί. Οι Βελγικοί Ποιμενικοί είναι εξαιρετικά έξυπνοι και ευαίσθητοι, δημιουργώντας βαθιούς συναισθηματικούς δεσμούς με τις οικογένειές τους. Είναι επαγρύπνοι και φυσικά προστατευτικοί χωρίς να είναι υπερβολικά επιθετικοί. Ωστόσο, μπορεί να είναι επιφυλακτικοί ή προσεκτικοί με αγνώστους, και ορισμένα άτομα μπορεί να είναι ντροπαλά αν δεν κοινωνικοποιηθούν σωστά. Ο συνδυασμός ομορφιάς, νοημοσύνης και αφοσίωσής τους τους καθιστά εξαιρετικούς συντρόφους για αφοσιωμένους, ενεργούς ιδιοκτήτες.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 3, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Belgian Sheepdogs need at least 1-2 hours of vigorous daily exercise including running, hiking, or structured training sessions. They excel in obedience, agility, herding, tracking, and as therapy dogs. Their luxurious long black coat requires brushing 2-3 times per week to prevent tangles and mats, with more frequent grooming during their heavy shedding periods in spring and fall. They are highly sensitive dogs that respond best to positive reinforcement training — harsh corrections can damage their trust and confidence. Mental stimulation through training, puzzle toys, and interactive games is essential to keep their sharp minds engaged. They are devoted family dogs but need early and ongoing socialization to prevent shyness or over-protectiveness. Belgian Sheepdogs are not suited to being left alone for long periods and may develop separation anxiety if they don't receive enough attention and companionship.",
    "care_el": "Οι Βελγικοί Ποιμενικοί (Γκρενενντάελ) χρειάζονται τουλάχιστον 1-2 ώρες έντονης καθημερινής άσκησης συμπεριλαμβανομένου τρεξίματος, πεζοπορίας ή δομημένων εκπαιδευτικών συνεδριών. Διαπρέπουν στην υπακοή, την ευκινησία, την ποίμανση, την ιχνηλασία και ως σκύλοι θεραπείας. Το πολυτελές μακρύ μαύρο τρίχωμά τους απαιτεί βούρτσισμα 2-3 φορές την εβδομάδα για να αποφευχθούν κόμποι, με πιο συχνή περιποίηση κατά τις περιόδους έντονης τριχόπτωσης. Είναι εξαιρετικά ευαίσθητοι σκύλοι που ανταποκρίνονται καλύτερα σε εκπαίδευση θετικής ενίσχυσης — σκληρές διορθώσεις μπορεί να βλάψουν την εμπιστοσύνη και την αυτοπεποίθησή τους. Η νοητική διέγερση μέσω εκπαίδευσης, παιχνιδιών παζλ και διαδραστικών παιχνιδιών είναι απαραίτητη. Είναι αφοσιωμένοι οικογενειακοί σκύλοι αλλά χρειάζονται πρώιμη κοινωνικοποίηση για να αποφευχθεί ντροπαλότητα ή υπερπροστατευτικότητα. Δεν είναι κατάλληλοι να μένουν μόνοι για μεγάλες περιόδους.",
    "health_en": "Belgian Sheepdogs can be prone to hip and elbow dysplasia, with screening recommended for all breeding stock. Epilepsy is one of the more significant health concerns in the breed, with seizures typically first appearing between ages 1-5. Progressive retinal atrophy (PRA) and cataracts are eye conditions that can affect the breed. Thyroid dysfunction, particularly hypothyroidism, is seen in some lines and can cause lethargy, weight gain, and coat changes. Some Belgian Sheepdogs may develop allergies or skin conditions, particularly those related to environmental allergens. Gastric issues including bloat can occur in some individuals. Cancer, including hemangiosarcoma and lymphosarcoma, appears at moderate rates. Regular veterinary checkups, thyroid screening, hip evaluations, and annual eye exams are recommended. Choosing a breeder who health-tests parent dogs and is transparent about health histories is important for a healthy puppy.",
    "health_el": "Οι Βελγικοί Ποιμενικοί (Γκρενενντάελ) μπορεί να είναι επιρρεπείς σε δυσπλασία ισχίου και αγκώνα, με έλεγχο που συνιστάται για όλα τα ζώα αναπαραγωγής. Η επιληψία είναι μία από τις πιο σημαντικές ανησυχίες υγείας στη ράτσα, με κρίσεις που εμφανίζονται τυπικά για πρώτη φορά μεταξύ 1-5 ετών. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) και ο καταρράκτης είναι οφθαλμολογικές παθήσεις που μπορεί να επηρεάσουν τη ράτσα. Η θυρεοειδική δυσλειτουργία, ιδιαίτερα ο υποθυρεοειδισμός, εμφανίζεται σε ορισμένες γραμμές. Ορισμένοι Βελγικοί Ποιμενικοί μπορεί να αναπτύξουν αλλεργίες ή δερματικές παθήσεις. Γαστρικά προβλήματα συμπεριλαμβανομένου φουσκώματος μπορεί να εμφανιστούν. Καρκίνος, συμπεριλαμβανομένου αιμαγγειοσαρκώματος, εμφανίζεται σε μέτρια ποσοστά. Συνιστώνται τακτικοί κτηνιατρικοί έλεγχοι, θυρεοειδικός έλεγχος, αξιολογήσεις ισχίου και ετήσιες οφθαλμολογικές εξετάσεις."
  },
  {
    "id": "belgian-tervuren",
    "slug": "belgian-tervuren",
    "name_en": "Belgian Tervuren",
    "name_el": "Βελγικός Τερβιούρεν",
    "type": "dog",
    "origin": "Belgium",
    "originCode": "BE",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Intelligent", "Energetic", "Loyal", "Alert", "Sensitive"],
    "temperament_el": ["Έξυπνος", "Ενεργητικός", "Πιστός", "Επαγρύπνος", "Ευαίσθητος"],
    "description_en": "The Belgian Tervuren is the long-haired fawn-to-mahogany variety of the Belgian Shepherd, named after the village of Tervuren east of Brussels. They are considered by many fanciers to be the most elegant of the four Belgian Shepherd varieties, with their rich, flowing coat that features striking black overlay, giving them a dramatic, wolf-like appearance. Developed in the late 1800s, Tervurens were originally used for herding but have proven equally adept at obedience, agility, tracking, herding trials, and protection work. They are exceptionally intelligent and sensitive dogs that form profound bonds with their families, often described as reading their owner's emotions with uncanny accuracy. Tervurens are active, alert, and devoted but can be reserved with strangers. They possess a strong work ethic and thrive when given meaningful tasks or challenges. Their combination of beauty, athleticism, and intelligence makes them highly competitive in the show ring and performance events alike.",
    "description_el": "Το Βελγικό Τερβιούρεν είναι η μακρυτρίχωμη φαιό-προς-μαόνι ποικιλία του Βελγικού Ποιμενικού, πήρε το όνομά του από το χωριό Tervuren ανατολικά των Βρυξελλών. Θεωρείται από πολλούς λάτρεις ως η πιο κομψή από τις τέσσερις ποικιλίες Βελγικού Ποιμενικού, με το πλούσιο, κυματιστό τρίχωμα που διαθέτει εντυπωσιακή μαύρη επικάλυψη, δίνοντάς τους δραματική, λυκίσια εμφάνιση. Αναπτύχθηκε στα τέλη του 1800, τα Τερβιούρεν χρησιμοποιούνταν αρχικά για ποίμανση αλλά έχουν αποδειχθεί εξίσου ικανά στην υπακοή, ευκινησία, ιχνηλασία και εργασία προστασίας. Είναι εξαιρετικά έξυπνοι και ευαίσθητοι σκύλοι που δημιουργούν βαθιούς δεσμούς με τις οικογένειές τους, συχνά περιγράφονται ότι διαβάζουν τα συναισθήματα του ιδιοκτήτη τους με εκπληκτική ακρίβεια. Τα Τερβιούρεν είναι ενεργά, επαγρύπνα και αφοσιωμένα αλλά μπορεί να είναι επιφυλακτικά με αγνώστους. Ο συνδυασμός ομορφιάς, αθλητισμού και νοημοσύνης τα καθιστά εξαιρετικά ανταγωνιστικά σε εκθέσεις και αγωνίσματα.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 3, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Belgian Tervurens need substantial daily exercise — at least 1-2 hours of vigorous activity including running, hiking, or advanced training work. They are natural athletes that thrive in agility, herding, tracking, and obedience competitions. Their beautiful long coat requires thorough brushing 2-3 times per week, with daily grooming during heavy shedding seasons. They are highly sensitive dogs that respond best to gentle, positive training methods — harsh or punitive approaches will damage the relationship and may cause the dog to shut down or become fearful. Mental stimulation is crucial; Tervurens become bored and destructive without adequate intellectual challenges. They form intensely close bonds with their families and do not tolerate being left alone for extended periods. Early, extensive socialization is important to prevent shyness or nervousness, as some Tervurens can be cautious in new situations.",
    "care_el": "Τα Βελγικά Τερβιούρεν χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1-2 ώρες έντονης δραστηριότητας. Είναι φυσικοί αθλητές που ευδοκιμούν στην ευκινησία, ποίμανση, ιχνηλασία και αγώνες υπακοής. Το όμορφο μακρύ τρίχωμά τους απαιτεί διεξοδικό βούρτσισμα 2-3 φορές την εβδομάδα, με καθημερινή περιποίηση κατά τις εποχές έντονης τριχόπτωσης. Είναι εξαιρετικά ευαίσθητοι σκύλοι που ανταποκρίνονται καλύτερα σε ήπιες, θετικές μεθόδους εκπαίδευσης — σκληρές ή τιμωρητικές προσεγγίσεις θα βλάψουν τη σχέση. Η νοητική διέγερση είναι κρίσιμη· τα Τερβιούρεν πλήττουν και γίνονται καταστροφικά χωρίς επαρκείς πνευματικές προκλήσεις. Δημιουργούν εντόνως στενούς δεσμούς με τις οικογένειές τους και δεν ανέχονται να μένουν μόνα για παρατεταμένες περιόδους. Η πρώιμη, εκτενής κοινωνικοποίηση είναι σημαντική για να αποφευχθεί ντροπαλότητα ή νευρικότητα.",
    "health_en": "Belgian Tervurens share similar health considerations with the other Belgian Shepherd varieties. Hip and elbow dysplasia are primary orthopedic concerns, and breeding dogs should be evaluated by OFA. Epilepsy is a notable concern in Tervurens, with seizures that may require lifelong medication management. Progressive retinal atrophy (PRA) and cataracts can affect vision. Thyroid dysfunction, particularly hypothyroidism, is seen in some lines. Some Tervurens may have sensitivity to anesthesia, which should be discussed with your veterinarian before any surgical procedure. Allergies and skin conditions can occur. Bloat, while less common than in some larger breeds, is a possibility. Regular health screenings including hip evaluations, thyroid panels, and comprehensive eye exams are recommended for all Belgian Tervurens.",
    "health_el": "Τα Βελγικά Τερβιούρεν μοιράζονται παρόμοιες ανησυχίες υγείας με τις άλλες ποικιλίες Βελγικού Ποιμενικού. Η δυσπλασία ισχίου και αγκώνα είναι κύριες ορθοπεδικές ανησυχίες. Η επιληψία είναι αξιοσημείωτη ανησυχία στα Τερβιούρεν, με κρίσεις που μπορεί να απαιτούν δια βίου φαρμακευτική διαχείριση. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) και ο καταρράκτης μπορεί να επηρεάσουν την όραση. Η θυρεοειδική δυσλειτουργία, ιδιαίτερα ο υποθυρεοειδισμός, εμφανίζεται σε ορισμένες γραμμές. Ορισμένα Τερβιούρεν μπορεί να έχουν ευαισθησία στην αναισθησία, η οποία πρέπει να συζητηθεί με τον κτηνίατρό σας. Αλλεργίες και δερματικές παθήσεις μπορεί να εμφανιστούν. Συνιστώνται τακτικοί έλεγχοι υγείας συμπεριλαμβανομένων αξιολογήσεων ισχίου, θυρεοειδικών πάνελ και ολοκληρωμένων οφθαλμολογικών εξετάσεων."
  },
  {
    "id": "belgian-laekenois",
    "slug": "belgian-laekenois",
    "name_en": "Belgian Laekenois",
    "name_el": "Βελγικός Λακενουά",
    "type": "dog",
    "origin": "Belgium",
    "originCode": "BE",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Loyal", "Alert", "Intelligent", "Protective", "Energetic"],
    "temperament_el": ["Πιστός", "Επαγρύπνος", "Έξυπνος", "Προστατευτικός", "Ενεργητικός"],
    "description_en": "The Belgian Laekenois (pronounced 'Lak-in-wah') is the rarest of the four Belgian Shepherd varieties, distinguished by its unique rough, wiry, tousled coat in shades of fawn with traces of black overlay. Named after the Château de Laeken, the residence of the Belgian royal family, these dogs were originally tasked with guarding linen drying in the fields and herding sheep around the royal estates. The Laekenois was the last of the four Belgian Shepherd varieties to receive AKC recognition, in 2020. Despite their rarity, Laekenois are equally capable working dogs, sharing the intelligence, drive, and versatility of their Belgian Shepherd cousins. They are loyal and protective with their families, naturally alert and watchful, and can be reserved with people they don't know. Their rarity means finding a well-bred Laekenois requires patience and research, but those who do are rewarded with a devoted and unique companion.",
    "description_el": "Ο Βελγικός Λακενουά (προφέρεται 'Λάκ-εν-ουά') είναι η πιο σπάνια από τις τέσσερις ποικιλίες Βελγικού Ποιμενικού, διακρίνεται από το μοναδικό τραχύ, σκληρό, ατημέλητο τρίχωμα σε αποχρώσεις φαιού με ίχνη μαύρης επικάλυψης. Πήρε το όνομά του από το Château de Laeken, την κατοικία της βελγικής βασιλικής οικογένειας, αυτοί οι σκύλοι αρχικά είχαν ως αποστολή τη φύλαξη λινών που στέγνωναν στα χωράφια και την ποίμανση προβάτων γύρω από τα βασιλικά κτήματα. Ο Λακενουά ήταν ο τελευταίος από τις τέσσερις ποικιλίες Βελγικού Ποιμενικού που έλαβε αναγνώριση AKC, το 2020. Παρά τη σπανιότητά τους, οι Λακενουά είναι εξίσου ικανοί εργατικοί σκύλοι, μοιραζόμενοι τη νοημοσύνη, την ορμή και την ευελιξία των ξαδέλφων τους Βελγικών Ποιμενικών. Είναι πιστοί και προστατευτικοί με τις οικογένειές τους, φυσικά επαγρύπνοι και παρατηρητικοί, και μπορεί να είναι επιφυλακτικοί με ανθρώπους που δεν γνωρίζουν.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 3, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Belgian Laekenois need regular, vigorous exercise — at least 1-2 hours daily of running, hiking, or structured training activities. Like all Belgian Shepherds, they thrive with a job to do and excel in obedience, agility, herding, and tracking. Their wiry coat requires regular brushing and periodic hand-stripping to maintain proper texture and appearance — clipping is not recommended for show dogs as it softens the coat. They are intelligent and eager to learn but can be sensitive to harsh training methods. Early and thorough socialization is essential to develop a confident, well-adjusted adult, as Laekenois can be naturally cautious with new people and situations. They form close bonds with their families and should not be isolated or left alone for extended periods. Consistent, positive training and clear expectations help bring out the best in this rare and rewarding breed.",
    "care_el": "Οι Βελγικοί Λακενουά χρειάζονται τακτική, έντονη άσκηση — τουλάχιστον 1-2 ώρες καθημερινά τρέξιμο, πεζοπορία ή δομημένες εκπαιδευτικές δραστηριότητες. Όπως όλοι οι Βελγικοί Ποιμενικοί, ευδοκιμούν με δουλειά και διαπρέπουν στην υπακοή, ευκινησία, ποίμανση και ιχνηλασία. Το τραχύ τρίχωμά τους απαιτεί τακτικό βούρτσισμα και περιοδικό hand-stripping για να διατηρήσει τη σωστή υφή και εμφάνιση. Είναι έξυπνοι και πρόθυμοι να μάθουν αλλά μπορεί να είναι ευαίσθητοι σε σκληρές μεθόδους εκπαίδευσης. Η πρώιμη και διεξοδική κοινωνικοποίηση είναι απαραίτητη για την ανάπτυξη σίγουρου, καλά προσαρμοσμένου ενήλικα, καθώς οι Λακενουά μπορεί να είναι φυσικά προσεκτικοί με νέους ανθρώπους και καταστάσεις. Δημιουργούν στενούς δεσμούς με τις οικογένειές τους και δεν πρέπει να απομονώνονται.",
    "health_en": "Belgian Laekenois share the same health profile as the other Belgian Shepherd varieties. Hip and elbow dysplasia should be screened in breeding stock through OFA evaluations. Epilepsy is a concern across all Belgian Shepherd varieties, including the Laekenois. Eye conditions such as progressive retinal atrophy (PRA) and cataracts may occur. Thyroid disorders, particularly hypothyroidism, should be monitored through regular blood work. Due to the Laekenois' small gene pool resulting from their rarity, genetic diversity is an important consideration for breeders. Some individuals may be prone to allergies or skin sensitivity. Regular veterinary care, comprehensive health testing of breeding pairs, and working with knowledgeable breed-specific breeders are the best ways to ensure a healthy Laekenois.",
    "health_el": "Οι Βελγικοί Λακενουά μοιράζονται το ίδιο προφίλ υγείας με τις άλλες ποικιλίες Βελγικού Ποιμενικού. Η δυσπλασία ισχίου και αγκώνα πρέπει να ελέγχεται στα ζώα αναπαραγωγής. Η επιληψία είναι ανησυχία σε όλες τις ποικιλίες Βελγικού Ποιμενικού. Οφθαλμολογικές παθήσεις όπως προοδευτική ατροφία αμφιβληστροειδούς (PRA) και καταρράκτης μπορεί να εμφανιστούν. Οι θυρεοειδικές διαταραχές πρέπει να παρακολουθούνται μέσω τακτικών αιματολογικών εξετάσεων. Λόγω του μικρού γενετικού αποθέματος του Λακενουά που προκύπτει από τη σπανιότητά του, η γενετική ποικιλομορφία είναι σημαντικό θέμα για τους εκτροφείς. Η τακτική κτηνιατρική φροντίδα και ο ολοκληρωμένος έλεγχος υγείας είναι οι καλύτεροι τρόποι για να εξασφαλιστεί ένας υγιής Λακενουά."
  },
  {
    "id": "bergamasco-shepherd",
    "slug": "bergamasco-shepherd",
    "name_en": "Bergamasco Shepherd",
    "name_el": "Ποιμενικός του Μπέργκαμο",
    "type": "dog",
    "origin": "Italy",
    "originCode": "IT",
    "images": [],
    "size": "large",
    "lifespan": "13-15 years",
    "temperament_en": ["Patient", "Loyal", "Intelligent", "Calm", "Watchful"],
    "temperament_el": ["Υπομονετικός", "Πιστός", "Έξυπνος", "Ήρεμος", "Επαγρύπνος"],
    "description_en": "The Bergamasco Shepherd is an ancient Italian herding breed with a history spanning over 2,000 years, originating in the mountainous Bergamo region of the Italian Alps near Milan. They are instantly recognizable by their extraordinary coat, which naturally forms three types of hair — a fine, oily undercoat, long harsh 'goat hair,' and a woolly outer coat — that weave together to create distinctive flat mats or 'flocks' covering the entire body. This remarkable coat served as insulation against the harsh Alpine cold and as armor against predator bites. Bergamascos are patient, intelligent, and remarkably calm dogs that were traditionally left alone with their flocks for extended periods, developing strong independent thinking and problem-solving abilities. They are loyal and affectionate with their families, naturally watchful and protective without being aggressive, and typically gentle and patient with children. The breed nearly went extinct after World War II but was saved by dedicated Italian breeders, particularly Dr. Maria Andreoli.",
    "description_el": "Ο Ποιμενικός του Μπέργκαμο είναι μια αρχαία ιταλική ποιμενική ράτσα με ιστορία που εκτείνεται σε περισσότερα από 2.000 χρόνια, κατάγεται από την ορεινή περιοχή Μπέργκαμο των Ιταλικών Άλπεων κοντά στο Μιλάνο. Αναγνωρίζονται αμέσως από το εξαιρετικό τρίχωμά τους, που σχηματίζει φυσικά τρεις τύπους τρίχας — ένα λεπτό, ελαιώδες εσωτερικό τρίχωμα, μακριά σκληρή 'τρίχα κατσίκας' και ένα μάλλινο εξωτερικό τρίχωμα — που πλέκονται μαζί δημιουργώντας χαρακτηριστικές επίπεδες πέτσες ή 'κοπάδια' που καλύπτουν ολόκληρο το σώμα. Αυτό το αξιοσημείωτο τρίχωμα χρησίμευε ως μόνωση ενάντια στο σκληρό αλπικό κρύο και ως πανοπλία ενάντια σε δαγκώματα αρπακτικών. Οι Ποιμενικοί του Μπέργκαμο είναι υπομονετικοί, έξυπνοι και αξιοσημείωτα ήρεμοι σκύλοι που παραδοσιακά αφήνονταν μόνοι με τα κοπάδια τους για παρατεταμένες περιόδους, αναπτύσσοντας ισχυρή ανεξάρτητη σκέψη. Είναι πιστοί και στοργικοί με τις οικογένειές τους, φυσικά παρατηρητικοί και προστατευτικοί χωρίς να είναι επιθετικοί, και τυπικά ήπιοι και υπομονετικοί με τα παιδιά. Η ράτσα σχεδόν εξαφανίστηκε μετά τον Β' Παγκόσμιο Πόλεμο αλλά σώθηκε από αφοσιωμένους Ιταλούς εκτροφείς.",
    "characteristics": { "energy": 3, "grooming": 5, "friendliness": 4, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Bergamasco Shepherds need moderate daily exercise — they are not hyperactive dogs but enjoy walks, hikes, and play sessions. Their remarkable coat is actually less work than it appears once the flocks have fully formed (typically by age 3-5); the mats should never be brushed out, only separated by hand to prevent them from becoming too thick. The coat does not shed in the traditional sense and is considered hypoallergenic by many owners. Bathing should be infrequent and the coat must be thoroughly dried (which can take 24+ hours). They are intelligent dogs that can be independent thinkers, so patient, consistent training with positive reinforcement works best. Early socialization helps them become confident adults. Bergamascos are generally calm indoors and adapt well to family life, but they need regular outdoor time and interaction with their people. They can be reserved with strangers but are rarely aggressive.",
    "care_el": "Οι Ποιμενικοί του Μπέργκαμο χρειάζονται μέτρια καθημερινή άσκηση — δεν είναι υπερκινητικοί σκύλοι αλλά απολαμβάνουν βόλτες, πεζοπορίες και παιχνίδι. Το αξιοσημείωτο τρίχωμά τους είναι στην πραγματικότητα λιγότερη δουλειά απ' ό,τι φαίνεται μόλις σχηματιστούν πλήρως οι πέτσες (τυπικά ως τα 3-5 χρόνια)· οι πέτσες δεν πρέπει ποτέ να βουρτσίζονται, μόνο να διαχωρίζονται με το χέρι. Το τρίχωμα δεν τρίχει με τον παραδοσιακό τρόπο και θεωρείται υποαλλεργικό από πολλούς ιδιοκτήτες. Το μπάνιο πρέπει να είναι σπάνιο και το τρίχωμα πρέπει να στεγνώσει πλήρως (που μπορεί να πάρει 24+ ώρες). Είναι έξυπνοι σκύλοι που μπορεί να είναι ανεξάρτητοι στη σκέψη, οπότε υπομονετική, συνεπής εκπαίδευση με θετική ενίσχυση λειτουργεί καλύτερα. Η πρώιμη κοινωνικοποίηση τους βοηθά να γίνουν σίγουροι ενήλικες. Είναι γενικά ήρεμοι σε εσωτερικούς χώρους και προσαρμόζονται καλά στην οικογενειακή ζωή.",
    "health_en": "Bergamasco Shepherds are one of the healthiest purebred dog breeds, largely due to the genetic diversity maintained by responsible breeders and the breed's long, relatively unmodified history. Hip dysplasia is the most commonly screened condition, though incidence is lower than in many large breeds. Eye conditions are rare but should be checked periodically. The breed's unique coat can harbor moisture and bacteria if not properly maintained, potentially leading to skin infections — proper coat care and ensuring the dog dries fully after getting wet are important preventive measures. Ear infections can occur if the heavy ear flap traps moisture. Bloat is a possibility in any large, deep-chested breed. Overall, Bergamascos are remarkably robust and long-lived for their size, often living 13-15 years with good care and proper nutrition.",
    "health_el": "Οι Ποιμενικοί του Μπέργκαμο είναι μία από τις πιο υγιείς καθαρόαιμες ράτσες σκύλων, σε μεγάλο βαθμό λόγω της γενετικής ποικιλομορφίας που διατηρείται από υπεύθυνους εκτροφείς. Η δυσπλασία ισχίου είναι η πιο συχνά ελεγχόμενη πάθηση, αν και η συχνότητα είναι χαμηλότερη από πολλές μεγάλες ράτσες. Οφθαλμολογικές παθήσεις είναι σπάνιες αλλά πρέπει να ελέγχονται περιοδικά. Το μοναδικό τρίχωμα της ράτσας μπορεί να φιλοξενήσει υγρασία και βακτήρια αν δεν συντηρηθεί σωστά, οδηγώντας σε δερματικές λοιμώξεις — η σωστή φροντίδα τριχώματος και η πλήρης ξήρανση μετά το βρέξιμο είναι σημαντικά προληπτικά μέτρα. Λοιμώξεις αυτιών μπορεί να εμφανιστούν αν το βαρύ πτερύγιο του αυτιού παγιδεύει υγρασία. Το φούσκωμα είναι πιθανό σε κάθε μεγάλη ράτσα. Συνολικά, οι Ποιμενικοί του Μπέργκαμο είναι αξιοσημείωτα εύρωστοι και μακρόβιοι για το μέγεθός τους."
  },
  {
    "id": "berger-picard",
    "slug": "berger-picard",
    "name_en": "Berger Picard",
    "name_el": "Πικαρντικός Ποιμενικός",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "medium",
    "lifespan": "12-13 years",
    "temperament_en": ["Lively", "Loyal", "Good-natured", "Independent", "Alert"],
    "temperament_el": ["Ζωηρός", "Πιστός", "Καλόκαρδος", "Ανεξάρτητος", "Επαγρύπνος"],
    "description_en": "The Berger Picard (pronounced 'Bare-ZHAY Pee-CARR') is one of the oldest French herding breeds, with origins in the Picardy region of northeastern France dating back to the 9th century when they were likely brought by Celts and Franks. They are medium-sized, athletic dogs with a distinctive rough, tousled coat, upright ears that give them an alert, curious expression, and an endearing, slightly scruffy appearance. The breed nearly went extinct after both World Wars devastated the Picardy region, and they remain relatively rare today with only a few thousand registered worldwide. Berger Picards gained international attention after the 2005 movie 'Because of Winn-Dixie' featured a Picard in the title role. They are lively, loyal, and good-natured dogs with a charming sense of humor, but they can also be independent and stubborn — they will listen to you, consider your request, and then decide whether they agree. This independent thinking, a trait essential for herding dogs working at a distance from their shepherds, makes them both entertaining and occasionally exasperating companions.",
    "description_el": "Ο Πικαρντικός Ποιμενικός (προφέρεται 'Μπαρ-ΖΕΪ Πι-ΚΑΡ') είναι μία από τις παλαιότερες γαλλικές ποιμενικές ράτσες, με καταγωγή από την περιοχή Πικαρδία της βορειοανατολικής Γαλλίας που χρονολογείται στον 9ο αιώνα. Είναι μεσαίου μεγέθους, αθλητικοί σκύλοι με χαρακτηριστικό τραχύ, ατημέλητο τρίχωμα, όρθια αυτιά που τους δίνουν μια επαγρύπνη, περίεργη έκφραση, και μια γοητευτική, ελαφρώς ατημέλητη εμφάνιση. Η ράτσα σχεδόν εξαφανίστηκε αφού και οι δύο Παγκόσμιοι Πόλεμοι κατέστρεψαν την περιοχή Πικαρδία, και παραμένουν σχετικά σπάνιοι σήμερα. Οι Πικαρντικοί Ποιμενικοί κέρδισαν διεθνή προσοχή μετά την ταινία 'Because of Winn-Dixie' του 2005. Είναι ζωηροί, πιστοί και καλόκαρδοι σκύλοι με γοητευτική αίσθηση χιούμορ, αλλά μπορεί επίσης να είναι ανεξάρτητοι και πεισματάρηδες — θα σας ακούσουν, θα εξετάσουν το αίτημά σας, και μετά θα αποφασίσουν αν συμφωνούν. Αυτή η ανεξάρτητη σκέψη, ένα χαρακτηριστικό απαραίτητο για ποιμενικούς σκύλους που εργάζονται σε απόσταση, τα καθιστά τόσο διασκεδαστικά όσο και περιστασιακά εξοργιστικά ως σύντροφοι.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 4, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Berger Picards need regular daily exercise — at least an hour of walking, jogging, hiking, or play. They enjoy having a purpose and do well in agility, herding, rally, and nose work competitions. Their wiry, rough coat is surprisingly low-maintenance, requiring only weekly brushing to remove loose hair and occasional hand-stripping to maintain texture. They should not be clipped or trimmed excessively as this ruins the natural rustic coat. Picards are sensitive souls who form deep bonds with their families and can be emotionally affected by household stress or conflict. They respond best to positive, patient training with plenty of variety — repetitive drills bore them quickly. Early socialization is important as some Picards can be shy or cautious in unfamiliar situations. They are good with children and other animals when raised together, and they adapt well to both rural and urban environments as long as their exercise needs are met.",
    "care_el": "Οι Πικαρντικοί Ποιμενικοί χρειάζονται τακτική καθημερινή άσκηση — τουλάχιστον μία ώρα περπατήματος, τζόγκινγκ, πεζοπορίας ή παιχνιδιού. Απολαμβάνουν να έχουν σκοπό και τα πάνε καλά σε ευκινησία, ποίμανση, rally και αγώνες εργασίας μύτης. Το τραχύ τρίχωμά τους είναι εκπληκτικά χαμηλής συντήρησης, απαιτώντας μόνο εβδομαδιαίο βούρτσισμα και περιστασιακό hand-stripping. Δεν πρέπει να κουρεύονται υπερβολικά καθώς αυτό καταστρέφει το φυσικό ρουστίκ τρίχωμα. Οι Picard είναι ευαίσθητες ψυχές που δημιουργούν βαθιούς δεσμούς με τις οικογένειές τους. Ανταποκρίνονται καλύτερα σε θετική, υπομονετική εκπαίδευση με πολλή ποικιλία — οι επαναλαμβανόμενες ασκήσεις τα πλήττουν γρήγορα. Η πρώιμη κοινωνικοποίηση είναι σημαντική καθώς ορισμένοι Picard μπορεί να είναι ντροπαλοί σε άγνωστες καταστάσεις. Προσαρμόζονται καλά τόσο σε αγροτικά όσο και σε αστικά περιβάλλοντα.",
    "health_en": "Berger Picards are generally a healthy, hardy breed with relatively few breed-specific health issues, likely due to their ancient lineage and the absence of extreme physical modifications through selective breeding. Hip dysplasia is the primary orthopedic concern and should be screened in breeding stock. Progressive retinal atrophy (PRA) can affect some lines, so eye examinations are recommended for breeding dogs. Some Picards may develop allergies or skin sensitivities. The breed can occasionally be affected by autoimmune conditions. Due to their relative rarity, maintaining genetic diversity is an important consideration for breeders. Regular veterinary checkups, a balanced diet, appropriate exercise, and choosing a breeder who performs health testing help ensure a long, healthy life. Berger Picards typically live 12-13 years with good care.",
    "health_el": "Οι Πικαρντικοί Ποιμενικοί είναι γενικά υγιής, ανθεκτική ράτσα με σχετικά λίγα ειδικά προβλήματα υγείας, πιθανώς λόγω της αρχαίας τους γραμμής και της απουσίας ακραίων σωματικών τροποποιήσεων. Η δυσπλασία ισχίου είναι η κύρια ορθοπεδική ανησυχία. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) μπορεί να επηρεάσει ορισμένες γραμμές, οπότε συνιστώνται οφθαλμολογικές εξετάσεις. Ορισμένοι Picard μπορεί να αναπτύξουν αλλεργίες ή δερματικές ευαισθησίες. Η ράτσα μπορεί περιστασιακά να επηρεαστεί από αυτοάνοσες παθήσεις. Λόγω της σχετικής τους σπανιότητας, η διατήρηση γενετικής ποικιλομορφίας είναι σημαντική. Οι τακτικοί κτηνιατρικοί έλεγχοι, η ισορροπημένη διατροφή και η επιλογή εκτροφέα που πραγματοποιεί ελέγχους υγείας βοηθούν στην εξασφάλιση μακράς, υγιούς ζωής."
  },
  {
    "id": "bouvier-des-flandres",
    "slug": "bouvier-des-flandres",
    "name_en": "Bouvier des Flandres",
    "name_el": "Μπουβιέ των Φλάνδρων",
    "type": "dog",
    "origin": "Belgium",
    "originCode": "BE",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Loyal", "Protective", "Calm", "Intelligent", "Fearless"],
    "temperament_el": ["Πιστός", "Προστατευτικός", "Ήρεμος", "Έξυπνος", "Ατρόμητος"],
    "description_en": "The Bouvier des Flandres ('Cow Herder of Flanders') is a powerful, rugged, and versatile working breed that originated in the Flanders region spanning Belgium and France. They were the quintessential all-purpose farm dog, used for cattle herding and driving, cart pulling, guarding property and livestock, and even churning butter through treadmill work. Their rough, tousled double coat and massive, bearded head give them a formidable appearance that effectively deters intruders. During World War I, Bouviers served as ambulance and messenger dogs, with the breed nearly destroyed in the fighting that devastated Flanders — they were saved largely through the efforts of Belgian army veterinarian Captain Darby. Bouviers are calm, steady, and loyal dogs that form powerful bonds with their families while maintaining a watchful, protective nature. They are intelligent and independent thinkers that require an owner who can provide confident, consistent leadership. Despite their imposing size and protective instincts, well-socialized Bouviers are gentle with children and can be quite affectionate with their inner circle.",
    "description_el": "Ο Μπουβιέ των Φλάνδρων ('Βοσκός Αγελάδων της Φλάνδρας') είναι μια δυνατή, ανθεκτική και ευέλικτη εργατική ράτσα που κατάγεται από την περιοχή Φλάνδρα μεταξύ Βελγίου και Γαλλίας. Ήταν ο κατεξοχήν πολύπλευρος αγροτικός σκύλος, χρησιμοποιούμενος για ποίμανση και οδήγηση βοοειδών, τράβηγμα κάρων, φύλαξη ιδιοκτησίας και ζώων. Το τραχύ, ατημέλητο διπλό τρίχωμα και το μαζικό, γενειοφόρο κεφάλι τους δίνουν μια επιβλητική εμφάνιση. Κατά τον Α' Παγκόσμιο Πόλεμο, οι Μπουβιέ υπηρέτησαν ως σκύλοι ασθενοφόρου και αγγελιοφόροι, με τη ράτσα σχεδόν να καταστραφεί στις μάχες που κατέστρεψαν τη Φλάνδρα — σώθηκαν κυρίως μέσω των προσπαθειών του κτηνιάτρου του βελγικού στρατού Λοχαγού Darby. Οι Μπουβιέ είναι ήρεμοι, σταθεροί και πιστοί σκύλοι που δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους διατηρώντας παρατηρητική, προστατευτική φύση. Είναι έξυπνοι και ανεξάρτητοι σκεφτόμενοι που απαιτούν ιδιοκτήτη που μπορεί να παρέχει σίγουρη, συνεπή ηγεσία. Παρά το επιβλητικό μέγεθός τους, οι καλά κοινωνικοποιημένοι Μπουβιέ είναι ήπιοι με τα παιδιά και αρκετά στοργικοί.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 3, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Bouviers des Flandres need regular daily exercise — about 1-2 hours of walking, running, or structured activities. They are not hyperactive but do require consistent physical and mental outlets. Their rough, dense coat requires significant grooming commitment — thorough brushing 2-3 times per week and professional grooming every 6-8 weeks for trimming and shaping. The beard collects food and water and should be cleaned after meals. Bouviers are intelligent but can be strong-willed, requiring consistent, firm but fair training from an early age. They mature slowly, both physically and mentally, and may test boundaries during adolescence. Early and thorough socialization is essential — exposure to diverse people, animals, and environments helps prevent over-protectiveness or suspicion of strangers. They do well in obedience, herding, carting, agility, and Schutzhund. Bouviers are devoted family dogs that should live indoors with their people rather than isolated in a yard.",
    "care_el": "Οι Μπουβιέ των Φλάνδρων χρειάζονται τακτική καθημερινή άσκηση — περίπου 1-2 ώρες περπατήματος, τρεξίματος ή δομημένων δραστηριοτήτων. Δεν είναι υπερκινητικοί αλλά απαιτούν συνεπείς σωματικές και νοητικές διεξόδους. Το τραχύ, πυκνό τρίχωμά τους απαιτεί σημαντική δέσμευση στο grooming — διεξοδικό βούρτσισμα 2-3 φορές την εβδομάδα και επαγγελματικό grooming κάθε 6-8 εβδομάδες. Το γένι μαζεύει φαγητό και νερό και πρέπει να καθαρίζεται μετά τα γεύματα. Οι Μπουβιέ είναι έξυπνοι αλλά μπορεί να είναι πεισματάρηδες, απαιτώντας συνεπή, σταθερή αλλά δίκαιη εκπαίδευση. Ωριμάζουν αργά και μπορεί να δοκιμάζουν τα όρια κατά την εφηβεία. Η πρώιμη κοινωνικοποίηση είναι απαραίτητη. Τα πάνε καλά στην υπακοή, ποίμανση, τράβηγμα κάρων, ευκινησία και Schutzhund. Είναι αφοσιωμένοι οικογενειακοί σκύλοι που πρέπει να ζουν εσωτερικά με τους ανθρώπους τους.",
    "health_en": "Bouviers des Flandres can be prone to hip and elbow dysplasia, which should be screened through OFA evaluations in breeding stock. Bloat (gastric dilatation-volvulus) is a serious concern in this deep-chested breed — prophylactic gastropexy during spay/neuter surgery can reduce risk. Hypothyroidism is relatively common and can cause lethargy, weight gain, and coat problems. Eye conditions including cataracts and glaucoma may occur. Subaortic stenosis and other cardiac conditions should be screened for. Some Bouviers develop laryngeal paralysis in older age, causing breathing difficulties. The breed may also be prone to certain cancers. Regular cardiac screenings, thyroid panels, hip and elbow evaluations, and eye exams are recommended. Despite these potential concerns, Bouviers are generally sturdy dogs that live well when sourced from health-tested parents.",
    "health_el": "Οι Μπουβιέ των Φλάνδρων μπορεί να είναι επιρρεπείς σε δυσπλασία ισχίου και αγκώνα. Το φούσκωμα (γαστρική διάταση-συστροφή) είναι σοβαρή ανησυχία σε αυτή τη ράτσα με βαθύ θώρακα — η προφυλακτική γαστροπηξία κατά τη στείρωση μπορεί να μειώσει τον κίνδυνο. Ο υποθυρεοειδισμός είναι σχετικά κοινός και μπορεί να προκαλέσει λήθαργο, αύξηση βάρους και προβλήματα τριχώματος. Οφθαλμολογικές παθήσεις συμπεριλαμβανομένων καταρράκτη και γλαυκώματος μπορεί να εμφανιστούν. Η υποαορτική στένωση και άλλες καρδιακές παθήσεις πρέπει να ελέγχονται. Ορισμένοι Μπουβιέ αναπτύσσουν παράλυση λάρυγγα σε μεγαλύτερη ηλικία. Η ράτσα μπορεί επίσης να είναι επιρρεπής σε ορισμένους καρκίνους. Συνιστώνται τακτικοί καρδιακοί έλεγχοι, θυρεοειδικά πάνελ, αξιολογήσεις ισχίου και αγκώνα, και οφθαλμολογικές εξετάσεις."
  },
  {
    "id": "briard",
    "slug": "briard",
    "name_en": "Briard",
    "name_el": "Μπριάρ",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Loyal", "Fearless", "Intelligent", "Protective", "Gentle"],
    "temperament_el": ["Πιστός", "Ατρόμητος", "Έξυπνος", "Προστατευτικός", "Ήπιος"],
    "description_en": "The Briard is a magnificent French herding and guardian breed with a history stretching back over a thousand years, with Charlemagne and Napoleon both reputed to have kept Briards. Named after the province of Brie (though the name may also derive from 'chien d'Aubry' from a 14th-century legend), these large, powerful dogs served the dual purpose of herding sheep during the day and guarding them from wolves and thieves at night. The Briard's most distinctive feature is its long, flowing, wavy coat that comes in shades of black, gray, or tawny, along with their characteristically arched eyebrows that give them a soulful, expressive gaze. Like the Beauceron, Briards possess double dewclaws on their hind legs, a trait considered essential for the breed. They served heroically in World War I as sentry dogs, ammunition carriers, and Red Cross dogs who searched for wounded soldiers on the battlefield. Briards are deeply loyal and form intensely devoted bonds with their families, often described as a 'heart wrapped in fur.' They are gentle with those they love but naturally protective and can be reserved or suspicious with strangers.",
    "description_el": "Το Μπριάρ είναι μια μεγαλοπρεπής γαλλική ράτσα ποιμενικού και φύλακα με ιστορία που εκτείνεται πάνω από χίλια χρόνια, με τον Καρλομάγνο και τον Ναπολέοντα να φημίζονται ότι κρατούσαν Μπριάρ. Πήρε το όνομά του από την επαρχία Brie, αυτοί οι μεγάλοι, δυνατοί σκύλοι εξυπηρετούσαν τον διπλό σκοπό ποίμανσης προβάτων κατά τη διάρκεια της ημέρας και φύλαξής τους από λύκους και κλέφτες τη νύχτα. Το πιο χαρακτηριστικό γνώρισμα του Μπριάρ είναι το μακρύ, κυματιστό τρίχωμά του σε αποχρώσεις μαύρου, γκρι ή ταβί, μαζί με τα χαρακτηριστικά τοξωτά φρύδια που τους δίνουν ένα ψυχωμένο, εκφραστικό βλέμμα. Όπως και το Μποσερόν, τα Μπριάρ διαθέτουν διπλά αντίχειρα στα πίσω πόδια τους. Υπηρέτησαν ηρωικά στον Α' Παγκόσμιο Πόλεμο ως σκύλοι φρουροί, μεταφορείς πυρομαχικών και σκύλοι του Ερυθρού Σταυρού που αναζητούσαν τραυματίες στρατιώτες στο πεδίο μάχης. Τα Μπριάρ είναι βαθιά πιστά και δημιουργούν εντόνως αφοσιωμένους δεσμούς, συχνά περιγράφονται ως 'μια καρδιά τυλιγμένη σε γούνα.' Είναι ήπια με αυτούς που αγαπούν αλλά φυσικά προστατευτικά.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 3, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Briards need regular daily exercise — at least 1-2 hours of walking, hiking, play, or structured activities like herding, obedience, or agility training. They are active dogs that enjoy having a job, and their intelligence means they need mental stimulation as well. Their long, flowing coat is a significant grooming commitment, requiring thorough brushing at least every other day (daily is ideal) to prevent painful mats from forming. Professional grooming every 6-8 weeks helps maintain the coat. Some owners keep their Briard in a shorter trim for easier maintenance. Briards are intelligent but can be strong-minded and may try to take charge if given the opportunity — consistent, confident leadership combined with positive reinforcement produces the best results. Early socialization is crucial for this naturally protective breed. Briards form very strong attachments to their families and can develop separation anxiety if left alone for extended periods.",
    "care_el": "Τα Μπριάρ χρειάζονται τακτική καθημερινή άσκηση — τουλάχιστον 1-2 ώρες περπατήματος, πεζοπορίας, παιχνιδιού ή δομημένων δραστηριοτήτων. Είναι ενεργητικοί σκύλοι που απολαμβάνουν να έχουν δουλειά, και η νοημοσύνη τους σημαίνει ότι χρειάζονται νοητική διέγερση επίσης. Το μακρύ, κυματιστό τρίχωμά τους είναι σημαντική δέσμευση στο grooming, απαιτώντας διεξοδικό βούρτσισμα τουλάχιστον κάθε δεύτερη μέρα (ιδανικά καθημερινά) για να αποφευχθούν οδυνηροί κόμποι. Επαγγελματικό grooming κάθε 6-8 εβδομάδες βοηθά στη συντήρηση. Τα Μπριάρ είναι έξυπνα αλλά μπορεί να είναι πεισματάρικα — συνεπής, σίγουρη ηγεσία σε συνδυασμό με θετική ενίσχυση δίνει τα καλύτερα αποτελέσματα. Η πρώιμη κοινωνικοποίηση είναι κρίσιμη. Τα Μπριάρ δημιουργούν πολύ ισχυρές προσκολλήσεις και μπορεί να αναπτύξουν άγχος αποχωρισμού αν αφεθούν μόνα.",
    "health_en": "Briards can be prone to hip dysplasia, which should be evaluated in all breeding stock. Bloat (GDV) is a significant concern in this deep-chested breed, and owners should be aware of the signs and take preventive measures such as feeding smaller meals and avoiding vigorous exercise around mealtimes. Progressive retinal atrophy (PRA) is a hereditary eye condition that can lead to blindness — responsible breeders test for this. Congenital stationary night blindness (CSNB) is specific to the Briard and causes difficulty seeing in low light from birth. Lymphosarcoma and other cancers may affect some Briards. Thyroid dysfunction has been noted in the breed. The double dewclaws should be regularly checked and maintained to prevent injury. Regular cardiac screenings, hip evaluations, and comprehensive eye exams (including specific testing for CSNB) are recommended for breeding dogs and pets alike.",
    "health_el": "Τα Μπριάρ μπορεί να είναι επιρρεπή σε δυσπλασία ισχίου. Το φούσκωμα (GDV) είναι σημαντική ανησυχία σε αυτή τη ράτσα με βαθύ θώρακα. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) είναι κληρονομική οφθαλμολογική πάθηση που μπορεί να οδηγήσει σε τύφλωση — οι υπεύθυνοι εκτροφείς ελέγχουν για αυτό. Η συγγενής στάσιμη νυχτερινή τύφλωση (CSNB) είναι ειδική για τα Μπριάρ και προκαλεί δυσκολία στην όραση σε χαμηλό φωτισμό από τη γέννηση. Λεμφοσάρκωμα και άλλοι καρκίνοι μπορεί να επηρεάσουν ορισμένα Μπριάρ. Η θυρεοειδική δυσλειτουργία έχει σημειωθεί στη ράτσα. Τα διπλά αντίχειρα πρέπει να ελέγχονται τακτικά. Συνιστώνται τακτικοί καρδιακοί έλεγχοι, αξιολογήσεις ισχίου και ολοκληρωμένες οφθαλμολογικές εξετάσεις (συμπεριλαμβανομένου ειδικού ελέγχου για CSNB)."
  },
  {
    "id": "canaan-dog",
    "slug": "canaan-dog",
    "name_en": "Canaan Dog",
    "name_el": "Σκύλος της Χαναάν",
    "type": "dog",
    "origin": "Israel",
    "originCode": "IL",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Alert", "Vigilant", "Loyal", "Reserved", "Intelligent"],
    "temperament_el": ["Επαγρύπνος", "Παρατηρητικός", "Πιστός", "Επιφυλακτικός", "Έξυπνος"],
    "description_en": "The Canaan Dog is Israel's national dog breed and one of the world's most ancient, with archaeological evidence suggesting they have existed in the Middle East for thousands of years. They are a pariah-type dog, meaning they descended from free-ranging, semi-wild dogs that survived through natural selection in the harsh Negev Desert and surrounding regions. In the 1930s, Professor Rudolphina Menzel began systematically capturing and domesticating these desert dogs, recognizing their intelligence, adaptability, and trainability. She developed them into service dogs for the Israeli military, using them as sentries, mine detectors, and messenger dogs during the wars of Israeli independence. Canaan Dogs retain many primitive traits including exceptional alertness, keen survival instincts, and a natural wariness of unfamiliar people and situations. They are loyal and affectionate with their families, forming deep bonds with their owners, but they maintain an independent spirit and will not be submissively obedient. Their natural clean habits, minimal doggy odor, and moderate size make them well-suited to attentive, experienced homes.",
    "description_el": "Ο Σκύλος της Χαναάν είναι η εθνική ράτσα σκύλου του Ισραήλ και μία από τις πιο αρχαίες στον κόσμο, με αρχαιολογικά στοιχεία που υποδηλώνουν ότι υπάρχουν στη Μέση Ανατολή εδώ και χιλιάδες χρόνια. Είναι σκύλος τύπου pariah, που σημαίνει ότι κατάγονται από ελεύθερα, ημι-άγρια σκυλιά που επέζησαν μέσω φυσικής επιλογής στη σκληρή έρημο Νεγκέβ. Τη δεκαετία του 1930, η Καθηγήτρια Rudolphina Menzel άρχισε συστηματικά να αιχμαλωτίζει και να εξημερώνει αυτά τα σκυλιά της ερήμου, αναγνωρίζοντας τη νοημοσύνη τους. Τα ανέπτυξε σε σκύλους υπηρεσίας για τον ισραηλινό στρατό, χρησιμοποιώντας τα ως φρουρούς, ανιχνευτές ναρκών και αγγελιοφόρους. Οι Σκύλοι της Χαναάν διατηρούν πολλά πρωτόγονα χαρακτηριστικά συμπεριλαμβανομένης εξαιρετικής εγρήγορσης, οξύτατων ενστίκτων επιβίωσης και φυσικής επιφυλακτικότητας απέναντι σε άγνωστους ανθρώπους και καταστάσεις. Είναι πιστοί και στοργικοί με τις οικογένειές τους αλλά διατηρούν ανεξάρτητο πνεύμα. Οι φυσικές τους καθαρές συνήθειες, η ελάχιστη μυρωδιά σκύλου και το μέτριο μέγεθος τα καθιστούν κατάλληλα για προσεκτικά, έμπειρα σπίτια.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 3, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Canaan Dogs need regular daily exercise — at least an hour of walking, jogging, hiking, or play — but they are not as demanding as some herding breeds. They are naturally clean dogs with minimal grooming needs; their short to medium-length double coat requires only weekly brushing and sheds moderately, with heavier shedding twice a year. Canaan Dogs are intelligent and respond well to positive training methods, but their primitive nature means they can be independent and may question why they should comply with a command. Training should be kept varied and interesting, as they bore easily with repetition. Early, extensive, and ongoing socialization is absolutely essential for this breed — without it, their natural wariness can develop into fear-based reactivity or excessive suspicion of strangers. Secure fencing is important as they are alert to their surroundings and may attempt to patrol a wider territory. They are excellent watchdogs and will bark to alert their family to any change in their environment.",
    "care_el": "Οι Σκύλοι της Χαναάν χρειάζονται τακτική καθημερινή άσκηση — τουλάχιστον μία ώρα περπατήματος, τζόγκινγκ, πεζοπορίας ή παιχνιδιού. Είναι φυσικά καθαρά σκυλιά με ελάχιστες ανάγκες περιποίησης· το κοντό ως μεσαίου μήκους διπλό τρίχωμα απαιτεί μόνο εβδομαδιαίο βούρτσισμα. Είναι έξυπνοι και ανταποκρίνονται καλά σε θετικές μεθόδους εκπαίδευσης, αλλά η πρωτόγονη φύση τους σημαίνει ότι μπορεί να είναι ανεξάρτητοι και μπορεί να αμφισβητήσουν γιατί πρέπει να συμμορφωθούν. Η εκπαίδευση πρέπει να είναι ποικίλη και ενδιαφέρουσα. Η πρώιμη, εκτενής και συνεχής κοινωνικοποίηση είναι απολύτως απαραίτητη — χωρίς αυτήν, η φυσική τους επιφυλακτικότητα μπορεί να εξελιχθεί σε αντιδραστικότητα βασισμένη στο φόβο. Η ασφαλής περίφραξη είναι σημαντική. Είναι εξαιρετικοί φύλακες και θα γαυγίζουν για να ειδοποιήσουν την οικογένειά τους για κάθε αλλαγή στο περιβάλλον τους.",
    "health_en": "Canaan Dogs are one of the healthiest purebred breeds, largely due to thousands of years of natural selection in harsh desert conditions that eliminated weak or unhealthy animals. Hip dysplasia can occur but at lower rates than in many breeds of similar size. Hypothyroidism is the most commonly seen condition and should be monitored through periodic blood work. Eye conditions including progressive retinal atrophy (PRA) and cataracts have been reported. Epilepsy occurs rarely. Their naturally lean body type, clean genetics, and absence of extreme physical features contribute to their overall robustness and longevity. Maintaining a healthy weight, providing regular exercise, and choosing a breeder who tests for hip, thyroid, and eye conditions are the best strategies for a healthy Canaan Dog. With good care, they typically live 12-15 years.",
    "health_el": "Οι Σκύλοι της Χαναάν είναι μία από τις πιο υγιείς καθαρόαιμες ράτσες, σε μεγάλο βαθμό λόγω χιλιάδων ετών φυσικής επιλογής σε σκληρές ερημικές συνθήκες που εξάλειψαν αδύναμα ή ανθυγιεινά ζώα. Η δυσπλασία ισχίου μπορεί να εμφανιστεί αλλά σε χαμηλότερα ποσοστά από πολλές ράτσες παρόμοιου μεγέθους. Ο υποθυρεοειδισμός είναι η πιο συχνά εμφανιζόμενη πάθηση. Οφθαλμολογικές παθήσεις συμπεριλαμβανομένης PRA και καταρράκτη έχουν αναφερθεί. Η επιληψία εμφανίζεται σπάνια. Ο φυσικά αδύνατος σωματότυπος, τα καθαρά γενετικά και η απουσία ακραίων σωματικών χαρακτηριστικών συμβάλλουν στη συνολική τους ανθεκτικότητα. Με καλή φροντίδα, ζουν τυπικά 12-15 χρόνια."
  },
  {
    "id": "cardigan-welsh-corgi",
    "slug": "cardigan-welsh-corgi",
    "name_en": "Cardigan Welsh Corgi",
    "name_el": "Ουαλικός Κόργκι Καρντιγκάν",
    "type": "dog",
    "origin": "Wales",
    "originCode": "GB",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Affectionate", "Loyal", "Intelligent", "Alert", "Adaptable"],
    "temperament_el": ["Στοργικός", "Πιστός", "Έξυπνος", "Επαγρύπνος", "Προσαρμοστικός"],
    "description_en": "The Cardigan Welsh Corgi is the older and slightly larger of the two Corgi breeds, with a history in Wales dating back over 3,000 years. They were brought to the British Isles by Celtic tribes migrating from central Europe and are one of the oldest herding breeds in the world. The Cardigan is distinguished from the Pembroke by its long, fox-like tail, larger rounded ears, and slightly heavier bone structure. Their name derives from 'cor' (dwarf) and 'gi' (dog) in Welsh. Originally, Cardigans served a unique role in Welsh farming culture — their low stature allowed them to nip at cattle's heels while ducking under retaliatory kicks, and they were also used to drive cattle over common grazing lands, essentially acting as living fences. Cardigans are affectionate, loyal, and surprisingly versatile for their size — they are intelligent, eager to please, and excel in obedience, agility, herding trials, and therapy work. They are more reserved and less outgoing than Pembrokes, often described as the 'more serious' of the two Corgi breeds.",
    "description_el": "Το Ουαλικό Κόργκι Καρντιγκάν είναι η παλαιότερη και ελαφρώς μεγαλύτερη από τις δύο ράτσες Κόργκι, με ιστορία στην Ουαλία που χρονολογείται πάνω από 3.000 χρόνια. Μεταφέρθηκαν στα Βρετανικά Νησιά από Κελτικές φυλές που μετανάστευαν από την κεντρική Ευρώπη. Το Καρντιγκάν διακρίνεται από το Πέμπροκ από τη μακριά, αλεπουδίσια ουρά, τα μεγαλύτερα στρογγυλά αυτιά και τη βαρύτερη οστική δομή. Το όνομά τους προέρχεται από 'cor' (νάνος) και 'gi' (σκύλος) στα ουαλικά. Αρχικά, τα Καρντιγκάν εξυπηρετούσαν μοναδικό ρόλο στον ουαλικό αγροτικό πολιτισμό — το χαμηλό τους ανάστημα τους επέτρεπε να τσιμπάνε τις φτέρνες των βοοειδών ενώ σκύβουν κάτω από αντιποδηλατικά κλωτσήματα. Τα Καρντιγκάν είναι στοργικά, πιστά και εκπληκτικά ευέλικτα για το μέγεθός τους — είναι έξυπνα, πρόθυμα να ευχαριστήσουν και διαπρέπουν στην υπακοή, ευκινησία και ποιμενικές δοκιμές. Είναι πιο επιφυλακτικά και λιγότερο εξωστρεφή από τα Πέμπροκ, συχνά περιγράφονται ως τα 'πιο σοβαρά' από τα δύο Κόργκι.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 4, "trainability": 5, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Cardigan Welsh Corgis need daily exercise to stay fit and prevent obesity — at least 45 minutes to an hour of walking, play, or structured activities. They are surprisingly athletic for their short-legged build and can excel in agility, herding, and obedience. Their weather-resistant double coat requires weekly brushing, with more frequent grooming during their heavy spring and fall shedding periods. Cardigans are highly food-motivated, which makes training enjoyable but also means strict portion control is essential — obesity is one of the most serious health threats for this breed, putting excessive stress on their long spine. They are intelligent and eager to learn, responding well to positive reinforcement training. Early socialization helps temper their natural watchfulness into appropriate alertness rather than excessive suspicion. They adapt well to apartment living provided they get enough exercise, and their moderate bark makes them effective watchdogs.",
    "care_el": "Τα Ουαλικά Κόργκι Καρντιγκάν χρειάζονται καθημερινή άσκηση για να μείνουν σε φόρμα και να αποφευχθεί η παχυσαρκία — τουλάχιστον 45 λεπτά ως μία ώρα. Είναι εκπληκτικά αθλητικά για τα κοντά τους πόδια και μπορούν να διαπρέψουν στην ευκινησία, ποίμανση και υπακοή. Το ανθεκτικό στον καιρό διπλό τρίχωμα απαιτεί εβδομαδιαίο βούρτσισμα, με πιο συχνή περιποίηση κατά τις περιόδους έντονης τριχόπτωσης. Τα Καρντιγκάν είναι πολύ παρακινημένα από φαγητό, κάτι που κάνει την εκπαίδευση ευχάριστη αλλά σημαίνει ότι ο αυστηρός έλεγχος μερίδων είναι απαραίτητος — η παχυσαρκία είναι μία από τις πιο σοβαρές απειλές υγείας, βάζοντας υπερβολική πίεση στη μακριά σπονδυλική τους στήλη. Είναι έξυπνα και πρόθυμα να μάθουν. Η πρώιμη κοινωνικοποίηση βοηθά να μετατρέψει τη φυσική τους εγρήγορση σε κατάλληλη εγρήγορση. Προσαρμόζονται καλά στη ζωή σε διαμέρισμα αρκεί να ασκούνται επαρκώς.",
    "health_en": "Cardigan Welsh Corgis can be prone to intervertebral disc disease (IVDD) due to their long back and short legs — this is the most significant health concern for the breed, and maintaining a healthy weight and preventing excessive jumping are important preventive measures. Hip dysplasia is screened for in breeding stock through OFA evaluations. Progressive retinal atrophy (PRA) can cause gradual vision loss, and responsible breeders DNA-test for the specific PRA variant in Cardigans. Degenerative myelopathy (DM), a progressive spinal cord disease, can occur in some lines and is now testable through DNA. Some Cardigans may develop urinary stones. Their tendency toward obesity must be actively managed through controlled feeding and regular exercise. Regular veterinary checkups, maintaining ideal body weight, and choosing a breeder who tests for PRA, DM, and hip dysplasia are essential for a healthy Cardigan Welsh Corgi.",
    "health_el": "Τα Ουαλικά Κόργκι Καρντιγκάν μπορεί να είναι επιρρεπή σε ασθένεια μεσοσπονδύλιου δίσκου (IVDD) λόγω της μακριάς πλάτης και των κοντών ποδιών τους — αυτή είναι η πιο σημαντική ανησυχία υγείας. Η δυσπλασία ισχίου ελέγχεται στα ζώα αναπαραγωγής. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA) μπορεί να προκαλέσει σταδιακή απώλεια όρασης, και οι υπεύθυνοι εκτροφείς ελέγχουν με DNA. Η εκφυλιστική μυελοπάθεια (DM) μπορεί να εμφανιστεί σε ορισμένες γραμμές. Η τάση τους προς παχυσαρκία πρέπει να διαχειρίζεται ενεργά μέσω ελεγχόμενης σίτισης και τακτικής άσκησης. Οι τακτικοί κτηνιατρικοί έλεγχοι, η διατήρηση ιδανικού βάρους και η επιλογή εκτροφέα που ελέγχει για PRA, DM και δυσπλασία ισχίου είναι απαραίτητα."
  },
  {
    "id": "collie-rough",
    "slug": "collie-rough",
    "name_en": "Collie (Rough)",
    "name_el": "Κόλλι (Μακρυτρίχωμο)",
    "type": "dog",
    "origin": "Scotland",
    "originCode": "GB",
    "images": [],
    "size": "large",
    "lifespan": "12-14 years",
    "temperament_en": ["Gentle", "Loyal", "Intelligent", "Devoted", "Graceful"],
    "temperament_el": ["Ήπιος", "Πιστός", "Έξυπνος", "Αφοσιωμένος", "Κομψός"],
    "description_en": "The Rough Collie, immortalized by the fictional character Lassie, is one of the most recognized and beloved dog breeds in the world. Originating in the Scottish Highlands where they were used for centuries to herd sheep, the breed was refined and popularized in the 19th century when Queen Victoria fell in love with them during a visit to Balmoral Castle. Rough Collies are large, graceful dogs with a magnificent flowing double coat in sable and white, tricolor, blue merle, or white. Their long, refined head with semi-erect ears and soft, intelligent expression is one of the most beautiful in the canine world. They are exceptionally gentle and devoted family dogs, known for their incredible patience and kindness with children — their natural herding instinct translates into a protective watchfulness over young family members. Rough Collies are highly intelligent and sensitive, capable of reading their owner's emotions and responding accordingly. They are naturally clean dogs with an elegant bearing that belies their working heritage.",
    "description_el": "Το Rough Collie, αθανατοποιημένο από τον μυθοπλαστικό χαρακτήρα Lassie, είναι μία από τις πιο αναγνωρισμένες και αγαπημένες ράτσες σκύλων στον κόσμο. Κατάγεται από τα Σκωτσέζικα Υψίπεδα όπου χρησιμοποιούνταν για αιώνες για ποίμανση προβάτων, η ράτσα εξευγενίστηκε και δημοφιλής στον 19ο αιώνα όταν η Βασίλισσα Βικτωρία τα ερωτεύτηκε κατά τη διάρκεια επίσκεψης στο Κάστρο Balmoral. Τα Rough Collie είναι μεγάλα, κομψά σκυλιά με υπέροχο κυματιστό διπλό τρίχωμα σε sable και λευκό, τρίχρωμο, blue merle ή λευκό. Το μακρύ, εκλεπτυσμένο κεφάλι τους με ημι-όρθια αυτιά και μαλακή, έξυπνη έκφραση είναι ένα από τα πιο όμορφα στον κόσμο των σκύλων. Είναι εξαιρετικά ήπια και αφοσιωμένα οικογενειακά σκυλιά, γνωστά για την απίστευτη υπομονή και καλοσύνη τους με τα παιδιά. Είναι εξαιρετικά έξυπνα και ευαίσθητα, ικανά να διαβάζουν τα συναισθήματα του ιδιοκτήτη τους.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Rough Collies need regular daily exercise — about an hour of walking, play, or structured activities. They are not as intensely demanding as some herding breeds but still need consistent physical and mental outlets. Their stunning coat requires significant grooming — thorough brushing 2-3 times per week (daily during shedding seasons) to prevent painful mats, particularly behind the ears, under the legs, and around the ruff. Many owners find a good-quality pin brush and slicker brush essential tools. Rough Collies are sensitive, gentle souls that respond beautifully to positive reinforcement training — harsh methods will damage their trust and spirit. They can be vocal and may bark at perceived disturbances, so bark management training is helpful. Early socialization is beneficial, though Collies are naturally friendly and social. They are excellent family dogs that thrive on companionship and should not be isolated from their people.",
    "care_el": "Τα Rough Collie χρειάζονται τακτική καθημερινή άσκηση — περίπου μία ώρα περπατήματος, παιχνιδιού ή δραστηριοτήτων. Δεν είναι τόσο έντονα απαιτητικά όσο ορισμένες ποιμενικές ράτσες. Το εκπληκτικό τρίχωμά τους απαιτεί σημαντικό grooming — διεξοδικό βούρτσισμα 2-3 φορές την εβδομάδα (καθημερινά κατά τις εποχές τριχόπτωσης) για να αποφευχθούν κόμποι, ιδιαίτερα πίσω από τα αυτιά, κάτω από τα πόδια και γύρω από τον λαιμό. Τα Rough Collie είναι ευαίσθητα, ήπια πλάσματα που ανταποκρίνονται υπέροχα σε εκπαίδευση θετικής ενίσχυσης — σκληρές μέθοδοι θα βλάψουν την εμπιστοσύνη τους. Μπορεί να είναι φωνακλά και η εκπαίδευση διαχείρισης γαυγίσματος είναι χρήσιμη. Η πρώιμη κοινωνικοποίηση είναι ωφέλιμη. Είναι εξαιρετικά οικογενειακά σκυλιά που ευδοκιμούν με συντροφιά.",
    "health_en": "Rough Collies can be affected by several breed-specific health conditions. Collie Eye Anomaly (CEA) is a congenital, inherited eye condition that ranges from mild to severe — reputable breeders test for this through DNA and ophthalmologic screening. The MDR1 gene mutation is extremely common in Collies (affecting up to 70% of the breed), causing dangerous sensitivity to multiple medications including ivermectin, loperamide, and certain anesthetics — every Collie should be MDR1 tested. Progressive retinal atrophy (PRA) can cause vision loss. Dermatomyositis is an inflammatory disease affecting the skin and muscles that is particularly associated with Collies and Shelties. Hip dysplasia occurs at moderate rates. Bloat is possible in this deep-chested breed. Some Collies develop nasal solar dermatitis ('Collie nose'). Grey Collie Syndrome (cyclic neutropenia) is a rare but serious inherited condition. Regular eye exams, MDR1 testing, and comprehensive health screening of breeding dogs are essential.",
    "health_el": "Τα Rough Collie μπορεί να επηρεαστούν από αρκετές ειδικές παθήσεις. Η Collie Eye Anomaly (CEA) είναι συγγενής, κληρονομική οφθαλμολογική πάθηση — οι αξιόπιστοι εκτροφείς ελέγχουν με DNA. Η γονιδιακή μετάλλαξη MDR1 είναι εξαιρετικά κοινή στα Collie (επηρεάζοντας ώς 70% της ράτσας), προκαλώντας επικίνδυνη ευαισθησία σε πολλά φάρμακα — κάθε Collie πρέπει να ελεγχθεί για MDR1. Η PRA μπορεί να προκαλέσει απώλεια όρασης. Η δερματομυοσίτιδα είναι φλεγμονώδης νόσος ιδιαίτερα συνδεδεμένη με τα Collie. Η δυσπλασία ισχίου εμφανίζεται σε μέτρια ποσοστά. Το φούσκωμα είναι δυνατό. Ορισμένα Collie αναπτύσσουν ρινική ηλιακή δερματίτιδα. Το Σύνδρομο Grey Collie είναι σπάνια αλλά σοβαρή κληρονομική πάθηση. Συνιστώνται τακτικές οφθαλμολογικές εξετάσεις, έλεγχος MDR1 και ολοκληρωμένος υγειονομικός έλεγχος."
  },
  {
    "id": "collie-smooth",
    "slug": "collie-smooth",
    "name_en": "Collie (Smooth)",
    "name_el": "Κόλλι (Λείο)",
    "type": "dog",
    "origin": "Scotland",
    "originCode": "GB",
    "images": [],
    "size": "large",
    "lifespan": "12-14 years",
    "temperament_en": ["Gentle", "Loyal", "Intelligent", "Devoted", "Active"],
    "temperament_el": ["Ήπιος", "Πιστός", "Έξυπνος", "Αφοσιωμένος", "Δραστήριος"],
    "description_en": "The Smooth Collie is the short-coated variety of the Collie, sharing the same Scottish herding heritage, temperament, and conformation as the Rough Collie but with a much shorter, denser, and more practical coat. While the Rough Collie gained fame through Lassie, the Smooth Collie has remained the lesser-known but equally capable sibling. In their working days, Smooth Collies were often preferred by drovers who moved livestock to market because their shorter coat didn't collect burrs, mud, and debris as readily. They share the same gentle, intelligent, and devoted personality as the Rough Collie but are often described as slightly more active and playful. Smooth Collies come in the same colors — sable and white, tricolor, blue merle, and white — and have the same refined, elegant head and expression. They are excellent family dogs that are particularly good with children, naturally clean, and remarkably adaptable to various living situations. For those who love the Collie temperament but prefer less grooming commitment, the Smooth Collie is an ideal choice.",
    "description_el": "Το Smooth Collie είναι η κοντότριχη ποικιλία του Collie, μοιράζεται την ίδια σκωτσέζικη ποιμενική κληρονομιά, ιδιοσυγκρασία και διαμόρφωση με το Rough Collie αλλά με πολύ κοντότερο, πυκνότερο και πιο πρακτικό τρίχωμα. Ενώ το Rough Collie κέρδισε φήμη μέσω της Lassie, το Smooth Collie παρέμεινε το λιγότερο γνωστό αλλά εξίσου ικανό αδέλφι. Στις εργάσιμες μέρες τους, τα Smooth Collie προτιμούνταν συχνά από βοσκούς γιατί το κοντότερο τρίχωμα δεν μάζευε αγκάθια, λάσπη και συντρίμμια. Μοιράζονται την ίδια ήπια, έξυπνη και αφοσιωμένη προσωπικότητα αλλά συχνά περιγράφονται ως ελαφρώς πιο ενεργά και παιχνιδιάρικα. Τα Smooth Collie έρχονται στα ίδια χρώματα και έχουν το ίδιο εκλεπτυσμένο, κομψό κεφάλι και έκφραση. Είναι εξαιρετικά οικογενειακά σκυλιά ιδιαίτερα καλά με τα παιδιά, φυσικά καθαρά και αξιοσημείωτα προσαρμοστικά. Για όσους αγαπούν την ιδιοσυγκρασία Collie αλλά προτιμούν λιγότερο grooming, το Smooth Collie είναι ιδανική επιλογή.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Smooth Collies need similar exercise to Rough Collies — about an hour of daily walking, play, or structured activities. Their short, dense double coat is significantly easier to maintain than the Rough's, requiring only weekly brushing with a good-quality bristle brush, though shedding can still be substantial during seasonal coat changes. They are clean dogs by nature and don't develop the 'doggy odor' common in some breeds. Like Rough Collies, Smooths are highly intelligent and sensitive, thriving on positive reinforcement training and wilting under harsh corrections. They can be vocal and may bark at perceived disturbances. Early socialization is helpful to build confidence, as some Smooth Collies can be cautious in new situations. They make excellent therapy dogs and family companions, adapting well to apartments or houses as long as their exercise needs are met. They should not be left alone for extended periods as they are devoted to their families.",
    "care_el": "Τα Smooth Collie χρειάζονται παρόμοια άσκηση με τα Rough Collie — περίπου μία ώρα καθημερινά. Το κοντό, πυκνό διπλό τρίχωμά τους είναι σημαντικά ευκολότερο στη συντήρηση, απαιτώντας μόνο εβδομαδιαίο βούρτσισμα, αν και η τριχόπτωση μπορεί ακόμα να είναι σημαντική κατά τις εποχιακές αλλαγές. Είναι φυσικά καθαρά σκυλιά. Όπως τα Rough Collie, τα Smooth είναι εξαιρετικά έξυπνα και ευαίσθητα, ευδοκιμούν με εκπαίδευση θετικής ενίσχυσης. Μπορεί να είναι φωνακλά. Η πρώιμη κοινωνικοποίηση βοηθά στην οικοδόμηση αυτοπεποίθησης. Γίνονται εξαιρετικοί σκύλοι θεραπείας και οικογενειακοί σύντροφοι, προσαρμοζόμενοι καλά σε διαμερίσματα ή σπίτια. Δεν πρέπει να αφήνονται μόνα για παρατεταμένες περιόδους.",
    "health_en": "Smooth Collies share the exact same health profile as Rough Collies, as they are genetically the same breed differing only in coat length. Collie Eye Anomaly (CEA) is a primary concern that responsible breeders screen for through DNA testing and eye exams. The MDR1 gene mutation affects approximately 70% of all Collies, making certain medications life-threatening — MDR1 testing is essential. Progressive retinal atrophy (PRA) can lead to gradual blindness. Dermatomyositis, an inflammatory condition affecting skin and muscles, is particularly associated with the Collie breed. Hip dysplasia can occur. Some Smooth Collies may develop allergies or nasal solar dermatitis. The same commitment to health screening applies: CEA and PRA DNA testing, MDR1 testing, hip evaluations, and annual eye exams should all be part of a responsible breeding program.",
    "health_el": "Τα Smooth Collie μοιράζονται ακριβώς το ίδιο προφίλ υγείας με τα Rough Collie, καθώς είναι γενετικά η ίδια ράτσα. Η Collie Eye Anomaly (CEA) είναι κύρια ανησυχία. Η γονιδιακή μετάλλαξη MDR1 επηρεάζει περίπου 70% όλων των Collie, καθιστώντας ορισμένα φάρμακα απειλητικά για τη ζωή — ο έλεγχος MDR1 είναι απαραίτητος. Η PRA μπορεί να οδηγήσει σε σταδιακή τύφλωση. Η δερματομυοσίτιδα είναι ιδιαίτερα συνδεδεμένη με τη ράτσα Collie. Η δυσπλασία ισχίου μπορεί να εμφανιστεί. Η ίδια δέσμευση στον υγειονομικό έλεγχο ισχύει: DNA τεστ CEA και PRA, έλεγχος MDR1, αξιολογήσεις ισχίου και ετήσιες οφθαλμολογικές εξετάσεις πρέπει να αποτελούν μέρος ενός υπεύθυνου προγράμματος εκτροφής."
  },
  {
    "id": "croatian-sheepdog",
    "slug": "croatian-sheepdog",
    "name_en": "Croatian Sheepdog",
    "name_el": "Κροατικός Ποιμενικός",
    "type": "dog",
    "origin": "Croatia",
    "originCode": "HR",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Energetic", "Loyal", "Intelligent", "Alert", "Obedient"],
    "temperament_el": ["Ενεργητικός", "Πιστός", "Έξυπνος", "Επαγρύπνος", "Πειθήνιος"],
    "description_en": "The Croatian Sheepdog (Hrvatski Ovčar) is an ancient herding breed from Croatia with documented history dating back to the 14th century, when Bishop Petar Horvat wrote about the 'Canis pastoralis croaticus' in 1374. They are medium-sized, always black dogs with a distinctive curly or wavy coat that is shorter on the face and legs. The breed has remained remarkably unchanged for centuries, still widely used by Croatian shepherds for herding sheep, cattle, and pigs in the Slavonian plains. Croatian Sheepdogs are energetic, highly intelligent, and remarkably obedient — they are considered one of the easiest herding breeds to train due to their strong desire to please and natural attentiveness to their handler. They form devoted bonds with their families and are typically friendly and good-natured, though they may be initially cautious with strangers. Their moderate size, adaptable nature, and strong work ethic make them excellent companions for active families as well as working dog enthusiasts.",
    "description_el": "Ο Κροατικός Ποιμενικός (Hrvatski Ovčar) είναι αρχαία ποιμενική ράτσα από την Κροατία με τεκμηριωμένη ιστορία που χρονολογείται από τον 14ο αιώνα, όταν ο Επίσκοπος Petar Horvat έγραψε για τον 'Canis pastoralis croaticus' το 1374. Είναι μεσαίου μεγέθους, πάντα μαύροι σκύλοι με χαρακτηριστικό σγουρό ή κυματιστό τρίχωμα που είναι κοντότερο στο πρόσωπο και τα πόδια. Η ράτσα έχει παραμείνει αξιοσημείωτα αμετάβλητη για αιώνες, εξακολουθεί να χρησιμοποιείται ευρέως από Κροάτες βοσκούς. Οι Κροατικοί Ποιμενικοί είναι ενεργητικοί, εξαιρετικά έξυπνοι και αξιοσημείωτα πειθήνιοι — θεωρούνται μία από τις πιο εύκολες στην εκπαίδευση ποιμενικές ράτσες λόγω της ισχυρής τους επιθυμίας να ευχαριστήσουν. Δημιουργούν αφοσιωμένους δεσμούς με τις οικογένειές τους και είναι τυπικά φιλικοί, αν και μπορεί να είναι αρχικά προσεκτικοί με αγνώστους. Το μέτριο μέγεθος, η προσαρμοστική φύση και η ισχυρή εργατική ηθική τους τα καθιστούν εξαιρετικούς συντρόφους.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 4, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Croatian Sheepdogs need plenty of daily exercise and mental stimulation — at least 1-2 hours of vigorous activity. They are natural athletes that excel in agility, obedience, herding trials, and flyball. Their curly coat requires regular brushing 2-3 times per week to prevent matting, with more attention needed during seasonal shedding. They are intelligent and eager to learn, making training a pleasurable experience for both dog and owner. Positive reinforcement methods work exceptionally well with this breed. Early socialization helps them develop confidence in various situations. They are vocal dogs that may bark to communicate or alert, so training for appropriate bark behavior is helpful in urban settings. Croatian Sheepdogs adapt well to family life and are generally good with children and other pets when properly introduced.",
    "care_el": "Οι Κροατικοί Ποιμενικοί χρειάζονται πολλή καθημερινή άσκηση και νοητική διέγερση — τουλάχιστον 1-2 ώρες έντονης δραστηριότητας. Είναι φυσικοί αθλητές που διαπρέπουν στην ευκινησία, υπακοή, ποιμενικές δοκιμές και flyball. Το σγουρό τρίχωμά τους απαιτεί τακτικό βούρτσισμα 2-3 φορές την εβδομάδα. Είναι έξυπνοι και πρόθυμοι να μάθουν, κάνοντας την εκπαίδευση ευχάριστη εμπειρία. Οι μέθοδοι θετικής ενίσχυσης λειτουργούν εξαιρετικά. Η πρώιμη κοινωνικοποίηση βοηθά στην ανάπτυξη αυτοπεποίθησης. Είναι φωνακλά σκυλιά που μπορεί να γαυγίζουν για να επικοινωνήσουν. Προσαρμόζονται καλά στην οικογενειακή ζωή και είναι γενικά καλά με παιδιά και άλλα κατοικίδια.",
    "health_en": "Croatian Sheepdogs are generally a very healthy breed with few breed-specific genetic issues, largely due to their long, naturally selected history and the absence of extreme physical modifications in breeding. Hip dysplasia is the most commonly screened condition, though incidence rates are relatively low compared to many breeds. Patellar luxation may occasionally occur. Eye conditions are uncommon but periodic screening is recommended. As a working breed that has not been heavily manipulated for cosmetic purposes, they maintain excellent overall health and vitality. Their athletic build and active lifestyle help prevent obesity-related conditions. Regular veterinary checkups, maintaining a healthy weight, and providing adequate exercise are the primary keys to a long, healthy life. Croatian Sheepdogs typically enjoy good health well into their senior years.",
    "health_el": "Οι Κροατικοί Ποιμενικοί είναι γενικά πολύ υγιής ράτσα με λίγα ειδικά γενετικά προβλήματα, σε μεγάλο βαθμό λόγω της μακράς, φυσικά επιλεγμένης ιστορίας τους και της απουσίας ακραίων σωματικών τροποποιήσεων. Η δυσπλασία ισχίου είναι η πιο συχνά ελεγχόμενη πάθηση, αν και τα ποσοστά είναι σχετικά χαμηλά. Η εξάρθρωση επιγονατίδας μπορεί περιστασιακά να εμφανιστεί. Οφθαλμολογικές παθήσεις είναι σπάνιες. Ως εργατική ράτσα που δεν έχει χειραγωγηθεί σημαντικά για καλλωπιστικούς σκοπούς, διατηρούν εξαιρετική συνολική υγεία. Η αθλητική σωματική τους διάπλαση βοηθά στην πρόληψη παθήσεων σχετικών με παχυσαρκία. Οι Κροατικοί Ποιμενικοί τυπικά απολαμβάνουν καλή υγεία μέχρι τα γηρατειά τους."
  },
  {
    "id": "dutch-shepherd",
    "slug": "dutch-shepherd",
    "name_en": "Dutch Shepherd",
    "name_el": "Ολλανδικός Ποιμενικός",
    "type": "dog",
    "origin": "Netherlands",
    "originCode": "NL",
    "images": [],
    "size": "medium",
    "lifespan": "11-14 years",
    "temperament_en": ["Loyal", "Obedient", "Alert", "Intelligent", "Reliable"],
    "temperament_el": ["Πιστός", "Πειθήνιος", "Επαγρύπνος", "Έξυπνος", "Αξιόπιστος"],
    "description_en": "The Dutch Shepherd (Hollandse Herder) is a versatile herding breed from the Netherlands that comes in three coat varieties: short-haired, long-haired, and rough-haired (wire-haired). All varieties share a distinctive gold or silver brindle pattern that sets them apart from the similar-looking Belgian and German Shepherds. Originally an all-purpose farm dog in the Dutch countryside, they herded flocks, guarded the farm, pulled carts, and even watched over children. As farming modernized in the early 20th century, the breed's numbers declined dramatically and they remain relatively rare today. Dutch Shepherds are loyal, obedient, and incredibly reliable working dogs — they are increasingly used by police and military forces worldwide as an alternative to Belgian Malinois and German Shepherds, valued for their stability, intelligence, and lower incidence of certain health issues. They are less 'sharp' than Malinois while still possessing excellent drive and trainability, making them more suitable for experienced pet owners who want an active, intelligent companion. They bond strongly with their handlers and are naturally alert and watchful.",
    "description_el": "Ο Ολλανδικός Ποιμενικός (Hollandse Herder) είναι μια ευέλικτη ποιμενική ράτσα από την Ολλανδία που υπάρχει σε τρεις ποικιλίες τριχώματος: κοντότριχη, μακρυτρίχωμη και τραχύτριχη. Όλες οι ποικιλίες μοιράζονται ένα χαρακτηριστικό χρυσό ή ασημί brindle σχέδιο. Αρχικά πολύπλευρος αγροτικός σκύλος στην ολλανδική ύπαιθρο, ποίμαιναν κοπάδια, φύλαγαν τη φάρμα, τραβούσαν κάρα και παρακολουθούσαν παιδιά. Καθώς η γεωργία εκσυγχρονίστηκε τον 20ό αιώνα, οι αριθμοί της ράτσας μειώθηκαν δραματικά και παραμένουν σχετικά σπάνιοι σήμερα. Οι Ολλανδικοί Ποιμενικοί είναι πιστοί, πειθήνιοι και απίστευτα αξιόπιστοι εργατικοί σκύλοι — χρησιμοποιούνται ολοένα και περισσότερο από αστυνομικές και στρατιωτικές δυνάμεις παγκοσμίως ως εναλλακτική στα Βελγικά Μαλινουά και τους Γερμανικούς Ποιμενικούς, εκτιμώμενοι για τη σταθερότητα, νοημοσύνη και χαμηλότερη επίπτωση ορισμένων προβλημάτων υγείας. Δένονται ισχυρά με τους χειριστές τους και είναι φυσικά επαγρύπνοι.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 3, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Dutch Shepherds need substantial daily exercise and mental stimulation — at least 1-2 hours of vigorous activity. They excel in police work, protection sports (IPO/Schutzhund), agility, obedience, tracking, and nose work. Grooming requirements vary by coat type: short-haired requires weekly brushing, long-haired needs more frequent grooming to prevent mats, and rough-haired benefits from periodic hand-stripping. All varieties shed moderately. They are highly trainable and responsive to positive, consistent training methods. Early socialization is important, especially to develop comfort with strangers and new environments. They bond closely with their families and can develop separation anxiety if left alone for extended periods. Dutch Shepherds are best suited to active, experienced dog owners who can provide structure, training, and adequate physical and mental outlets for their energy and intelligence.",
    "care_el": "Οι Ολλανδικοί Ποιμενικοί χρειάζονται σημαντική καθημερινή άσκηση και νοητική διέγερση — τουλάχιστον 1-2 ώρες έντονης δραστηριότητας. Διαπρέπουν σε αστυνομική εργασία, αθλήματα προστασίας, ευκινησία, υπακοή, ιχνηλασία και εργασία μύτης. Οι απαιτήσεις grooming ποικίλλουν ανά τύπο τριχώματος: η κοντότριχη απαιτεί εβδομαδιαίο βούρτσισμα, η μακρυτρίχωμη χρειάζεται πιο συχνή περιποίηση, και η τραχύτριχη ωφελείται από περιοδικό hand-stripping. Είναι εξαιρετικά εκπαιδεύσιμοι και ανταποκρίνονται σε θετικές, συνεπείς μεθόδους. Η πρώιμη κοινωνικοποίηση είναι σημαντική. Δένονται στενά με τις οικογένειές τους και μπορεί να αναπτύξουν άγχος αποχωρισμού. Είναι καταλληλότεροι για ενεργούς, έμπειρους ιδιοκτήτες.",
    "health_en": "Dutch Shepherds are generally considered healthier than many other shepherd breeds, partly due to their smaller gene pool being more carefully managed and the absence of extreme breeding for show characteristics. Hip and elbow dysplasia can occur and should be screened in breeding stock. Goniodysplasia, an eye condition affecting fluid drainage and potentially leading to glaucoma, is specific to the rough-haired variety and should be tested for. Some Dutch Shepherds may carry the MDR1 gene mutation, causing sensitivity to certain medications. Thyroid issues can develop in some individuals. Inflammatory myopathy has been reported in the breed. The short-haired variety tends to have the fewest health issues. Regular veterinary care, health screening of breeding dogs, and maintaining an active, healthy lifestyle help ensure the best possible health outcomes for Dutch Shepherds.",
    "health_el": "Οι Ολλανδικοί Ποιμενικοί θεωρούνται γενικά υγιέστεροι από πολλές άλλες ράτσες ποιμενικών. Η δυσπλασία ισχίου και αγκώνα μπορεί να εμφανιστεί. Η γωνιοδυσπλασία, μια οφθαλμολογική πάθηση που επηρεάζει την αποστράγγιση υγρών και μπορεί να οδηγήσει σε γλαύκωμα, είναι ειδική στην τραχύτριχη ποικιλία. Ορισμένοι Ολλανδικοί Ποιμενικοί μπορεί να φέρουν τη γονιδιακή μετάλλαξη MDR1. Θυρεοειδικά θέματα μπορεί να αναπτυχθούν. Φλεγμονώδης μυοπάθεια έχει αναφερθεί. Η κοντότριχη ποικιλία τείνει να έχει τα λιγότερα προβλήματα υγείας. Η τακτική κτηνιατρική φροντίδα, ο υγειονομικός έλεγχος ζώων αναπαραγωγής και η διατήρηση ενεργού, υγιούς τρόπου ζωής βοηθούν στην εξασφάλιση των καλύτερων αποτελεσμάτων υγείας."
  },
  {
    "id": "finnish-lapphund",
    "slug": "finnish-lapphund",
    "name_en": "Finnish Lapphund",
    "name_el": "Φινλανδικός Λαππούντι",
    "type": "dog",
    "origin": "Finland",
    "originCode": "FI",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Friendly", "Calm", "Courageous", "Loyal", "Intelligent"],
    "temperament_el": ["Φιλικός", "Ήρεμος", "Θαρραλέος", "Πιστός", "Έξυπνος"],
    "description_en": "The Finnish Lapphund (Suomenlapinkoira) has a heritage stretching back thousands of years as the herding and companion dog of the Sámi people, the indigenous inhabitants of Lapland in northern Scandinavia. Originally used to hunt and later to herd reindeer across the vast Arctic tundra, these dogs developed a thick, weatherproof double coat and remarkable stamina to survive in some of the harshest climates on Earth, with temperatures dropping to -40°C. Finnish Lapphunds are medium-sized, well-built dogs with a profuse, luxurious coat that comes in a wide range of colors, a characteristic 'spitz' appearance with pricked ears and a curved tail, and an expressive, kind face. They are friendly, calm, and remarkably courageous — bred to face reindeer that can weigh up to 300 kg, they needed to be brave and quick. Despite their working background, Finnish Lapphunds have a gentle, affectionate temperament that makes them wonderful family dogs. They are intelligent and eager to please but retain a 'startle reflex' from their herding days — they react quickly to sudden movements and then recover rapidly.",
    "description_el": "Ο Φινλανδικός Λαππούντι (Suomenlapinkoira) έχει κληρονομιά που εκτείνεται χιλιάδες χρόνια πίσω ως ποιμενικός σκύλος και σύντροφος των Σάμι, των ιθαγενών κατοίκων της Λαπωνίας στη βόρεια Σκανδιναβία. Αρχικά χρησιμοποιούνταν για κυνήγι και αργότερα για ποίμανση ταράνδων στην απέραντη αρκτική τούνδρα, αυτοί οι σκύλοι ανέπτυξαν πυκνό, αδιάβροχο διπλό τρίχωμα και αξιοσημείωτη αντοχή για να επιβιώσουν σε μερικά από τα πιο σκληρά κλίματα στη Γη, με θερμοκρασίες που πέφτουν στους -40°C. Οι Φινλανδικοί Λαππούντι είναι μεσαίου μεγέθους, καλοδεμένοι σκύλοι με πλούσιο, πολυτελές τρίχωμα σε ευρύ φάσμα χρωμάτων, χαρακτηριστική εμφάνιση 'spitz' με όρθια αυτιά και κυρτή ουρά, και ένα εκφραστικό, ευγενικό πρόσωπο. Είναι φιλικοί, ήρεμοι και αξιοσημείωτα θαρραλέοι — εκτρεφόμενοι για να αντιμετωπίζουν ταράνδους που μπορεί να ζυγίζουν μέχρι 300 κιλά. Παρά το εργασιακό τους υπόβαθρο, έχουν ήπια, στοργική ιδιοσυγκρασία που τα καθιστά υπέροχα οικογενειακά σκυλιά.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Finnish Lapphunds need regular daily exercise — about an hour of walking, hiking, or play — but they are not as hyperactive as some herding breeds. They particularly enjoy cold weather activities and thrive in cooler climates, though they can adapt to warmer regions with access to air conditioning and shade. Their thick double coat requires thorough brushing 2-3 times per week, with daily brushing during their impressive twice-yearly 'coat blow' when they shed heavily. Regular bathing and blow-drying during shedding helps manage the process. They are intelligent and enjoy learning, responding well to positive reinforcement training. Finnish Lapphunds can be independent thinkers, so training should be kept interesting and varied. They are generally friendly with everyone including strangers, other dogs, and children, making them poor guard dogs but excellent therapy and family companions. They can be vocal and may bark at perceived changes in their environment — a trait from their herding days when barking was used to move reindeer.",
    "care_el": "Οι Φινλανδικοί Λαππούντι χρειάζονται τακτική καθημερινή άσκηση — περίπου μία ώρα περπατήματος, πεζοπορίας ή παιχνιδιού. Απολαμβάνουν ιδιαίτερα τις δραστηριότητες σε κρύο καιρό. Το πυκνό διπλό τρίχωμά τους απαιτεί διεξοδικό βούρτσισμα 2-3 φορές την εβδομάδα, με καθημερινό βούρτσισμα κατά τη δις ετήσια εντυπωσιακή αλλαγή τριχώματος. Είναι έξυπνοι και απολαμβάνουν να μαθαίνουν, ανταποκρινόμενοι καλά σε εκπαίδευση θετικής ενίσχυσης. Μπορεί να είναι ανεξάρτητοι στη σκέψη, οπότε η εκπαίδευση πρέπει να είναι ενδιαφέρουσα και ποικίλη. Είναι γενικά φιλικοί με όλους, κάτι που τα κάνει φτωχούς φύλακες αλλά εξαιρετικούς οικογενειακούς συντρόφους. Μπορεί να είναι φωνακλά — ένα χαρακτηριστικό από τις μέρες ποίμανσης ταράνδων.",
    "health_en": "Finnish Lapphunds are generally healthy dogs with good longevity. Hip dysplasia is the most commonly screened orthopedic condition, and breeding dogs should be evaluated. Progressive retinal atrophy (PRA), specifically the prcd-PRA variant, can cause gradual vision loss — DNA testing is available and recommended for breeding stock. Hereditary cataracts may develop in some lines. Pompe disease (glycogen storage disease type II) has been identified in the breed and can cause muscle weakness — a DNA test is available. Some Finnish Lapphunds may develop epilepsy. They can also be susceptible to dental problems and should have regular dental care. Overall, they are a robust breed with relatively few serious health concerns. Working with a breeder who tests for hip dysplasia, PRA, cataracts, and Pompe disease is the best way to ensure a healthy Finnish Lapphund.",
    "health_el": "Οι Φινλανδικοί Λαππούντι είναι γενικά υγιείς σκύλοι με καλή μακροζωία. Η δυσπλασία ισχίου είναι η πιο συχνά ελεγχόμενη ορθοπεδική πάθηση. Η προοδευτική ατροφία αμφιβληστροειδούς (PRA), συγκεκριμένα η παραλλαγή prcd-PRA, μπορεί να προκαλέσει σταδιακή απώλεια όρασης — υπάρχει διαθέσιμο DNA τεστ. Κληρονομικός καταρράκτης μπορεί να αναπτυχθεί σε ορισμένες γραμμές. Η νόσος Pompe (νόσος αποθήκευσης γλυκογόνου τύπου II) έχει αναγνωριστεί στη ράτσα — υπάρχει διαθέσιμο DNA τεστ. Ορισμένοι μπορεί να αναπτύξουν επιληψία. Μπορεί επίσης να είναι ευαίσθητοι σε οδοντικά προβλήματα. Συνολικά, είναι εύρωστη ράτσα. Η συνεργασία με εκτροφέα που ελέγχει για δυσπλασία ισχίου, PRA, καταρράκτη και νόσο Pompe είναι ο καλύτερος τρόπος."
  },
  {
    "id": "icelandic-sheepdog",
    "slug": "icelandic-sheepdog",
    "name_en": "Icelandic Sheepdog",
    "name_el": "Ισλανδικός Ποιμενικός",
    "type": "dog",
    "origin": "Iceland",
    "originCode": "IS",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Friendly", "Energetic", "Inquisitive", "Happy", "Hardworking"],
    "temperament_el": ["Φιλικός", "Ενεργητικός", "Περίεργος", "Χαρούμενος", "Εργατικός"],
    "description_en": "The Icelandic Sheepdog is Iceland's only native dog breed, brought to the island by Viking settlers between the 9th and 10th centuries. They are a Nordic spitz-type breed closely related to the Norwegian Buhund and the Finnish Lapphund, adapted over a millennium to the harsh Icelandic climate and terrain. Icelandic Sheepdogs were essential partners for Icelandic farmers, used for herding sheep, cattle, and Icelandic horses across volcanic landscapes and rugged highlands. They have a distinctive method of working — rather than nipping at heels, they use their bark and agile movements to guide livestock, and they were particularly valued for gathering scattered sheep from mountain pastures in autumn. The breed nearly went extinct multiple times due to distemper epidemics and the hardships of Icelandic life, falling to dangerously low numbers in the mid-20th century before dedicated breeding programs in Iceland, Denmark, and other countries saved them. Icelandic Sheepdogs are remarkably friendly, cheerful, and enthusiastic dogs with an infectious joie de vivre. They greet everyone — people, dogs, and other animals — with genuine warmth and excitement.",
    "description_el": "Ο Ισλανδικός Ποιμενικός είναι η μόνη ιθαγενής ράτσα σκύλων της Ισλανδίας, μεταφερμένη στο νησί από Βίκινγκ αποίκους μεταξύ 9ου και 10ου αιώνα. Είναι σκανδιναβική ράτσα τύπου spitz στενά σχετιζόμενη με τον Νορβηγικό Μπούχουντ και τον Φινλανδικό Λαππούντι, προσαρμοσμένη πάνω από μία χιλιετία στο σκληρό ισλανδικό κλίμα. Οι Ισλανδικοί Ποιμενικοί ήταν απαραίτητοι συνεργάτες για τους Ισλανδούς αγρότες, χρησιμοποιούμενοι για ποίμανση προβάτων, βοοειδών και ισλανδικών αλόγων σε ηφαιστειακά τοπία. Έχουν μια χαρακτηριστική μέθοδο εργασίας — αντί να τσιμπάνε φτέρνες, χρησιμοποιούν το γαύγισμα και τις ευκίνητες κινήσεις τους. Η ράτσα σχεδόν εξαφανίστηκε πολλές φορές λόγω επιδημιών νόσου των σκύλων, πέφτοντας σε επικίνδυνα χαμηλούς αριθμούς στα μέσα του 20ού αιώνα πριν αφοσιωμένα προγράμματα εκτροφής τους σώσουν. Οι Ισλανδικοί Ποιμενικοί είναι αξιοσημείωτα φιλικοί, χαρούμενοι και ενθουσιώδεις σκύλοι με μεταδοτική χαρά ζωής. Χαιρετούν τον καθένα με γνήσια ζεστασιά.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Icelandic Sheepdogs need regular daily exercise — about an hour of walking, play, or structured activities. They enjoy hiking, agility, and herding activities but are not as intensely demanding as some working breeds. Their thick double coat comes in both long-haired and short-haired varieties, both requiring regular brushing 2-3 times per week, with daily grooming during their heavy seasonal shedding. They are enthusiastic and eager to please, making training enjoyable and relatively straightforward with positive reinforcement methods. One characteristic that requires management is their tendency to bark — Icelandic Sheepdogs are naturally vocal dogs that bark at birds, strangers, interesting sounds, and sometimes apparently at nothing. This served them well in their herding role but can be challenging in urban or suburban settings. Training for appropriate barking from an early age is recommended. They are excellent family dogs that are genuinely gentle with children and welcoming to visitors.",
    "care_el": "Οι Ισλανδικοί Ποιμενικοί χρειάζονται τακτική καθημερινή άσκηση — περίπου μία ώρα. Απολαμβάνουν πεζοπορία, ευκινησία και ποιμενικές δραστηριότητες. Το πυκνό διπλό τρίχωμά τους απαιτεί τακτικό βούρτσισμα 2-3 φορές την εβδομάδα, με καθημερινή περιποίηση κατά τη εποχιακή τριχόπτωση. Είναι ενθουσιώδεις και πρόθυμοι να ευχαριστήσουν. Ένα χαρακτηριστικό που απαιτεί διαχείριση είναι η τάση τους να γαυγίζουν — οι Ισλανδικοί Ποιμενικοί είναι φυσικά φωνακλά σκυλιά. Αυτό τους εξυπηρετούσε καλά στον ποιμενικό τους ρόλο αλλά μπορεί να είναι δύσκολο σε αστικά περιβάλλοντα. Η εκπαίδευση κατάλληλου γαυγίσματος από νωρίς συνιστάται. Είναι εξαιρετικά οικογενειακά σκυλιά, πραγματικά ήπια με τα παιδιά και φιλόξενα σε επισκέπτες.",
    "health_en": "Icelandic Sheepdogs are generally healthy, but the breed's history of near-extinction means genetic diversity is an ongoing concern for breeders. Hip dysplasia should be screened in breeding stock, though incidence is relatively moderate. Patellar luxation, where the kneecap dislocates, can occur. Some Icelandic Sheepdogs may develop cataracts or other eye conditions — regular eye exams are recommended. Cryptorchidism (undescended testicles) is seen at higher rates than in some other breeds. There have been occasional reports of diabetes in the breed. Due to the relatively small founding population, responsible breeders carefully manage genetic diversity through international collaboration and breeding programs. Regular veterinary checkups, appropriate exercise, maintaining a healthy weight, and working with a knowledgeable breeder who participates in health testing programs are the best strategies for a healthy Icelandic Sheepdog.",
    "health_el": "Οι Ισλανδικοί Ποιμενικοί είναι γενικά υγιείς, αλλά η ιστορία σχεδόν εξαφάνισης σημαίνει ότι η γενετική ποικιλομορφία είναι συνεχής ανησυχία. Η δυσπλασία ισχίου πρέπει να ελέγχεται στα ζώα αναπαραγωγής. Η εξάρθρωση επιγονατίδας μπορεί να εμφανιστεί. Ορισμένοι μπορεί να αναπτύξουν καταρράκτη ή άλλες οφθαλμολογικές παθήσεις. Η κρυψορχία εμφανίζεται σε υψηλότερα ποσοστά. Υπάρχουν αναφορές διαβήτη στη ράτσα. Λόγω του σχετικά μικρού ιδρυτικού πληθυσμού, οι υπεύθυνοι εκτροφείς διαχειρίζονται προσεκτικά τη γενετική ποικιλομορφία μέσω διεθνούς συνεργασίας. Οι τακτικοί κτηνιατρικοί έλεγχοι, η κατάλληλη άσκηση και η συνεργασία με γνώστη εκτροφέα είναι οι καλύτερες στρατηγικές."
  },
  {
    "id": "komondor",
    "slug": "komondor",
    "name_en": "Komondor",
    "name_el": "Κομοντόρ",
    "type": "dog",
    "origin": "Hungary",
    "originCode": "HU",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Loyal", "Fearless", "Calm", "Protective", "Independent"],
    "temperament_el": ["Πιστός", "Ατρόμητος", "Ήρεμος", "Προστατευτικός", "Ανεξάρτητος"],
    "description_en": "The Komondor is one of the most visually striking dog breeds in the world, instantly recognizable by its massive size and unique white corded coat that resembles a mop or dreadlocks. This ancient Hungarian livestock guardian has protected flocks of sheep and cattle on the Hungarian plains (puszta) for over a thousand years, with Cumanian ancestors likely bringing them from Asia around the 12th-13th century. Their extraordinary coat served a vital purpose — the heavy, white cords camouflaged them among the sheep they guarded while providing insulation against extreme temperatures and armor-like protection against wolf and bear bites. Komondorok (the Hungarian plural) are serious, dignified dogs with a calm, steady presence that belies their lightning-fast reactions when a threat appears. They are fiercely loyal to their families and their flock, and their protective instincts are deep and instinctive rather than trained. They are independent thinkers who were bred to make decisions without human guidance, which means they need an owner who respects their intelligence while providing consistent leadership.",
    "description_el": "Το Κομοντόρ είναι μία από τις πιο εντυπωσιακές οπτικά ράτσες σκύλων στον κόσμο, αμέσως αναγνωρίσιμο από το τεράστιο μέγεθος και το μοναδικό λευκό τρίχωμα σε σχοινιά που μοιάζει με σφουγγαρίστρα ή dreadlocks. Αυτός ο αρχαίος ουγγρικός φύλακας ζώων έχει προστατεύει κοπάδια προβάτων και βοοειδών στις ουγγρικές πεδιάδες (puszta) για πάνω από χίλια χρόνια. Το εξαιρετικό τρίχωμά τους εξυπηρετούσε ζωτικό σκοπό — τα βαριά, λευκά σχοινιά τα καμουφλάριζαν ανάμεσα στα πρόβατα ενώ παρείχαν μόνωση και προστασία σαν πανοπλία ενάντια σε δαγκώματα λύκων και αρκούδων. Τα Κομοντόρ είναι σοβαρά, αξιοπρεπή σκυλιά με ήρεμη, σταθερή παρουσία που κρύβει τις αστραπιαίες αντιδράσεις τους. Είναι εξαιρετικά πιστά στην οικογένειά τους και τα προστατευτικά τους ένστικτα είναι βαθιά και ενστικτώδη. Είναι ανεξάρτητοι σκεφτόμενοι που χρειάζονται ιδιοκτήτη που σέβεται τη νοημοσύνη τους παρέχοντας συνεπή ηγεσία.",
    "characteristics": { "energy": 3, "grooming": 5, "friendliness": 2, "trainability": 3, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Komondorok need moderate daily exercise — they are not hyperactive dogs but need regular walks and opportunities to patrol and explore. Their extraordinary corded coat is the breed's most demanding feature — cords begin forming around 8-12 months of age and must be carefully separated by hand regularly to prevent them from matting into massive, unmanageable plates. The coat takes years to fully develop and can reach the ground on mature dogs. Bathing requires soaking the cords thoroughly and can take hours to dry, even with fans — some owners use a 'cage dryer' setup. The coat must be completely dried to prevent mildew. Komondorok are independent and can be stubborn, requiring firm, consistent training from an experienced owner. Early, extensive socialization is absolutely critical — without it, their natural protectiveness can become problematic aggression toward any unfamiliar person or animal. They are not suited to first-time dog owners, apartments, or homes without secure fencing.",
    "care_el": "Τα Κομοντόρ χρειάζονται μέτρια καθημερινή άσκηση — δεν είναι υπερκινητικά αλλά χρειάζονται τακτικές βόλτες. Το εξαιρετικό τρίχωμα σε σχοινιά είναι το πιο απαιτητικό χαρακτηριστικό — τα σχοινιά αρχίζουν να σχηματίζονται στους 8-12 μήνες και πρέπει να διαχωρίζονται προσεκτικά με το χέρι τακτικά. Το τρίχωμα χρειάζεται χρόνια για να αναπτυχθεί πλήρως. Το μπάνιο απαιτεί μουλιάσματα και μπορεί να πάρει ώρες για να στεγνώσει. Τα Κομοντόρ είναι ανεξάρτητα και μπορεί να είναι πεισματάρικα, απαιτώντας σταθερή εκπαίδευση. Η πρώιμη, εκτενής κοινωνικοποίηση είναι απολύτως κρίσιμη — χωρίς αυτήν, η φυσική τους προστατευτικότητα μπορεί να γίνει προβληματική επιθετικότητα. Δεν είναι κατάλληλα για πρωτάρηδες, διαμερίσματα ή σπίτια χωρίς ασφαλή περίφραξη.",
    "health_en": "Komondorok can be prone to hip dysplasia, which should be screened in breeding stock through OFA or PennHIP evaluations. Bloat (gastric dilatation-volvulus) is a serious risk in this large, deep-chested breed — preventive gastropexy surgery may be recommended. Entropion, where the eyelid rolls inward causing the lashes to irritate the cornea, occurs in some dogs and may require surgical correction. Their heavy corded coat can mask skin problems, so regular skin checks during grooming are important. Ear infections can develop due to the heavy coat around the ears trapping moisture. Some Komondorok may develop juvenile cataracts. They can also be sensitive to certain anesthetics. Maintaining a healthy weight and providing joint-supportive nutrition helps manage the strain that their large size places on their skeletal system. With proper care and health screening, Komondorok typically live 10-12 years.",
    "health_el": "Τα Κομοντόρ μπορεί να είναι επιρρεπή σε δυσπλασία ισχίου. Το φούσκωμα (GDV) είναι σοβαρός κίνδυνος σε αυτή τη μεγάλη ράτσα — μπορεί να συνισταται προληπτική χειρουργική γαστροπηξία. Το εντρόπιο, όπου το βλέφαρο γυρίζει προς τα μέσα, εμφανίζεται σε ορισμένα σκυλιά. Το βαρύ τρίχωμα μπορεί να κρύβει δερματικά προβλήματα. Λοιμώξεις αυτιών μπορεί να αναπτυχθούν. Ορισμένα μπορεί να αναπτύξουν νεανικό καταρράκτη. Η διατήρηση υγιούς βάρους και η παροχή διατροφής υποστήριξης αρθρώσεων βοηθά. Με σωστή φροντίδα, τα Κομοντόρ ζουν τυπικά 10-12 χρόνια."
  },
  {
    "id": "kuvasz",
    "slug": "kuvasz",
    "name_en": "Kuvasz",
    "name_el": "Κούβας",
    "type": "dog",
    "origin": "Hungary",
    "originCode": "HU",
    "images": [],
    "size": "giant",
    "lifespan": "10-12 years",
    "temperament_en": ["Loyal", "Fearless", "Patient", "Protective", "Intelligent"],
    "temperament_el": ["Πιστός", "Ατρόμητος", "Υπομονετικός", "Προστατευτικός", "Έξυπνος"],
    "description_en": "The Kuvasz is a majestic Hungarian livestock guardian breed with a stunning white, wavy to slightly curly coat that has protected flocks and estates in Hungary for centuries. The breed's name likely derives from the Turkish 'kawasz' meaning armed guard, reflecting their long history as protectors. During the reign of King Matthias Corvinus in the 15th century, Kuvaszok were highly prized as royal guard dogs and hunting companions, and owning one was considered a mark of prestige. The breed nearly went extinct during World War II when German and Soviet soldiers killed the dogs that tried to protect their families — by war's end, fewer than 30 Kuvaszok remained in Hungary. They are large, powerful, and impressively athletic dogs with a noble bearing and intelligent, thoughtful expression. Kuvaszok are deeply loyal to their families and will protect them without hesitation, but they are patient and gentle with those they love, especially children. They are independent thinkers bred to guard without human direction, which makes them both admirable and challenging as companions.",
    "description_el": "Το Κούβας είναι μια μεγαλοπρεπής ουγγρική ράτσα φύλακα ζώων με εκπληκτικό λευκό, κυματιστό τρίχωμα που έχει προστατεύει κοπάδια και κτήματα στην Ουγγαρία για αιώνες. Κατά τη βασιλεία του Βασιλιά Matthias Corvinus τον 15ο αιώνα, τα Κούβας ήταν πολύ εκτιμημένα ως βασιλικοί σκύλοι φρουροί και σύντροφοι κυνηγιού. Η ράτσα σχεδόν εξαφανίστηκε κατά τον Β' Παγκόσμιο Πόλεμο — στο τέλος του πολέμου, λιγότερα από 30 Κούβας παρέμεναν στην Ουγγαρία. Είναι μεγάλα, δυνατά και εντυπωσιακά αθλητικά σκυλιά με ευγενική στάση. Τα Κούβας είναι βαθιά πιστά στις οικογένειές τους και θα τις προστατεύσουν χωρίς δισταγμό, αλλά είναι υπομονετικά και ήπια με αυτούς που αγαπούν, ειδικά τα παιδιά. Είναι ανεξάρτητοι σκεφτόμενοι που εκτράφηκαν για φύλαξη χωρίς ανθρώπινη καθοδήγηση.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 2, "trainability": 3, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "Kuvaszok need regular exercise and ample space — they are not suited to apartments or small yards. Daily walks, patrols of their territory, and play sessions help maintain their physical and mental health. Their white, wavy double coat requires regular brushing 2-3 times per week to prevent matting and manage shedding, which can be substantial. They are natural self-groomers and tend to stay surprisingly clean for large white dogs. Kuvaszok are intelligent but independent, requiring firm, consistent, and patient training from an experienced owner who understands livestock guardian breeds. Harsh methods will be met with resistance or mistrust. Extensive early socialization is critical — exposure to many people, animals, and situations helps develop a well-adjusted adult that can distinguish actual threats from normal activities. They are not suited to first-time dog owners and require someone who respects their guardian heritage while providing appropriate structure and boundaries.",
    "care_el": "Τα Κούβας χρειάζονται τακτική άσκηση και άφθονο χώρο — δεν είναι κατάλληλα για διαμερίσματα. Καθημερινές βόλτες, περιπολίες στην επικράτειά τους και παιχνίδι βοηθούν. Το λευκό, κυματιστό διπλό τρίχωμα απαιτεί βούρτσισμα 2-3 φορές την εβδομάδα. Είναι φυσικά αυτοπεριποιούμενα. Τα Κούβας είναι έξυπνα αλλά ανεξάρτητα, απαιτώντας σταθερή, συνεπή και υπομονετική εκπαίδευση από έμπειρο ιδιοκτήτη. Η εκτενής πρώιμη κοινωνικοποίηση είναι κρίσιμη. Δεν είναι κατάλληλα για πρωτάρηδες ιδιοκτήτες.",
    "health_en": "Kuvaszok can be prone to hip and elbow dysplasia, which should be screened in all breeding stock. Osteochondritis dissecans (OCD) can affect young, growing dogs. Bloat (GDV) is a serious concern in this large, deep-chested breed. Hypothyroidism may develop and should be monitored. Some Kuvaszok may develop osteosarcoma (bone cancer), which unfortunately carries a poor prognosis. Progressive retinal atrophy and other eye conditions can occur. Hypertrophic osteodystrophy (HOD) can affect puppies during rapid growth phases. Due to the breed's reduced genetic diversity from the post-WWII bottleneck, responsible breeders work to maintain healthy bloodlines through careful genetic management. Regular cardiac, thyroid, hip, elbow, and eye screenings are recommended for breeding dogs and pets. With proper care, Kuvaszok typically live 10-12 years.",
    "health_el": "Τα Κούβας μπορεί να είναι επιρρεπή σε δυσπλασία ισχίου και αγκώνα. Η οστεοχόνδρωση μπορεί να επηρεάσει νεαρούς σκύλους. Το φούσκωμα (GDV) είναι σοβαρή ανησυχία. Ο υποθυρεοειδισμός μπορεί να αναπτυχθεί. Ορισμένα Κούβας μπορεί να αναπτύξουν οστεοσάρκωμα. Λόγω μειωμένης γενετικής ποικιλομορφίας, οι υπεύθυνοι εκτροφείς εργάζονται για τη διατήρηση υγιών γραμμών αίματος. Συνιστώνται τακτικοί έλεγχοι. Με σωστή φροντίδα ζουν τυπικά 10-12 χρόνια."
  },
  {
    "id": "lancashire-heeler",
    "slug": "lancashire-heeler",
    "name_en": "Lancashire Heeler",
    "name_el": "Λάνκασιρ Χίλερ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Lively", "Alert", "Friendly", "Intelligent", "Resilient"],
    "temperament_el": ["Ζωηρός", "Επαγρύπνος", "Φιλικός", "Έξυπνος", "Ανθεκτικός"],
    "description_en": "The Lancashire Heeler is a small, sturdy English breed that originated in the Lancashire and Ormskirk regions of northwestern England, where they were used to drive cattle to market by nipping at their heels. They likely descend from crosses between Welsh Corgis and Manchester Terriers, combining herding ability with ratting skill. Lancashire Heelers are low-set, powerful little dogs with a distinctive black and tan or liver and tan coat, bright alert eyes, and a characteristic 'Heeler smile' — a unique expression where they draw back their lips to show their teeth in a grin. Despite their small size, they are remarkably tough, resilient, and versatile workers. The breed is classified as a Vulnerable Native Breed by the Kennel Club, with relatively few registered annually. Lancashire Heelers are friendly, intelligent, and full of character, forming strong bonds with their families. They retain both herding and terrier instincts, making them active, alert, and sometimes mischievous companions.",
    "description_el": "Το Lancashire Heeler είναι μια μικρή, ανθεκτική αγγλική ράτσα που κατάγεται από τις περιοχές Lancashire και Ormskirk, όπου χρησιμοποιούνταν για να οδηγούν βοοειδή στην αγορά τσιμπώντας τις φτέρνες τους. Πιθανώς κατάγονται από διασταυρώσεις μεταξύ Ουαλικών Κόργκι και Manchester Terrier. Τα Lancashire Heeler είναι χαμηλά, δυνατά σκυλάκια με χαρακτηριστικό μαύρο και ταν τρίχωμα και ένα χαρακτηριστικό 'χαμόγελο Heeler' — μια μοναδική έκφραση. Παρά το μικρό τους μέγεθος, είναι αξιοσημείωτα σκληρά και ευέλικτα. Η ράτσα ταξινομείται ως Ευάλωτη Ιθαγενής Ράτσα από τo Kennel Club. Είναι φιλικά, έξυπνα και γεμάτα χαρακτήρα, διατηρώντας τόσο ποιμενικά όσο και ένστικτα τεριέ.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 4, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Lancashire Heelers need regular daily exercise and mental stimulation — about 45 minutes to an hour of walks, play, and training. They enjoy agility, obedience, and earthdog trials. Their short, weather-resistant coat requires only weekly brushing and minimal grooming. They are intelligent and enjoy learning but can have a stubborn, independent streak from their terrier heritage. Positive, consistent training with variety works best. Early socialization helps develop a well-rounded dog. They may have a prey drive toward small animals due to their ratting background. Lancashire Heelers are generally good with children when raised together and adapt well to various living situations, including apartments, as long as they receive adequate exercise and mental engagement.",
    "care_el": "Τα Lancashire Heeler χρειάζονται τακτική καθημερινή άσκηση — περίπου 45 λεπτά ώς μία ώρα. Απολαμβάνουν ευκινησία, υπακοή και δοκιμές. Το κοντό τρίχωμά τους απαιτεί μόνο εβδομαδιαίο βούρτσισμα. Είναι έξυπνα αλλά μπορεί να έχουν πεισματάρικη τάση από την κληρονομιά τεριέ. Θετική, συνεπής εκπαίδευση με ποικιλία λειτουργεί καλύτερα. Η πρώιμη κοινωνικοποίηση βοηθά. Μπορεί να έχουν ένστικτο κυνηγιού μικρών ζώων. Προσαρμόζονται καλά σε διάφορες συνθήκες διαβίωσης.",
    "health_en": "Lancashire Heelers can be prone to primary lens luxation (PLL), a painful eye condition where the lens becomes displaced — DNA testing is available and essential for breeding dogs. Collie eye anomaly (CEA) has been identified in the breed, likely from their Corgi heritage. Patellar luxation may occur in some individuals. Some Lancashire Heelers develop persistent pupillary membranes (PPM), another eye condition. Due to their small gene pool, genetic diversity is an important consideration. They are otherwise generally a robust, long-lived small breed with good overall health. Regular eye exams, DNA testing for PLL, and choosing a breeder who participates in health testing programs are recommended for ensuring the healthiest possible Lancashire Heeler.",
    "health_el": "Τα Lancashire Heeler μπορεί να είναι επιρρεπή σε πρωτοπαθή εξάρθρωση φακού (PLL), μια οδυνηρή οφθαλμολογική πάθηση — υπάρχει διαθέσιμο DNA τεστ. Η Collie eye anomaly (CEA) έχει αναγνωριστεί στη ράτσα. Η εξάρθρωση επιγονατίδας μπορεί να εμφανιστεί. Λόγω του μικρού γενετικού αποθέματος, η γενετική ποικιλομορφία είναι σημαντική. Είναι γενικά εύρωστη, μακρόβια μικρή ράτσα. Συνιστώνται τακτικές οφθαλμολογικές εξετάσεις και DNA τεστ για PLL."
  },
  {
    "id": "maremma-sheepdog",
    "slug": "maremma-sheepdog",
    "name_en": "Maremma Sheepdog",
    "name_el": "Ποιμενικός της Μαρέμμα",
    "type": "dog",
    "origin": "Italy",
    "originCode": "IT",
    "images": [],
    "size": "large",
    "lifespan": "11-13 years",
    "temperament_en": ["Loyal", "Protective", "Calm", "Independent", "Courageous"],
    "temperament_el": ["Πιστός", "Προστατευτικός", "Ήρεμος", "Ανεξάρτητος", "Θαρραλέος"],
    "description_en": "The Maremma Sheepdog (Cane da Pastore Maremmano-Abruzzese) is an ancient Italian livestock guardian breed that has protected sheep and goats in the Maremma marshlands and Abruzzi mountains of central Italy for over 2,000 years. They are large, imposing dogs with a thick, slightly wavy white coat that helped them blend with the flocks they guarded. Maremmas were bred to live with their sheep full-time, bonding with the flock as a member rather than working at a handler's direction. This deep bonding instinct extends to their families, whom they protect with calm vigilance and unwavering courage. In modern times, Maremmas have gained attention for their use in conservation — in Australia, they've been successfully employed to protect endangered penguin colonies from foxes, an innovation that inspired the movie 'Oddball.' They are calm, steady, and dignified dogs that are affectionate with their inner circle but maintain a natural wariness of unfamiliar people and animals. They are intelligent but independent, and their guardian instincts are deeply ingrained.",
    "description_el": "Ο Ποιμενικός της Μαρέμμα (Cane da Pastore Maremmano-Abruzzese) είναι αρχαία ιταλική ράτσα φύλακα ζώων που προστατεύει πρόβατα και κατσίκες στα έλη της Μαρέμμα και τα βουνά Abruzzi της κεντρικής Ιταλίας για πάνω από 2.000 χρόνια. Είναι μεγάλα, επιβλητικά σκυλιά με πυκνό λευκό τρίχωμα. Στους σύγχρονους καιρούς, οι Μαρέμμα έχουν κερδίσει προσοχή για τη χρήση τους στη διατήρηση — στην Αυστραλία χρησιμοποιούνται επιτυχώς για να προστατεύουν αποικίες απειλούμενων πιγκουίνων από αλεπούδες. Είναι ήρεμα, σταθερά και αξιοπρεπή σκυλιά που είναι στοργικά με τον εσωτερικό τους κύκλο αλλά διατηρούν φυσική επιφυλακτικότητα. Είναι έξυπνα αλλά ανεξάρτητα.",
    "characteristics": { "energy": 3, "grooming": 3, "friendliness": 3, "trainability": 3, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Maremma Sheepdogs need moderate daily exercise and ample space — they are best suited to rural or semi-rural properties where they can patrol and guard. Their thick white coat requires regular brushing 2-3 times per week and more during shedding seasons. They are naturally clean and tend to self-groom. Early and extensive socialization is essential for Maremmas kept as family companions, as their instinct is to be wary of anything unfamiliar. Training requires patience and respect for their independent nature — they are not dogs that will blindly obey commands. They are most effective with experienced owners who understand guardian breed behavior. Maremmas can be vocal, particularly at night when they are most alert, which may be problematic in suburban or urban environments. Secure fencing is essential as they will patrol and expand their territory if given the opportunity.",
    "care_el": "Οι Ποιμενικοί της Μαρέμμα χρειάζονται μέτρια καθημερινή άσκηση και άφθονο χώρο. Το πυκνό λευκό τρίχωμα απαιτεί βούρτσισμα 2-3 φορές την εβδομάδα. Η πρώιμη κοινωνικοποίηση είναι απαραίτητη. Η εκπαίδευση απαιτεί υπομονή και σεβασμό στην ανεξάρτητη φύση τους. Μπορεί να είναι φωνακλά, ιδιαίτερα τη νύχτα. Η ασφαλής περίφραξη είναι απαραίτητη.",
    "health_en": "Maremma Sheepdogs are generally a robust and healthy breed. Hip dysplasia is the primary orthopedic concern and should be screened in breeding stock. Bloat (GDV) can occur in this large breed. They may develop eye conditions including entropion. Some Maremmas can be prone to sensitivity to anesthesia. Their thick coat can harbor ticks and other parasites, so regular parasite prevention is important. Regular veterinary checkups, maintaining a healthy weight, and appropriate exercise support their long-term health. They are generally long-lived for a large breed, often reaching 11-13 years.",
    "health_el": "Οι Ποιμενικοί της Μαρέμμα είναι γενικά εύρωστη και υγιής ράτσα. Η δυσπλασία ισχίου είναι η κύρια ορθοπεδική ανησυχία. Το φούσκωμα μπορεί να εμφανιστεί. Μπορεί να αναπτύξουν εντρόπιο. Το πυκνό τρίχωμα μπορεί να φιλοξενήσει τσιμπούρια. Συνιστώνται τακτικοί κτηνιατρικοί έλεγχοι. Ζουν γενικά 11-13 χρόνια."
  },
  {
    "id": "miniature-american-shepherd",
    "slug": "miniature-american-shepherd",
    "name_en": "Miniature American Shepherd",
    "name_el": "Μικροσκοπικός Αμερικανός Ποιμενικός",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Intelligent", "Loyal", "Energetic", "Good-natured", "Trainable"],
    "temperament_el": ["Έξυπνος", "Πιστός", "Ενεργητικός", "Καλόκαρδος", "Εκπαιδεύσιμος"],
    "description_en": "The Miniature American Shepherd (MAS) was developed in California in the late 1960s by selectively breeding smaller Australian Shepherds to create a compact, travel-friendly herding companion that retained all the intelligence and versatility of the full-sized Aussie. Originally known as the 'Miniature Australian Shepherd,' the breed was renamed when it gained AKC recognition in 2015 to distinguish it as its own breed. MAS are small to medium-sized dogs standing 13-18 inches tall, with the same striking merle and solid coat patterns and expressive eyes as their larger cousins. They are highly intelligent, loyal, and energetic dogs that excel in agility, obedience, rally, and herding — often dominating the small dog divisions at competitions. Their compact size makes them excellent travel companions and well-suited to apartment living, provided they receive adequate exercise and mental stimulation. MAS are good-natured and friendly, making them wonderful family dogs that get along well with children and other pets.",
    "description_el": "Ο Μικροσκοπικός Αμερικανός Ποιμενικός αναπτύχθηκε στην Καλιφόρνια στα τέλη της δεκαετίας του 1960 εκτρέφοντας επιλεκτικά μικρότερους Αυστραλιανούς Ποιμενικούς για να δημιουργηθεί ένας συμπαγής, φιλικός προς τα ταξίδια ποιμενικός σύντροφος. Είναι μικρού ώς μεσαίου μεγέθους σκύλοι 33-46 εκ., με τα ίδια εντυπωσιακά merle σχέδια και εκφραστικά μάτια. Είναι εξαιρετικά έξυπνοι, πιστοί και ενεργητικοί σκύλοι που διαπρέπουν στην ευκινησία, υπακοή, rally και ποίμανση. Το συμπαγές μέγεθός τους τα καθιστά εξαιρετικούς ταξιδιωτικούς συντρόφους και κατάλληλα για ζωή σε διαμέρισμα. Είναι καλόκαρδα και φιλικά, κάνοντάς τα υπέροχα οικογενειακά σκυλιά.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Miniature American Shepherds need significant daily exercise despite their smaller size — at least an hour of vigorous activity including walks, runs, play, and training sessions. They are athletic and excel in dog sports. Their medium-length double coat requires brushing 2-3 times per week, with daily brushing during seasonal shedding. They are highly trainable and eager to please, thriving on positive reinforcement training. Mental stimulation is essential — puzzle toys, trick training, and interactive games help prevent boredom. Early socialization helps develop confident, well-rounded adults. They may retain herding instincts and attempt to herd children or other pets through circling and nipping. MAS bond closely with their families and can develop separation anxiety if left alone excessively.",
    "care_el": "Οι Μικροσκοπικοί Αμερικανοί Ποιμενικοί χρειάζονται σημαντική καθημερινή άσκηση παρά το μικρότερο μέγεθός τους — τουλάχιστον μία ώρα. Είναι αθλητικοί και διαπρέπουν σε αθλήματα σκύλων. Το τρίχωμα μέσου μήκους απαιτεί βούρτσισμα 2-3 φορές την εβδομάδα. Είναι εξαιρετικά εκπαιδεύσιμοι. Η νοητική διέγερση είναι απαραίτητη. Η πρώιμη κοινωνικοποίηση βοηθά. Μπορεί να διατηρούν ποιμενικά ένστικτα.",
    "health_en": "Miniature American Shepherds share many of the same health considerations as Australian Shepherds. The MDR1 gene mutation is common in the breed, causing sensitivity to certain medications — all MAS should be DNA tested. Hip dysplasia should be screened in breeding stock. Progressive retinal atrophy (PRA) and hereditary cataracts can affect vision — DNA testing is available. Merle-to-merle breeding must be avoided to prevent double merle puppies with vision and hearing deficits. Some MAS may develop epilepsy. Patellar luxation can occur in smaller individuals. Dental issues may be more common in smaller dogs. Regular health screening including MDR1 testing, eye exams, hip evaluations, and genetic testing for PRA are recommended for all breeding dogs.",
    "health_el": "Οι Μικροσκοπικοί Αμερικανοί Ποιμενικοί μοιράζονται πολλές ανησυχίες υγείας με τους Αυστραλιανούς Ποιμενικούς. Η γονιδιακή μετάλλαξη MDR1 είναι κοινή — όλοι πρέπει να ελεγχθούν με DNA. Η δυσπλασία ισχίου πρέπει να ελέγχεται. Η PRA και ο κληρονομικός καταρράκτης μπορεί να επηρεάσουν την όραση. Η εκτροφή merle με merle πρέπει να αποφεύγεται. Ορισμένοι μπορεί να αναπτύξουν επιληψία. Συνιστώνται τακτικοί έλεγχοι υγείας."
  },
  {
    "id": "mudi",
    "slug": "mudi",
    "name_en": "Mudi",
    "name_el": "Μούντι",
    "type": "dog",
    "origin": "Hungary",
    "originCode": "HU",
    "images": [],
    "size": "medium",
    "lifespan": "13-15 years",
    "temperament_en": ["Energetic", "Intelligent", "Loyal", "Alert", "Courageous"],
    "temperament_el": ["Ενεργητικός", "Έξυπνος", "Πιστός", "Επαγρύπνος", "Θαρραλέος"],
    "description_en": "The Mudi (pronounced 'MOO-dee', plural Mudik) is a lesser-known Hungarian herding breed that was 'discovered' as a distinct type in 1936 by Dr. Dezső Fényes, though the breed type had existed naturally among Hungarian farm dogs for centuries. They are medium-sized, agile dogs with a distinctive wavy to curly coat that comes in a wide range of colors including black, white, fawn, brown, gray, and the striking merle pattern known as 'cifra.' Their face and front legs have short, smooth hair, while the body coat is longer and wavy. Mudik are remarkably versatile working dogs — in Hungary, they herd cattle, sheep, and even difficult livestock like unruly bulls, and they also excel at hunting wild boar. They are energetic, extremely intelligent, and courageous, with a strong desire to work and bond closely with their handler. Despite their many talents, the Mudi remains rare, with only a few thousand registered worldwide, primarily in Hungary and Finland. Their combination of athleticism, intelligence, and devotion makes them outstanding companions for active, experienced dog owners.",
    "description_el": "Το Μούντι (προφέρεται 'ΜΟΥ-ντι', πληθ. Mudik) είναι μια λιγότερο γνωστή ουγγρική ποιμενική ράτσα. Είναι μεσαίου μεγέθους, ευκίνητα σκυλιά με χαρακτηριστικό κυματιστό ώς σγουρό τρίχωμα σε ευρύ φάσμα χρωμάτων. Τα Mudik είναι αξιοσημείωτα ευέλικτα εργατικά σκυλιά — στην Ουγγαρία ποιμαίνουν βοοειδή, πρόβατα ακόμα και δύσκολα ζώα, και επίσης διαπρέπουν στο κυνήγι αγριόχοιρου. Είναι ενεργητικά, εξαιρετικά έξυπνα και θαρραλέα, με ισχυρή επιθυμία εργασίας. Παρά τα πολλά ταλέντα τους, παραμένουν σπάνια ράτσα.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Mudik need plenty of daily exercise and mental stimulation — at least 1-2 hours of vigorous activity. They excel in agility, flyball, herding, disc dog, and virtually any dog sport that challenges them physically and mentally. Their wavy coat is surprisingly low-maintenance, requiring only weekly brushing. They are highly intelligent and thrive on learning — training should be varied and engaging. Early socialization helps them develop confidence in new situations. They can be vocal and may bark when excited or alerting. Mudik form close bonds with their handlers and do best in active households where they are included in daily activities. They may be reserved with strangers but warm up once properly introduced.",
    "care_el": "Τα Μούντι χρειάζονται πολλή καθημερινή άσκηση και νοητική διέγερση — τουλάχιστον 1-2 ώρες. Διαπρέπουν σε ευκινησία, flyball, ποίμανση και σχεδόν κάθε αγώνισμα σκύλων. Το κυματιστό τρίχωμα απαιτεί μόνο εβδομαδιαίο βούρτσισμα. Είναι εξαιρετικά έξυπνα. Η πρώιμη κοινωνικοποίηση βοηθά. Μπορεί να είναι φωνακλά. Δημιουργούν στενούς δεσμούς με τους χειριστές τους.",
    "health_en": "Mudik are generally a healthy and long-lived breed. Hip dysplasia can occur but at relatively low rates. Patellar luxation may affect some individuals. Epilepsy has been reported in some lines. Eye conditions including cataracts are occasionally seen. Due to the breed's rarity and relatively small gene pool, genetic diversity management is important for breeders. They are otherwise a robust breed with good longevity, often living 13-15 years with proper care. Regular veterinary checkups, health screening of breeding dogs, and choosing a breeder committed to the breed's long-term health are the best strategies for a healthy Mudi.",
    "health_el": "Τα Μούντι είναι γενικά υγιής και μακρόβια ράτσα. Η δυσπλασία ισχίου μπορεί να εμφανιστεί αλλά σε σχετικά χαμηλά ποσοστά. Η εξάρθρωση επιγονατίδας μπορεί να επηρεάσει ορισμένα άτομα. Η επιληψία έχει αναφερθεί. Λόγω σπανιότητας, η γενετική ποικιλομορφία είναι σημαντική. Ζουν συχνά 13-15 χρόνια."
  },
  {
    "id": "norwegian-buhund",
    "slug": "norwegian-buhund",
    "name_en": "Norwegian Buhund",
    "name_el": "Νορβηγικός Μπούχουντ",
    "type": "dog",
    "origin": "Norway",
    "originCode": "NO",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Friendly", "Energetic", "Loyal", "Intelligent", "Vocal"],
    "temperament_el": ["Φιλικός", "Ενεργητικός", "Πιστός", "Έξυπνος", "Φωνακλάς"],
    "description_en": "The Norwegian Buhund is an ancient Nordic spitz-type breed that has been a companion to Norwegian farmers and Vikings for over a thousand years. Archaeological evidence shows Buhund-type dogs were buried alongside their Viking owners in the Gokstad ship burial dating to around 900 AD. The name 'bu' means farm or homestead in Norwegian, reflecting their centuries-long role as all-purpose farm dogs used for herding livestock, guarding property, and hunting. Norwegian Buhunds are medium-sized, well-proportioned dogs with a dense, wheaten or black double coat, erect ears, and a tightly curled tail characteristic of spitz breeds. They are friendly, energetic, and remarkably loyal dogs that form strong bonds with their families. Their intelligence, eagerness to please, and alert nature make them excellent companions for active families. They are versatile enough to excel in herding, agility, obedience, and even as hearing dogs for the deaf in some countries.",
    "description_el": "Ο Νορβηγικός Μπούχουντ είναι αρχαία σκανδιναβική ράτσα τύπου spitz που συντρόφευε Νορβηγούς αγρότες και Βίκινγκ για πάνω από χίλια χρόνια. Αρχαιολογικά ευρήματα δείχνουν ότι σκύλοι τύπου Buhund θάφτηκαν μαζί με τους Βίκινγκ ιδιοκτήτες τους στην ταφή πλοίου Gokstad γύρω στο 900 μ.Χ. Το 'bu' σημαίνει φάρμα στα νορβηγικά. Είναι μεσαίου μεγέθους σκυλιά με πυκνό διπλό τρίχωμα, όρθια αυτιά και σφιχτά κυρτή ουρά. Είναι φιλικοί, ενεργητικοί και αξιοσημείωτα πιστοί σκύλοι. Η νοημοσύνη τους και η πρόθυμη φύση τους τα καθιστούν εξαιρετικούς συντρόφους.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Norwegian Buhunds need regular daily exercise — about an hour of walking, play, or activities. They enjoy agility, obedience, herding, and outdoor adventures. Their dense double coat requires weekly brushing, with daily grooming during seasonal shedding. They are eager to please and respond well to positive reinforcement training. One significant characteristic is their tendency to bark — Buhunds are naturally vocal dogs that use barking to communicate, alert, and express excitement. Bark management training should begin early. They are generally friendly with everyone including strangers, children, and other animals. Norwegian Buhunds thrive on companionship and should not be isolated from their families. They adapt well to various living situations as long as their exercise and mental stimulation needs are met.",
    "care_el": "Οι Νορβηγικοί Μπούχουντ χρειάζονται τακτική καθημερινή άσκηση — περίπου μία ώρα. Απολαμβάνουν ευκινησία, υπακοή και υπαίθριες περιπέτειες. Το πυκνό διπλό τρίχωμα απαιτεί εβδομαδιαίο βούρτσισμα. Ανταποκρίνονται καλά σε θετική εκπαίδευση. Είναι φυσικά φωνακλά σκυλιά — η εκπαίδευση γαυγίσματος πρέπει να ξεκινά νωρίς. Είναι γενικά φιλικοί με όλους. Ευδοκιμούν με συντροφιά.",
    "health_en": "Norwegian Buhunds are generally a healthy breed with good longevity. Hip dysplasia should be screened in breeding stock. Hereditary cataracts are the most commonly reported eye condition and breeders should have dogs examined by a veterinary ophthalmologist. Some Buhunds may develop chronic intestinal conditions. Von Willebrand's disease (a blood clotting disorder) has been reported in rare cases. They are otherwise a robust, naturally healthy breed that has benefited from responsible breeding practices in Scandinavian countries. Regular veterinary checkups, eye screening, and hip evaluation are recommended for breeding dogs. With proper care, Norwegian Buhunds typically live 12-15 years.",
    "health_el": "Οι Νορβηγικοί Μπούχουντ είναι γενικά υγιής ράτσα. Η δυσπλασία ισχίου πρέπει να ελέγχεται. Ο κληρονομικός καταρράκτης είναι η πιο συχνά αναφερόμενη οφθαλμολογική πάθηση. Η νόσος Von Willebrand (διαταραχή πήξης αίματος) έχει αναφερθεί σπάνια. Είναι εύρωστη ράτσα. Ζουν τυπικά 12-15 χρόνια."
  },
  {
    "id": "old-english-sheepdog",
    "slug": "old-english-sheepdog",
    "name_en": "Old English Sheepdog",
    "name_el": "Παλαιοαγγλικός Ποιμενικός",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Adaptable", "Intelligent", "Gentle", "Sociable", "Playful"],
    "temperament_el": ["Προσαρμοστικός", "Έξυπνος", "Ήπιος", "Κοινωνικός", "Παιχνιδιάρης"],
    "description_en": "The Old English Sheepdog (OES), also known as the 'Bobtail,' is a large, shaggy breed that originated in England in the early 19th century as a drover's dog used to drive cattle and sheep to market. Their distinctive profuse gray and white coat, ambling bear-like gait, and peek-a-boo hairstyle covering their eyes make them one of the most recognizable breeds in the world. The breed gained massive popular culture recognition through the Dulux paint brand advertisements in the UK and the 1959 Disney film 'The Shaggy Dog.' OES are adaptable, intelligent, and genuinely gentle dogs with a playful, clownish personality that endears them to everyone they meet. Despite their large size, they are remarkably gentle with children and are often called 'nanny dogs' for their protective watchfulness over young family members. They are sociable dogs that get along well with other animals and thrive on human companionship. Their intelligence and willingness to please make them surprisingly good at obedience and agility despite their shaggy appearance suggesting otherwise.",
    "description_el": "Ο Παλαιοαγγλικός Ποιμενικός, γνωστός επίσης ως 'Bobtail,' είναι μεγάλη, τριχωτή ράτσα που κατάγεται από την Αγγλία τον 19ο αιώνα. Το χαρακτηριστικό πλούσιο γκρι-λευκό τρίχωμα, το βαρύ βάδισμα σαν αρκούδα και το χτένισμα που καλύπτει τα μάτια τα καθιστούν μία από τις πιο αναγνωρίσιμες ράτσες. Είναι προσαρμοστικά, έξυπνα και γνήσια ήπια σκυλιά με παιχνιδιάρικη, κλόουν-ίσια προσωπικότητα. Παρά το μεγάλο μέγεθός τους, είναι αξιοσημείωτα ήπια με τα παιδιά. Είναι κοινωνικά σκυλιά που ευδοκιμούν με ανθρώπινη συντροφιά.",
    "characteristics": { "energy": 4, "grooming": 5, "friendliness": 5, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Old English Sheepdogs need regular daily exercise — about an hour of walking, play, or activities. Their coat is their most demanding feature, requiring daily brushing to prevent severe matting — this can take 30-60 minutes per session. Many pet owners opt for a shorter 'puppy clip' to reduce grooming time while maintaining the breed's charming appearance. Professional grooming every 6-8 weeks is recommended. Their heavy coat makes them susceptible to overheating in warm weather — access to air conditioning and shade is essential. They are intelligent and respond well to positive training. Early socialization helps develop their naturally friendly disposition. OES can be vocal and may bark or 'grumble' to communicate. They are devoted family dogs that do not do well when isolated from their people.",
    "care_el": "Οι Παλαιοαγγλικοί Ποιμενικοί χρειάζονται τακτική καθημερινή άσκηση — περίπου μία ώρα. Το τρίχωμα είναι το πιο απαιτητικό χαρακτηριστικό, απαιτώντας καθημερινό βούρτσισμα 30-60 λεπτά. Πολλοί ιδιοκτήτες επιλέγουν κοντότερο κούρεμα. Επαγγελματικό grooming κάθε 6-8 εβδομάδες συνιστάται. Το βαρύ τρίχωμα τα καθιστά ευαίσθητα στη ζέστη. Είναι έξυπνα και ανταποκρίνονται καλά σε θετική εκπαίδευση. Είναι αφοσιωμένα οικογενειακά σκυλιά.",
    "health_en": "Old English Sheepdogs can be prone to hip dysplasia, which should be screened in breeding stock. Cataracts and progressive retinal atrophy can affect vision — regular eye exams are recommended. Deafness, both congenital and age-related, occurs in the breed. Hypothyroidism is relatively common and can cause lethargy, weight gain, and coat changes. Autoimmune conditions including immune-mediated hemolytic anemia (IMHA) and thyroiditis are seen at elevated rates. Exercise-induced collapse (EIC) has been identified in some lines. Bloat can occur in this deep-chested breed. Cerebellar abiotrophy, a neurological condition, is rare but has been reported. Their heavy coat can mask weight changes, so regular weight monitoring during vet visits is important. Reputable breeders screen for hip, eye, thyroid, and cardiac conditions.",
    "health_el": "Οι Παλαιοαγγλικοί Ποιμενικοί μπορεί να είναι επιρρεπείς σε δυσπλασία ισχίου. Ο καταρράκτης και η PRA μπορεί να επηρεάσουν την όραση. Η κώφωση εμφανίζεται στη ράτσα. Ο υποθυρεοειδισμός είναι σχετικά κοινός. Αυτοάνοσες παθήσεις εμφανίζονται σε υψηλά ποσοστά. Το φούσκωμα μπορεί να εμφανιστεί. Το βαρύ τρίχωμα μπορεί να κρύψει αλλαγές βάρους. Οι αξιόπιστοι εκτροφείς ελέγχουν για ισχίο, μάτια, θυρεοειδή και καρδιακές παθήσεις."
  },
  {
    "id": "pembroke-welsh-corgi",
    "slug": "pembroke-welsh-corgi",
    "name_en": "Pembroke Welsh Corgi",
    "name_el": "Ουαλικός Κόργκι Πέμπροκ",
    "type": "dog",
    "origin": "Wales",
    "originCode": "GB",
    "images": [],
    "size": "small",
    "lifespan": "12-13 years",
    "temperament_en": ["Affectionate", "Smart", "Friendly", "Bold", "Playful"],
    "temperament_el": ["Στοργικός", "Έξυπνος", "Φιλικός", "Τολμηρός", "Παιχνιδιάρης"],
    "description_en": "The Pembroke Welsh Corgi is one of the most beloved and recognizable small breeds in the world, famously associated with Queen Elizabeth II, who owned more than 30 Pembrokes during her reign. Originating in Pembrokeshire, Wales, these compact herding dogs have been working on Welsh farms since at least the 10th century, likely descended from Spitz-type dogs brought by Flemish weavers. The Pembroke is distinguished from the Cardigan by its shorter body, pointed fox-like ears, and lack of tail (either naturally bobbed or docked). Despite standing only 10-12 inches tall, Pembrokes are surprisingly athletic, sturdy dogs with a bold, outgoing personality that far exceeds their small stature. They are exceptionally intelligent, ranking among the top 15 smartest dog breeds, and their eagerness to please combined with a natural playfulness makes them delightful companions. Pembrokes are affectionate and social dogs that genuinely enjoy being the center of attention. Their expressive faces, distinctive 'Corgi smile,' and comedic antics have made them internet sensations and one of the most popular breeds worldwide.",
    "description_el": "Το Ουαλικό Κόργκι Πέμπροκ είναι μία από τις πιο αγαπημένες και αναγνωρίσιμες μικρές ράτσες, φημισμένα συνδεδεμένη με τη Βασίλισσα Ελισάβετ Β'. Κατάγεται από το Pembrokeshire στην Ουαλία. Τα Πέμπροκ διακρίνονται από τα Καρντιγκάν από το κοντότερο σώμα, τα μυτερά αυτιά αλεπούδας και την απουσία ουράς. Παρά τα μόλις 25-30 εκ. ύψος, είναι εκπληκτικά αθλητικά, ανθεκτικά σκυλιά με τολμηρή προσωπικότητα. Είναι εξαιρετικά έξυπνα, στα 15 πιο έξυπνα, και η πρόθυμη φύση τους σε συνδυασμό με φυσική παιχνιδιάρικη διάθεση τα κάνει απολαυστικούς συντρόφους. Τα εκφραστικά πρόσωπα, το χαρακτηριστικό 'χαμόγελο Corgi' και οι κωμικές τους γκριμάτσες τα έχουν κάνει φαινόμενα του internet.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Pembroke Welsh Corgis need regular daily exercise — at least 45 minutes to an hour of walking, play, and activities. They are more athletic than their cute appearance suggests and enjoy agility, herding trials, and obedience. Their weather-resistant double coat requires weekly brushing, with daily grooming during their substantial seasonal shedding. Weight management is perhaps the most critical aspect of Pembroke care — they are extremely food-motivated and prone to obesity, which puts dangerous stress on their long spine and short legs. Strict portion control, limited treats, and regular exercise are essential. They are intelligent and generally easy to train with positive methods, though they can have a stubborn streak. Early socialization is beneficial. They may try to herd children and other pets by nipping at heels. Pembrokes are vocal dogs that bark to alert and communicate — training for appropriate barking is helpful.",
    "care_el": "Τα Ουαλικά Κόργκι Πέμπροκ χρειάζονται τακτική καθημερινή άσκηση — τουλάχιστον 45 λεπτά ως μία ώρα. Είναι πιο αθλητικά απ' ό,τι φαίνεται. Το διπλό τρίχωμα απαιτεί εβδομαδιαίο βούρτσισμα. Η διαχείριση βάρους είναι ίσως η πιο κρίσιμη πτυχή — είναι εξαιρετικά παρακινημένα από φαγητό και επιρρεπή σε παχυσαρκία. Αυστηρός έλεγχος μερίδων είναι απαραίτητος. Είναι έξυπνα αλλά μπορεί να είναι πεισματάρηδες. Μπορεί να προσπαθήσουν να ποιμάνουν παιδιά και κατοικίδια. Είναι φωνακλά σκυλιά.",
    "health_en": "Pembroke Welsh Corgis can be prone to intervertebral disc disease (IVDD) due to their long back and short legs — this is the breed's most significant health concern, and preventing obesity and excessive jumping are critical protective measures. Hip dysplasia should be screened in breeding dogs. Degenerative myelopathy (DM), a progressive spinal cord disease, can affect Pembrokes — DNA testing is available and recommended. Progressive retinal atrophy (PRA) and other eye conditions should be screened. Von Willebrand's disease (a bleeding disorder) occurs in some lines — DNA testing is available. Patent ductus arteriosus (PDA), a congenital heart defect, is seen at slightly elevated rates. Obesity is perhaps the most common and preventable health issue. Regular health screening including hip evaluation, eye exams, DNA testing for DM and vWD, and strict weight management are essential for a healthy Pembroke.",
    "health_el": "Τα Ουαλικά Κόργκι Πέμπροκ μπορεί να είναι επιρρεπή σε ασθένεια μεσοσπονδύλιου δίσκου (IVDD) — η πιο σημαντική ανησυχία υγείας. Η εκφυλιστική μυελοπάθεια (DM) μπορεί να επηρεάσει — υπάρχει DNA τεστ. Η PRA πρέπει να ελέγχεται. Η νόσος Von Willebrand εμφανίζεται σε ορισμένες γραμμές. Η παχυσαρκία είναι ίσως το πιο κοινό και αποτρέψιμο πρόβλημα υγείας. Συνιστώνται τακτικοί υγειονομικοί έλεγχοι."
  },
  {
    "id": "polish-lowland-sheepdog",
    "slug": "polish-lowland-sheepdog",
    "name_en": "Polish Lowland Sheepdog",
    "name_el": "Πολωνικός Πεδινός Ποιμενικός",
    "type": "dog",
    "origin": "Poland",
    "originCode": "PL",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Lively", "Intelligent", "Alert", "Calm", "Persistent"],
    "temperament_el": ["Ζωηρός", "Έξυπνος", "Επαγρύπνος", "Ήρεμος", "Πεισματάρης"],
    "description_en": "The Polish Lowland Sheepdog (Polski Owczarek Nizinny, commonly known as PON) is a medium-sized herding breed with a shaggy, long coat and an alert, perceptive expression. They have been working on the plains of Poland for centuries, herding and guarding sheep and cattle. The breed is believed to have contributed to the development of the Bearded Collie when Polish merchant Kazimierz Grabski traded PONs for Scottish sheep in 1514. The breed was nearly wiped out during World War II, and the modern breed descends largely from a single dog named Smok and the breeding efforts of Dr. Danuta Hryniewicz. PONs are lively, intelligent, and remarkably self-assured dogs with excellent memories — they are known for remembering both good and bad experiences for years. They are alert watchdogs that are calm and steady in the home but active and enthusiastic outdoors. PONs can be persistent and will cleverly find ways to get what they want, a trait that can be both endearing and challenging.",
    "description_el": "Ο Πολωνικός Πεδινός Ποιμενικός (Polski Owczarek Nizinny, γνωστός ως PON) είναι ποιμενική ράτσα μέσου μεγέθους με μακρύ τρίχωμα. Πιστεύεται ότι συνέβαλε στην ανάπτυξη του Bearded Collie. Η ράτσα σχεδόν εξαφανίστηκε κατά τον Β' Παγκόσμιο Πόλεμο. Οι PON είναι ζωηροί, έξυπνοι σκύλοι με εξαιρετική μνήμη. Είναι ήρεμοι στο σπίτι αλλά ενεργητικοί έξω. Μπορεί να είναι πεισματάρηδες.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 4, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Polish Lowland Sheepdogs need regular daily exercise — about an hour of walking, play, or structured activities. Their long, shaggy coat requires thorough brushing at least 3-4 times per week to prevent mats. Many owners keep them in a shorter clip for easier maintenance. They are intelligent and enjoy training but can be stubborn — consistent, positive methods with patience and humor work best. Their excellent memory means they quickly learn both good habits and bad ones. Early socialization helps develop confidence, particularly with strangers, as PONs can be reserved with people they don't know. They are generally good with children and other animals when properly socialized. PONs are alert watchdogs that will bark to announce visitors.",
    "care_el": "Οι Πολωνικοί Πεδινοί Ποιμενικοί χρειάζονται τακτική καθημερινή άσκηση — περίπου μία ώρα. Το μακρύ τρίχωμα απαιτεί βούρτσισμα 3-4 φορές την εβδομάδα. Είναι έξυπνοι αλλά μπορεί να είναι πεισματάρηδες. Η πρώιμη κοινωνικοποίηση βοηθά. Είναι γενικά καλά με παιδιά και ζώα. Είναι επαγρύπνοι φύλακες.",
    "health_en": "Polish Lowland Sheepdogs are generally a healthy breed. Hip dysplasia should be screened in breeding stock. Progressive retinal atrophy (PRA) is a concern in the breed — DNA testing is available. Hypothyroidism can develop and should be monitored. Some PONs may be prone to certain neurological conditions. Their long coat can hide skin issues, so regular skin checks during grooming are important. They are generally long-lived for a medium-sized breed. Regular veterinary checkups, eye exams, hip evaluations, and PRA DNA testing are recommended for breeding dogs.",
    "health_el": "Οι Πολωνικοί Πεδινοί Ποιμενικοί είναι γενικά υγιής ράτσα. Η δυσπλασία ισχίου πρέπει να ελέγχεται. Η PRA είναι ανησυχία — υπάρχει DNA τεστ. Ο υποθυρεοειδισμός μπορεί να αναπτυχθεί. Συνιστώνται τακτικοί κτηνιατρικοί έλεγχοι."
  },
  {
    "id": "portuguese-sheepdog",
    "slug": "portuguese-sheepdog",
    "name_en": "Portuguese Sheepdog",
    "name_el": "Πορτογαλικός Ποιμενικός",
    "type": "dog",
    "origin": "Portugal",
    "originCode": "PT",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Lively", "Intelligent", "Loyal", "Alert", "Docile"],
    "temperament_el": ["Ζωηρός", "Έξυπνος", "Πιστός", "Επαγρύπνος", "Πειθήνιος"],
    "description_en": "The Portuguese Sheepdog (Cão da Serra de Aires) is a medium-sized herding breed from the mountainous Alentejo region of southern Portugal, where they have herded sheep, goats, cattle, and horses for centuries. They are sometimes called the 'monkey dog' due to their expressive, primate-like facial features with long hair that falls over their eyes and a characteristic beard. The breed was developed from French Briard stock brought to Portugal in the early 20th century and crossed with local herding dogs. Portuguese Sheepdogs are lively, remarkably intelligent, and deeply loyal to their families. They are excellent working dogs with a natural herding instinct and the ability to manage different types of livestock. Despite their shaggy, rustic appearance, they are agile and athletic. They are alert and make good watchdogs but are typically docile and gentle with their families. The breed remains relatively rare outside Portugal but is gaining recognition for its versatility and charming personality.",
    "description_el": "Ο Πορτογαλικός Ποιμενικός (Cão da Serra de Aires) είναι ποιμενική ράτσα μέσου μεγέθους από την ορεινή περιοχή Αλεντέζο. Αποκαλείται μερικές φορές 'σκύλος μαϊμού' λόγω των εκφραστικών χαρακτηριστικών του προσώπου με μακριά τρίχα που πέφτει πάνω από τα μάτια. Είναι ζωηροί, αξιοσημείωτα έξυπνοι και βαθιά πιστοί. Είναι εξαιρετικοί εργατικοί σκύλοι με φυσικό ποιμενικό ένστικτο. Παραμένουν σχετικά σπάνιοι εκτός Πορτογαλίας.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 4, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Portuguese Sheepdogs need regular daily exercise — about an hour of walking, play, or herding activities. Their long coat requires regular brushing to prevent matting — at least 2-3 times per week. The coat can be maintained in a natural, slightly shaggy style or trimmed shorter for easier care. They are intelligent and eager to learn, responding well to positive training methods. Early socialization helps develop confidence in new situations. They can be vocal and may bark to communicate or alert. Portuguese Sheepdogs are devoted family dogs that do best when included in daily activities.",
    "care_el": "Οι Πορτογαλικοί Ποιμενικοί χρειάζονται τακτική καθημερινή άσκηση — περίπου μία ώρα. Το μακρύ τρίχωμα απαιτεί βούρτσισμα 2-3 φορές την εβδομάδα. Είναι έξυπνοι και πρόθυμοι να μάθουν. Η πρώιμη κοινωνικοποίηση βοηθά. Είναι αφοσιωμένα οικογενειακά σκυλιά.",
    "health_en": "Portuguese Sheepdogs are generally a healthy, robust breed with few known breed-specific health conditions. Hip dysplasia can occur and should be evaluated in breeding stock. Eye conditions are uncommon but periodic screening is recommended. As a relatively unmodified working breed, they maintain good overall health and vigor. Their long coat requires regular maintenance to prevent skin issues from developing underneath. Regular veterinary checkups, a balanced diet, and appropriate exercise are the primary requirements for maintaining good health. Portuguese Sheepdogs typically live 12-15 years with good care.",
    "health_el": "Οι Πορτογαλικοί Ποιμενικοί είναι γενικά υγιής, εύρωστη ράτσα. Η δυσπλασία ισχίου μπορεί να εμφανιστεί. Ως σχετικά ατροποποίητη εργατική ράτσα, διατηρούν καλή συνολική υγεία. Ζουν τυπικά 12-15 χρόνια."
  },
  {
    "id": "puli",
    "slug": "puli",
    "name_en": "Puli",
    "name_el": "Πούλι",
    "type": "dog",
    "origin": "Hungary",
    "originCode": "HU",
    "images": [],
    "size": "medium",
    "lifespan": "10-15 years",
    "temperament_en": ["Loyal", "Energetic", "Intelligent", "Alert", "Devoted"],
    "temperament_el": ["Πιστός", "Ενεργητικός", "Έξυπνος", "Επαγρύπνος", "Αφοσιωμένος"],
    "description_en": "The Puli (plural Pulik) is a medium-sized Hungarian herding breed with a unique corded coat that forms natural dreadlocks, giving them a distinctive 'mop-like' appearance. Unlike the larger white Komondor that served as a livestock guardian, the typically black Puli was the active herder that directed the flock during the day. The breed's corded coat provided protection from harsh weather and predator bites. Pulik have been working on the Hungarian plains for over a thousand years and are deeply ingrained in Hungarian culture. They are remarkably agile and light on their feet, capable of bouncing off the backs of sheep to change direction quickly. Pulik are loyal, energetic, and exceptionally intelligent dogs that form intense bonds with their owners. They are alert and naturally suspicious of strangers, making them excellent watchdogs. Facebook founder Mark Zuckerberg brought the breed into the spotlight when he adopted a Puli named Beast. Despite their comical appearance, Pulik are serious, capable working dogs with sharp minds and devoted hearts.",
    "description_el": "Το Πούλι (πληθ. Pulik) είναι ουγγρική ποιμενική ράτσα μέσου μεγέθους με μοναδικό τρίχωμα σε σχοινιά που σχηματίζει φυσικά dreadlocks. Σε αντίθεση με τον μεγαλύτερο λευκό Κομοντόρ που ήταν φύλακας, το τυπικά μαύρο Πούλι ήταν ο ενεργός βοσκός. Τα Pulik δουλεύουν στις ουγγρικές πεδιάδες για πάνω από χίλια χρόνια. Είναι αξιοσημείωτα ευκίνητα και ελαφριά, ικανά να αναπηδούν πάνω από τις πλάτες των προβάτων. Είναι πιστά, ενεργητικά και εξαιρετικά έξυπνα σκυλιά. Ο ιδρυτής του Facebook Mark Zuckerberg ανέδειξε τη ράτσα με τον σκύλο του Beast.",
    "characteristics": { "energy": 5, "grooming": 5, "friendliness": 3, "trainability": 4, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "Pulik need plenty of daily exercise and mental stimulation — at least an hour of vigorous activity including walks, play, agility, or herding. They are athletic and excel in dog sports. Their corded coat requires significant dedication — cords must be carefully separated by hand regularly to prevent matting into large, unmanageable clumps. This process can be time-consuming but becomes easier once the cords are fully formed. Bathing requires thorough soaking and can take 24+ hours to dry completely. Some owners choose to keep their Puli in a shorter 'brushed out' style for easier maintenance, though this eliminates the breed's signature look. Pulik are intelligent and quick learners but can be independent and sometimes stubborn. Positive, consistent training with variety works best. Early socialization is important as they can be suspicious of strangers. They are devoted to their families but may be aloof with people they don't know.",
    "care_el": "Τα Πούλι χρειάζονται πολλή καθημερινή άσκηση και νοητική διέγερση — τουλάχιστον μία ώρα. Το τρίχωμα σε σχοινιά απαιτεί σημαντική αφοσίωση — τα σχοινιά πρέπει να διαχωρίζονται με το χέρι τακτικά. Το μπάνιο χρειάζεται 24+ ώρες για στέγνωμα. Ορισμένοι ιδιοκτήτες επιλέγουν κοντότερο στυλ. Είναι έξυπνα αλλά μπορεί να είναι ανεξάρτητα. Η πρώιμη κοινωνικοποίηση είναι σημαντική.",
    "health_en": "Pulik are generally a healthy, long-lived breed. Hip dysplasia can occur and should be screened in breeding stock. Progressive retinal atrophy (PRA) and other eye conditions should be monitored through regular eye exams. Their corded coat requires careful maintenance to prevent skin issues — moisture, dirt, and bacteria can become trapped in poorly maintained cords, potentially leading to skin infections or hot spots. Patellar luxation may affect some individuals. Deafness has been reported in some lines. They are otherwise a robust breed that can live well into their teens with proper care. Regular veterinary checkups, eye screening, hip evaluations, and diligent coat maintenance are the keys to a healthy, happy Puli.",
    "health_el": "Τα Πούλι είναι γενικά υγιής, μακρόβια ράτσα. Η δυσπλασία ισχίου μπορεί να εμφανιστεί. Η PRA πρέπει να παρακολουθείται. Το τρίχωμα σε σχοινιά απαιτεί προσεκτική συντήρηση για πρόληψη δερματικών προβλημάτων. Η εξάρθρωση επιγονατίδας μπορεί να επηρεάσει ορισμένα άτομα. Κώφωση έχει αναφερθεί σε ορισμένες γραμμές. Συνιστώνται τακτικοί κτηνιατρικοί έλεγχοι."
  },
  {
    "id": "pumi",
    "slug": "pumi",
    "name_en": "Pumi",
    "name_el": "Πούμι",
    "type": "dog",
    "origin": "Hungary",
    "originCode": "HU",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Lively", "Intelligent", "Vocal", "Alert", "Reserved"],
    "temperament_el": ["Ζωηρός", "Έξυπνος", "Φωνακλάς", "Επαγρύπνος", "Επιφυλακτικός"],
    "description_en": "The Pumi (plural Pumik) is a Hungarian herding breed that evolved from crosses between the Puli and German and French herding breeds with erect or semi-erect ears, developing into a distinct breed by the early 20th century. They are medium-sized, square-built dogs with a distinctive curly, tousled coat and characteristically half-erect, expressive ears that give them an alert, slightly whimsical expression. Pumik are energetic, remarkably intelligent, and versatile working dogs that were used for herding cattle, sheep, and pigs on Hungarian farms. They are known for their 'terrier-like' intensity and bold, fearless approach to work — they are not shy about confronting stubborn livestock several times their size. Pumik are vocal dogs that use their bark as a herding tool, which can be challenging in non-farm settings. They are devoted to their families but tend to be reserved with strangers, needing time to warm up to new people. The breed gained AKC recognition in 2016 and is gaining popularity for their unique appearance, intelligence, and athletic abilities in dog sports.",
    "description_el": "Το Πούμι (πληθ. Pumik) είναι ουγγρική ποιμενική ράτσα που εξελίχθηκε από διασταυρώσεις μεταξύ Πούλι και γερμανικών-γαλλικών ποιμενικών ρατσών. Είναι μεσαίου μεγέθους σκυλιά με χαρακτηριστικό σγουρό τρίχωμα και μισο-όρθια, εκφραστικά αυτιά. Τα Pumik είναι ενεργητικά, εξαιρετικά έξυπνα εργατικά σκυλιά. Είναι γνωστά για την 'τεριέ-ίσια' τους ένταση. Είναι φωνακλά σκυλιά. Είναι αφοσιωμένα στις οικογένειές τους αλλά επιφυλακτικά με αγνώστους. Η ράτσα έλαβε αναγνώριση AKC το 2016.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 3, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Pumik need plenty of daily exercise and mental stimulation — at least an hour of vigorous activity. They excel in agility, herding, obedience, flyball, and virtually any dog sport. Their curly coat requires combing every few weeks and periodic trimming to maintain shape — it should look tousled and natural, not sculpted. The coat does not shed heavily but needs regular maintenance to prevent matting. Pumik are highly intelligent and thrive on learning new things, but they need variety in training to stay engaged. They are vocal dogs that bark frequently — this is a fundamental breed characteristic, not a behavior that can be entirely eliminated, though it can be managed through training. Early socialization is essential to help them be comfortable with strangers and new situations. They bond closely with their families and may choose one person as their primary companion.",
    "care_el": "Τα Πούμι χρειάζονται πολλή καθημερινή άσκηση και νοητική διέγερση — τουλάχιστον μία ώρα. Διαπρέπουν σε αθλήματα σκύλων. Το σγουρό τρίχωμα απαιτεί χτένισμα κάθε λίγες εβδομάδες και περιοδικό τρίμαρισμα. Είναι εξαιρετικά έξυπνα. Είναι φωνακλά σκυλιά — αυτό είναι θεμελιώδες χαρακτηριστικό ράτσας. Η πρώιμη κοινωνικοποίηση είναι απαραίτητη.",
    "health_en": "Pumik are generally a healthy and robust breed. Hip dysplasia can occur and should be screened in breeding stock. Patellar luxation is the most commonly reported orthopedic issue in the breed. Primary lens luxation (PLL) is a serious eye condition that can occur — DNA testing is available. Degenerative myelopathy (DM) has been identified in some lines. Eye conditions including progressive retinal atrophy should be monitored. Due to the breed's relatively small gene pool outside Hungary, genetic diversity management is important. They are generally long-lived dogs, typically reaching 12-14 years with proper care. Regular veterinary checkups, eye exams, hip evaluations, and DNA testing for PLL and DM are recommended for breeding dogs.",
    "health_el": "Τα Πούμι είναι γενικά υγιής ράτσα. Η δυσπλασία ισχίου μπορεί να εμφανιστεί. Η εξάρθρωση επιγονατίδας είναι το πιο κοινό ορθοπεδικό πρόβλημα. Η πρωτοπαθής εξάρθρωση φακού (PLL) μπορεί να εμφανιστεί — υπάρχει DNA τεστ. Η εκφυλιστική μυελοπάθεια (DM) έχει αναγνωριστεί. Ζουν τυπικά 12-14 χρόνια."
  },
  {
    "id": "pyrenean-shepherd",
    "slug": "pyrenean-shepherd",
    "name_en": "Pyrenean Shepherd",
    "name_el": "Πυρηναϊκός Ποιμενικός",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "medium",
    "lifespan": "15-17 years",
    "temperament_en": ["Energetic", "Intelligent", "Loyal", "Reserved", "Fearless"],
    "temperament_el": ["Ενεργητικός", "Έξυπνος", "Πιστός", "Επιφυλακτικός", "Ατρόμητος"],
    "description_en": "The Pyrenean Shepherd (Berger des Pyrénées) is a small to medium-sized French herding breed from the Pyrenees Mountains, where they worked alongside the much larger Great Pyrenees — the Pyr Shep doing the active herding while the Great Pyrenees guarded the flock from predators. They are one of the oldest and most naturally long-lived dog breeds, with some individuals living well past 17 years. Pyrenean Shepherds come in two varieties: rough-faced (with longer, windswept facial hair) and smooth-faced (with shorter facial hair and a slightly more refined expression). Both varieties are lean, athletic, and remarkably energetic for their size. They are considered one of the most intelligent herding breeds, capable of managing large flocks with minimal direction. Pyr Sheps are intensely loyal and devoted to their owners, forming deep, nearly exclusive bonds with their primary handler. They are naturally reserved and cautious with strangers, and their sensitivity to their environment makes them responsive but also potentially reactive without proper socialization.",
    "description_el": "Ο Πυρηναϊκός Ποιμενικός (Berger des Pyrénées) είναι μικρή ώς μεσαίου μεγέθους γαλλική ποιμενική ράτσα από τα Πυρηναία, όπου δούλευαν μαζί με τον πολύ μεγαλύτερο Ορεινό Πυρηναίο. Είναι μία από τις πιο μακρόβιες ράτσες, με ορισμένα άτομα να ζουν πάνω από 17 χρόνια. Υπάρχουν σε δύο ποικιλίες: τραχύ πρόσωπο και λείο πρόσωπο. Θεωρούνται μία από τις πιο έξυπνες ποιμενικές ράτσες. Είναι εντόνως πιστοί, δημιουργώντας βαθιούς δεσμούς με τον κύριο χειριστή τους. Είναι φυσικά επιφυλακτικοί με αγνώστους.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 3, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Pyrenean Shepherds need substantial daily exercise and mental stimulation — despite their smaller size, they have enormous energy reserves and require at least 1-2 hours of vigorous activity. They excel in agility (often dominating their height classes), herding, flyball, and obedience. Grooming depends on the variety: rough-faced needs more regular brushing, while smooth-faced has lower grooming needs. They are highly intelligent and learn rapidly but can be sensitive and reactive if not properly trained and socialized. Early, extensive socialization is critical for Pyr Sheps — they can become fearful, anxious, or reactive without adequate exposure to new people, environments, and situations. They are not recommended for first-time dog owners due to their intensity and sensitivity. They form extremely close bonds with their handlers and may struggle with changes in routine or environment.",
    "care_el": "Οι Πυρηναϊκοί Ποιμενικοί χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1-2 ώρες παρά το μικρότερο μέγεθός τους. Διαπρέπουν στην ευκινησία. Η περιποίηση εξαρτάται από την ποικιλία. Είναι εξαιρετικά έξυπνα αλλά μπορεί να είναι ευαίσθητα. Η πρώιμη κοινωνικοποίηση είναι κρίσιμη. Δεν συνιστώνται για πρωτάρηδες. Δημιουργούν εξαιρετικά στενούς δεσμούς με τους χειριστές τους.",
    "health_en": "Pyrenean Shepherds are one of the healthiest and longest-lived dog breeds, regularly living 15-17 years with some individuals exceeding 19 years. Hip dysplasia can occur but at relatively low rates compared to many breeds. Patellar luxation may affect some dogs. Progressive retinal atrophy (PRA) and other eye conditions should be screened periodically. Epilepsy occurs in some lines. Patent ductus arteriosus (PDA), a congenital heart defect, has been reported. Their naturally lean body type, active lifestyle, and absence of extreme physical features contribute to their remarkable longevity. Regular veterinary checkups, maintaining a healthy weight, appropriate exercise, and choosing a breeder who health-tests parent dogs are recommended. Their sensitivity means they may be more prone to stress-related conditions, so a calm, consistent home environment supports their overall well-being.",
    "health_el": "Οι Πυρηναϊκοί Ποιμενικοί είναι μία από τις πιο υγιείς και μακρόβιες ράτσες, ζώντας τακτικά 15-17 χρόνια. Η δυσπλασία ισχίου μπορεί να εμφανιστεί αλλά σε χαμηλά ποσοστά. Η PRA πρέπει να ελέγχεται. Η επιληψία εμφανίζεται σε ορισμένες γραμμές. Ο φυσικά αδύνατος σωματότυπος, ο ενεργός τρόπος ζωής και η απουσία ακραίων σωματικών χαρακτηριστικών συμβάλλουν στην αξιοσημείωτη μακροζωία τους."
  },
  {
    "id": "shetland-sheepdog",
    "slug": "shetland-sheepdog",
    "name_en": "Shetland Sheepdog",
    "name_el": "Σετλαντ Ποιμενικός",
    "type": "dog",
    "origin": "Scotland",
    "originCode": "GB",
    "images": [],
    "size": "small",
    "lifespan": "12-14 years",
    "temperament_en": ["Intelligent", "Loyal", "Playful", "Obedient", "Affectionate"],
    "temperament_el": ["Έξυπνος", "Πιστός", "Παιχνιδιάρης", "Πειθήνιος", "Στοργικός"],
    "description_en": "The Shetland Sheepdog, affectionately known as the 'Sheltie,' is a small herding breed that originated on the Shetland Islands off the northern coast of Scotland. They were developed to herd sheep and ponies on the islands' rocky, treacherous terrain, where their small size was an advantage — smaller dogs required less food in an environment with limited resources. While they resemble a miniature Rough Collie, Shelties are a distinct breed with their own unique characteristics. They are consistently ranked among the most intelligent dog breeds, typically placing 6th out of all breeds for working intelligence. Shelties are exceptionally loyal and sensitive dogs that form deep bonds with their families, often described as 'shadow dogs' for their tendency to follow their owners from room to room. They excel in virtually every competitive dog sport, particularly agility and obedience, where their intelligence, speed, and eagerness to please give them a significant advantage. Despite their beauty and grace, Shelties are sturdy, hardworking little dogs with surprising athletic ability.",
    "description_el": "Ο Σετλαντ Ποιμενικός, γνωστός στοργικά ως 'Sheltie,' είναι μικρή ποιμενική ράτσα από τα Νησιά Σέτλαντ ανοιχτά των βόρειων ακτών της Σκωτίας. Αν και μοιάζουν με μικροσκοπικό Rough Collie, οι Sheltie είναι ξεχωριστή ράτσα. Κατατάσσονται συνεχώς ανάμεσα στις πιο έξυπνες ράτσες, τυπικά στην 6η θέση. Είναι εξαιρετικά πιστοί και ευαίσθητοι σκύλοι που ακολουθούν τους ιδιοκτήτες τους παντού. Διαπρέπουν σε σχεδόν κάθε ανταγωνιστικό αγώνισμα, ιδιαίτερα ευκινησία και υπακοή.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 4, "trainability": 5, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Shetland Sheepdogs need daily exercise and mental stimulation — about 45 minutes to an hour of walking, play, and training. They are exceptionally intelligent and thrive on learning new skills, tricks, and sports. Their beautiful double coat requires brushing 2-3 times per week, with daily grooming during shedding seasons. They are sensitive souls that respond best to gentle, positive reinforcement training — harsh methods can damage their confidence and trust. Shelties can be vocal and may bark at perceived disturbances — this is a natural herding trait that requires management training. Early socialization is important as some Shelties can be shy or noise-sensitive if not adequately exposed to various situations during puppyhood. They are wonderful family dogs but may be reserved with strangers. Shelties should not be left alone for long periods as they thrive on companionship.",
    "care_el": "Οι Σετλαντ Ποιμενικοί χρειάζονται καθημερινή άσκηση και νοητική διέγερση — περίπου 45 λεπτά ως μία ώρα. Είναι εξαιρετικά έξυπνοι. Το διπλό τρίχωμα απαιτεί βούρτσισμα 2-3 φορές την εβδομάδα. Είναι ευαίσθητες ψυχές που ανταποκρίνονται καλύτερα σε ήπια εκπαίδευση. Μπορεί να είναι φωνακλά. Η πρώιμη κοινωνικοποίηση είναι σημαντική.",
    "health_en": "Shetland Sheepdogs share several health considerations with Collies due to their related heritage. Collie Eye Anomaly (CEA) is a congenital condition that should be screened through DNA testing and eye exams. The MDR1 gene mutation affects a significant percentage of Shelties, causing dangerous sensitivity to certain medications — all Shelties should be MDR1 tested. Hip dysplasia can occur. Progressive retinal atrophy (PRA) should be monitored. Dermatomyositis, an inflammatory skin and muscle condition, is seen in the breed. Thyroid dysfunction is relatively common. Von Willebrand's disease has been reported. Patent ductus arteriosus (PDA) and other cardiac conditions should be screened. Some Shelties are prone to epilepsy. Regular eye exams, MDR1 testing, hip evaluations, thyroid screening, and comprehensive health testing of breeding dogs are essential for healthy Shetland Sheepdogs.",
    "health_el": "Οι Σετλαντ Ποιμενικοί μοιράζονται ανησυχίες υγείας με τα Collie. Η CEA πρέπει να ελέγχεται. Η γονιδιακή μετάλλαξη MDR1 επηρεάζει σημαντικό ποσοστό — όλοι πρέπει να ελέγχονται. Η δυσπλασία ισχίου μπορεί να εμφανιστεί. Η δερματομυοσίτιδα εμφανίζεται. Η θυρεοειδική δυσλειτουργία είναι σχετικά κοινή. Η νόσος Von Willebrand έχει αναφερθεί. Συνιστώνται ολοκληρωμένοι έλεγχοι υγείας."
  },
  {
    "id": "south-russian-ovcharka",
    "slug": "south-russian-ovcharka",
    "name_en": "South Russian Ovcharka",
    "name_el": "Νοτιορωσικός Οβτσάρκα",
    "type": "dog",
    "origin": "Ukraine",
    "originCode": "UA",
    "images": [],
    "size": "giant",
    "lifespan": "9-11 years",
    "temperament_en": ["Protective", "Fearless", "Independent", "Loyal", "Calm"],
    "temperament_el": ["Προστατευτικός", "Ατρόμητος", "Ανεξάρτητος", "Πιστός", "Ήρεμος"],
    "description_en": "The South Russian Ovcharka (Yuzhnorusskaya Ovcharka) is a large, powerful livestock guardian breed from the steppes of Ukraine and southern Russia. They have a thick, long white or light-colored coat that provided protection against harsh winters and predator attacks. The breed was developed to guard large flocks of sheep against wolves, bears, and human thieves on the vast, open grasslands. South Russian Ovcharkas are among the most protective and territorial of all guardian breeds — they are fearless, independent, and will defend their territory and family without hesitation. They are calm and gentle with those they know and trust but can be suspicious and potentially aggressive toward unfamiliar people and animals if not properly socialized. The breed suffered tremendous losses during both World Wars and the Soviet era, and remains relatively rare outside its homeland. They require an exceptionally experienced owner who understands large guardian breeds and can provide the extensive socialization, training, and management these powerful dogs demand.",
    "description_el": "Ο Νοτιορωσικός Οβτσάρκα είναι μεγάλη, δυνατή ράτσα φύλακα ζώων από τις στέπες της Ουκρανίας και της νότιας Ρωσίας. Έχουν πυκνό, μακρύ λευκό τρίχωμα. Αναπτύχθηκαν για φύλαξη μεγάλων κοπαδιών προβάτων ενάντια σε λύκους, αρκούδες και κλέφτες. Είναι ανάμεσα στις πιο προστατευτικές και εδαφικές ράτσες φυλάκων. Είναι ήρεμοι με αυτούς που εμπιστεύονται αλλά μπορεί να είναι επικίνδυνοι με αγνώστους χωρίς σωστή κοινωνικοποίηση. Η ράτσα υπέστη τεράστιες απώλειες κατά τους δύο Παγκοσμίους Πολέμους. Απαιτούν εξαιρετικά έμπειρο ιδιοκτήτη.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 2, "trainability": 2, "cost_index": 5 },
    "cost_annual_usd": "$2,800-4,500+",
    "care_en": "South Russian Ovcharkas need moderate daily exercise and ample space — they are absolutely not suited to apartments or small yards. Their thick, long coat requires regular brushing to prevent severe matting. They need extensive, early, and ongoing socialization — this is the single most important aspect of owning this breed. Without proper socialization, they can become dangerously aggressive toward strangers and unfamiliar animals. Training requires patience, consistency, and a deep understanding of guardian breed behavior — they will not blindly obey commands and need an owner who can earn their respect through calm, confident leadership. They are most suitable for experienced owners with secure, large properties. They can be vocal, particularly at night. All visitors and service workers must be properly introduced, as these dogs take their protective duties extremely seriously.",
    "care_el": "Οι Νοτιορωσικοί Οβτσάρκα χρειάζονται χώρο και μέτρια άσκηση. Το πυκνό τρίχωμα απαιτεί τακτικό βούρτσισμα. Χρειάζονται εκτενή, πρώιμη κοινωνικοποίηση — αυτό είναι το πιο σημαντικό. Χωρίς σωστή κοινωνικοποίηση μπορεί να γίνουν επικίνδυνα επιθετικοί. Η εκπαίδευση απαιτεί υπομονή και κατανόηση. Είναι κατάλληλοι μόνο για πολύ έμπειρους ιδιοκτήτες με μεγάλες ιδιοκτησίες.",
    "health_en": "South Russian Ovcharkas can be prone to hip and elbow dysplasia, common in large and giant breeds. Bloat (GDV) is a serious risk. Their thick coat can harbor parasites and hide skin conditions. Cardiac conditions should be monitored. Osteosarcoma and other cancers can occur. Due to the breed's limited gene pool, genetic diversity management is important. They are moderately long-lived for a giant breed, typically reaching 9-11 years. Regular veterinary checkups, maintaining a healthy weight, appropriate nutrition for large breeds, and ensuring their coat and skin remain healthy through regular grooming are important aspects of their care.",
    "health_el": "Οι Νοτιορωσικοί Οβτσάρκα μπορεί να είναι επιρρεπείς σε δυσπλασία ισχίου και αγκώνα. Το φούσκωμα (GDV) είναι σοβαρός κίνδυνος. Το πυκνό τρίχωμα μπορεί να κρύψει δερματικά προβλήματα. Καρδιακές παθήσεις πρέπει να παρακολουθούνται. Ζουν τυπικά 9-11 χρόνια."
  },
  {
    "id": "spanish-water-dog",
    "slug": "spanish-water-dog",
    "name_en": "Spanish Water Dog",
    "name_el": "Ισπανικός Υδάτινος Σκύλος",
    "type": "dog",
    "origin": "Spain",
    "originCode": "ES",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Loyal", "Energetic", "Intelligent", "Hardworking", "Affectionate"],
    "temperament_el": ["Πιστός", "Ενεργητικός", "Έξυπνος", "Εργατικός", "Στοργικός"],
    "description_en": "The Spanish Water Dog (Perro de Agua Español) is a versatile, medium-sized breed from Spain with a distinctive curly, woolly coat that can form cords when left to grow. They are an ancient breed with a debated origin — some believe they were brought to Spain by Turkish traders, while others link them to North African water dogs. Historically, they served triple duty in Spain as herding dogs in the mountains (particularly in Andalusia), water retrievers for fishermen along the coast, and general-purpose farm dogs. Spanish Water Dogs are loyal, energetic, and highly intelligent, forming strong bonds with their families. They are natural athletes who love water and excel at any task that combines physical activity with mental challenge. They are hardworking and serious when given a job but affectionate and playful with their families. Some Spanish Water Dogs can be wary of strangers and may require careful socialization. Their unique coat and versatile abilities have made them increasingly popular worldwide.",
    "description_el": "Ο Ισπανικός Υδάτινος Σκύλος (Perro de Agua Español) είναι ευέλικτη, μέσου μεγέθους ράτσα με χαρακτηριστικό σγουρό, μάλλινο τρίχωμα που μπορεί να σχηματίσει σχοινιά. Ιστορικά, εξυπηρετούσαν τριπλή λειτουργία: ποιμενικοί στα βουνά, ανακτητές νερού για ψαράδες, και γενικής χρήσης αγροτικοί σκύλοι. Είναι πιστοί, ενεργητικοί και εξαιρετικά έξυπνοι. Είναι φυσικοί αθλητές που λατρεύουν το νερό. Ορισμένοι μπορεί να είναι επιφυλακτικοί με αγνώστους.",
    "characteristics": { "energy": 5, "grooming": 4, "friendliness": 4, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Spanish Water Dogs need substantial daily exercise — at least 1-2 hours of vigorous activity including swimming, hiking, running, or structured training. They love water and should have regular opportunities to swim. Their curly coat is unique in its care requirements — it should never be brushed, only clipped to a uniform length (typically once or twice a year). When left to grow, the coat naturally forms cords. The coat is essentially hypoallergenic and doesn't shed in the traditional sense. They are highly intelligent and eager to learn, excelling in agility, obedience, dock diving, and herding. Positive, consistent training methods work best. Early socialization is important, particularly for dogs that show wariness toward strangers. They form strong bonds with their families and do not tolerate being left alone for extended periods. They need both physical exercise and mental challenges to remain happy and well-behaved.",
    "care_el": "Οι Ισπανοί Υδάτινοι Σκύλοι χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1-2 ώρες. Λατρεύουν το νερό. Το σγουρό τρίχωμα δεν πρέπει ποτέ να βουρτσίζεται, μόνο να κουρεύεται σε ομοιόμορφο μήκος. Είναι εξαιρετικά έξυπνοι, διαπρέποντας σε ευκινησία, υπακοή και dock diving. Η πρώιμη κοινωνικοποίηση είναι σημαντική. Δημιουργούν ισχυρούς δεσμούς.",
    "health_en": "Spanish Water Dogs are generally a healthy breed. Hip dysplasia should be screened in breeding stock. Progressive retinal atrophy (PRA), specifically the prcd-PRA variant, can cause gradual vision loss — DNA testing is available and recommended. Hypothyroidism may develop and should be monitored. Allergies and skin conditions can occur, particularly if the coat is not properly maintained. Congenital hypothyroidism with goiter (CHG) has been identified in the breed — DNA testing is available. Some Spanish Water Dogs may develop ear infections due to hair growth in the ear canal. Neuroaxonal dystrophy (NAD) is a rare neurological condition reported in the breed — DNA testing is available for some forms. Regular veterinary care, appropriate coat maintenance, and choosing a breeder who DNA-tests for PRA and CHG are important for a healthy Spanish Water Dog.",
    "health_el": "Οι Ισπανοί Υδάτινοι Σκύλοι είναι γενικά υγιής ράτσα. Η δυσπλασία ισχίου πρέπει να ελέγχεται. Η PRA μπορεί να εμφανιστεί — υπάρχει DNA τεστ. Ο υποθυρεοειδισμός μπορεί να αναπτυχθεί. Ο συγγενής υποθυρεοειδισμός με βρογχοκήλη (CHG) έχει αναγνωριστεί — υπάρχει DNA τεστ. Ορισμένοι μπορεί να αναπτύξουν λοιμώξεις αυτιών. Συνιστώνται τακτικοί κτηνιατρικοί έλεγχοι."
  },
  {
    "id": "swedish-vallhund",
    "slug": "swedish-vallhund",
    "name_en": "Swedish Vallhund",
    "name_el": "Σουηδικός Βάλλχουντ",
    "type": "dog",
    "origin": "Sweden",
    "originCode": "SE",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Fearless", "Energetic", "Friendly", "Intelligent", "Alert"],
    "temperament_el": ["Ατρόμητος", "Ενεργητικός", "Φιλικός", "Έξυπνος", "Επαγρύπνος"],
    "description_en": "The Swedish Vallhund (Västgötaspets) is an ancient Nordic herding breed that dates back over 1,000 years to the Viking era. There is scholarly debate about whether the Vallhund preceded the Welsh Corgi or vice versa, as Vikings and Celts had significant contact — both breeds share the short-legged, long-bodied herding dog design. Vallhunds are small, powerful, and athletic dogs with a distinctive wolf-like sable coat (called 'harness markings'), erect ears, and tails that can be naturally long, stubby, or bobbed. They were bred to herd cattle by nipping at their heels, much like the Corgis, and their low stature allowed them to avoid kicks. Swedish Vallhunds are fearless, energetic, and friendly dogs with a big personality that far exceeds their compact size. They are remarkably intelligent and versatile, excelling in herding, agility, obedience, tracking, and flyball. Despite their working heritage, they are friendly and sociable dogs that enjoy meeting new people and animals, making them excellent family companions for active households.",
    "description_el": "Ο Σουηδικός Βάλλχουντ (Västgötaspets) είναι αρχαία σκανδιναβική ποιμενική ράτσα που χρονολογείται πάνω από 1.000 χρόνια στην εποχή των Βίκινγκ. Υπάρχει ακαδημαϊκή συζήτηση αν ο Βάλλχουντ προηγήθηκε του Ουαλικού Κόργκι ή αντίστροφα. Είναι μικρά, δυνατά και αθλητικά σκυλιά με χαρακτηριστικό λυκίσιο τρίχωμα. Εκτράφηκαν για ποίμανση βοοειδών. Είναι ατρόμητα, ενεργητικά και φιλικά σκυλιά με μεγάλη προσωπικότητα. Είναι αξιοσημείωτα έξυπνα και ευέλικτα. Παρά την εργατική κληρονομιά τους, είναι φιλικά και κοινωνικά σκυλιά.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 5, "trainability": 5, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Swedish Vallhunds need regular daily exercise — about 45 minutes to an hour of walking, play, and activities. They are surprisingly athletic and excel in many dog sports. Their medium-length, weather-resistant double coat is low-maintenance, requiring only weekly brushing with more frequent grooming during seasonal shedding. They are intelligent, eager to learn, and respond well to positive reinforcement training. They can be vocal — Vallhunds are known for their distinctive range of vocalizations including barks, howls, and 'argling' (a unique conversational sound). Early socialization is beneficial though Vallhunds are naturally friendly. They adapt well to various living situations including apartments, provided they receive adequate exercise. Weight management is important to protect their long backs. They are wonderful family dogs that are good with children and other pets.",
    "care_el": "Οι Σουηδικοί Βάλλχουντ χρειάζονται τακτική καθημερινή άσκηση — περίπου 45 λεπτά ως μία ώρα. Το τρίχωμα μέσου μήκους απαιτεί μόνο εβδομαδιαίο βούρτσισμα. Είναι έξυπνοι και ανταποκρίνονται καλά σε θετική εκπαίδευση. Μπορεί να είναι φωνακλά — γνωστά για μια χαρακτηριστική σειρά φωνών. Η πρώιμη κοινωνικοποίηση είναι ωφέλιμη. Προσαρμόζονται καλά σε διάφορες συνθήκες ζωής. Η διαχείριση βάρους είναι σημαντική για τη μακριά πλάτη τους.",
    "health_en": "Swedish Vallhunds are generally a healthy, long-lived breed. Hip dysplasia can occur and should be evaluated in breeding stock. Swedish Vallhund Retinopathy (SVR), a breed-specific progressive eye condition, can lead to vision impairment — affected dogs should not be bred. Patellar luxation may affect some individuals. Some Vallhunds may develop spinal issues due to their elongated body type — weight management and avoiding excessive jumping help protect their spine. They can be prone to cleft palate in some lines. Regular eye exams are particularly important for this breed due to SVR. Overall, Swedish Vallhunds are a robust breed that typically lives 12-15 years with good care. Choosing a breeder who screens for SVR, hip dysplasia, and patellar luxation is essential.",
    "health_el": "Οι Σουηδικοί Βάλλχουντ είναι γενικά υγιής, μακρόβια ράτσα. Η δυσπλασία ισχίου μπορεί να εμφανιστεί. Η Αμφιβληστροειδοπάθεια Swedish Vallhund (SVR) είναι ειδική οφθαλμολογική πάθηση. Η εξάρθρωση επιγονατίδας μπορεί να επηρεάσει ορισμένα άτομα. Η διαχείριση βάρους και η αποφυγή πηδημάτων βοηθούν στην προστασία της σπονδυλικής στήλης. Οι τακτικές οφθαλμολογικές εξετάσεις είναι ιδιαίτερα σημαντικές λόγω SVR. Ζουν τυπικά 12-15 χρόνια."
  },
  {
    "id": "white-swiss-shepherd-dog",
    "slug": "white-swiss-shepherd-dog",
    "name_en": "White Swiss Shepherd Dog",
    "name_el": "Λευκός Ελβετικός Ποιμενικός",
    "type": "dog",
    "origin": "Switzerland",
    "originCode": "CH",
    "images": [],
    "size": "large",
    "lifespan": "12-14 years",
    "temperament_en": ["Loyal", "Intelligent", "Friendly", "Calm", "Attentive"],
    "temperament_el": ["Πιστός", "Έξυπνος", "Φιλικός", "Ήρεμος", "Προσεκτικός"],
    "description_en": "The White Swiss Shepherd Dog (Berger Blanc Suisse) is a breed developed in Switzerland from white-coated German Shepherd lines that were systematically excluded from German Shepherd breeding programs in Germany after the 1930s due to the incorrect belief that the white coat color was linked to genetic defects. White German Shepherds were exported to North America and later to Switzerland, where breeders developed them into a distinct, FCI-recognized breed in 2011. White Swiss Shepherds share the German Shepherd's intelligence and versatility but have been selectively bred for a calmer, more family-oriented temperament compared to working-line German Shepherds. They are large, elegant dogs with a stunning white double coat, strong athletic build, and a gentle, attentive expression. They are loyal, intelligent, and remarkably friendly — more approachable than many German Shepherds while retaining the breed's signature intelligence and trainability. White Swiss Shepherds excel as family companions, therapy dogs, and in various dog sports, and they are known for being particularly gentle and patient with children.",
    "description_el": "Ο Λευκός Ελβετικός Ποιμενικός (Berger Blanc Suisse) είναι ράτσα που αναπτύχθηκε στην Ελβετία από λευκές γραμμές Γερμανικού Ποιμενικού που αποκλείστηκαν συστηματικά από τα προγράμματα εκτροφής στη Γερμανία μετά τη δεκαετία του 1930 λόγω εσφαλμένης πεποίθησης ότι το λευκό χρώμα συνδεόταν με γενετικά ελαττώματα. Αναγνωρίστηκαν ως ξεχωριστή ράτσα από την FCI το 2011. Μοιράζονται τη νοημοσύνη και ευελιξία του Γερμανικού Ποιμενικού αλλά έχουν πιο ήρεμη, οικογενειακή ιδιοσυγκρασία. Είναι μεγάλα, κομψά σκυλιά με εκπληκτικό λευκό διπλό τρίχωμα. Είναι πιστοί, έξυπνοι και αξιοσημείωτα φιλικοί. Διαπρέπουν ως οικογενειακοί σύντροφοι, σκύλοι θεραπείας και σε αθλήματα σκύλων, και είναι γνωστοί για την ιδιαίτερη ηπιότητα και υπομονή τους με τα παιδιά.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 4 },
    "cost_annual_usd": "$1,800-2,800",
    "care_en": "White Swiss Shepherds need regular daily exercise — about 1-2 hours of walking, hiking, running, or structured training. They enjoy dog sports including agility, obedience, tracking, and nosework, though they are generally less intense than working-line German Shepherds. Their beautiful white double coat requires brushing 2-3 times per week, with more frequent grooming during heavy shedding periods. They shed significantly, and their white hair is noticeable on dark clothing and furniture. They are highly intelligent and eager to please, responding exceptionally well to positive reinforcement training. They are sensitive dogs that do not respond well to harsh corrections. Early socialization is beneficial, though White Swiss Shepherds are naturally more friendly and approachable than some other shepherd breeds. They are devoted family dogs that should live indoors with their people. They can be sensitive to family tension and thrive in calm, harmonious households.",
    "care_el": "Οι Λευκοί Ελβετικοί Ποιμενικοί χρειάζονται τακτική καθημερινή άσκηση — περίπου 1-2 ώρες. Απολαμβάνουν αθλήματα σκύλων. Το λευκό διπλό τρίχωμα απαιτεί βούρτσισμα 2-3 φορές την εβδομάδα. Τρίχουν σημαντικά. Είναι εξαιρετικά έξυπνοι και πρόθυμοι να ευχαριστήσουν. Είναι ευαίσθητα σκυλιά. Η πρώιμη κοινωνικοποίηση είναι ωφέλιμη. Είναι αφοσιωμένα οικογενειακά σκυλιά που πρέπει να ζουν εσωτερικά.",
    "health_en": "White Swiss Shepherds share similar health considerations with German Shepherds. Hip and elbow dysplasia are the primary orthopedic concerns and should be evaluated through OFA or equivalent testing in breeding stock. Degenerative myelopathy (DM), a progressive spinal cord disease, can occur — DNA testing is available. Bloat (GDV) is a risk in this deep-chested breed. Some White Swiss Shepherds may develop allergies or skin sensitivities. Eye conditions including progressive retinal atrophy should be monitored. MDR1 sensitivity has been reported in some lines. They may have lower incidence of some conditions compared to German Shepherds due to different breeding selection, but overall health screening should be comprehensive. Regular cardiac, hip, elbow, and eye evaluations, along with DM DNA testing, are recommended for breeding dogs. With proper care, White Swiss Shepherds typically live 12-14 years.",
    "health_el": "Οι Λευκοί Ελβετικοί Ποιμενικοί μοιράζονται παρόμοιες ανησυχίες υγείας με τους Γερμανικούς Ποιμενικούς. Η δυσπλασία ισχίου και αγκώνα είναι οι κύριες ορθοπεδικές ανησυχίες. Η εκφυλιστική μυελοπάθεια (DM) μπορεί να εμφανιστεί — υπάρχει DNA τεστ. Το φούσκωμα (GDV) είναι κίνδυνος. Ορισμένοι μπορεί να αναπτύξουν αλλεργίες. Η ευαισθησία MDR1 έχει αναφερθεί. Συνιστώνται τακτικοί ολοκληρωμένοι έλεγχοι υγείας. Ζουν τυπικά 12-14 χρόνια."
  }
]
