[
  {
    "id": "bracco-italiano",
    "slug": "bracco-italiano",
    "name_en": "Bracco Italiano",
    "name_el": "Μπράκο Ιταλιάνο",
    "type": "dog",
    "origin": "Italy",
    "originCode": "IT",
    "images": [],
    "size": "large",
    "lifespan": "11-13 years",
    "temperament_en": ["Devoted", "Intelligent", "Energetic", "Docile", "Sociable"],
    "temperament_el": ["Αφοσιωμένος", "Έξυπνος", "Ενεργητικός", "Πειθήνιος", "Κοινωνικός"],
    "description_en": "The Bracco Italiano is an ancient Italian pointing breed with a distinctive appearance and noble bearing. Bred for hunting in the Italian countryside, they are versatile gun dogs that work closely with their handlers. They are devoted to their families and thrive on companionship and activity. Their expressive face and gentle nature make them appealing both in the field and at home.",
    "description_el": "Το Bracco Italiano είναι αρχαία ιταλική ράτσα δείκτη με χαρακτηριστική εμφάνιση και αριστοκρατική στάση. Εκτράφηκε για κυνήγι στην ιταλική ύπαιθρο και είναι ευέλικτοι σκύλοι όπλων που εργάζονται στενά με τους χειριστές τους. Είναι αφοσιωμένοι στις οικογένειές τους και ευδοκιμούν με συντροφιά και δραστηριότητα. Το εκφραστικό πρόσωπο και η ήπια φύση τους τα καθιστούν ελκυστικά τόσο στο πεδίο όσο και στο σπίτι.",
    "characteristics": { "energy": 4, "grooming": 2, "friendliness": 4, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Bracco Italiano need substantial daily exercise and mental stimulation. They are hunting dogs at heart and enjoy long walks, runs, or field work. Their short coat requires minimal grooming—weekly brushing is sufficient. They bond strongly with their families and do not like to be left alone for long periods. Early socialization and consistent training help them become well-rounded companions.",
    "care_el": "Το Bracco Italiano χρειάζεται σημαντική καθημερινή άσκηση και νοητική διέγερση. Είναι σκύλοι κυνηγιού στην καρδιά και απολαμβάνουν μακριές βόλτες, τρέξιμο ή εργασία στο πεδίο. Το κοντό τρίχωμά τους απαιτεί ελάχιστη περιποίηση—το εβδομαδιαίο βούρτσισμα αρκεί. Δένονται στενά με τις οικογένειές τους και δεν τους αρέσει να μένουν μόνοι για μεγάλες περιόδους.",
    "health_en": "Bracco Italiano have a typical lifespan of 11–13 years. Hip dysplasia and elbow dysplasia are significant orthopedic concerns — OFA screening is essential for breeding stock. Ear infections are very common due to their long, pendulous ears — weekly cleaning is recommended. Bloat (gastric dilatation-volvulus) is a serious risk in this large, deep-chested breed. Eye conditions including entropion and ectropion can occur. Hypothyroidism has been documented. Kidney conditions including renal amyloidosis have been reported in some lines. Umbilical hernias occur occasionally. The breed has benefited from increased health awareness in the Italian and international breeding community. Responsible breeders screen for hips, elbows, eyes, and kidney function.",
    "health_el": "Τα Bracco Italiano έχουν τυπική διάρκεια ζωής 11–13 χρόνια. Δυσπλασία ισχίου και αγκώνα σημαντικές ορθοπεδικές ανησυχίες — ο έλεγχος OFA είναι απαραίτητος. Λοιμώξεις αυτιών πολύ κοινές λόγω μακριών, κρεμαστών αυτιών — εβδομαδιαίος καθαρισμός συνιστάται. Φούσκωμα (GDV) σοβαρός κίνδυνος σε αυτήν τη μεγαλόσωμη ράτσα. Οφθαλμικές παθήσεις όπως εντρόπιο και εκτρόπιο πιθανές. Υποθυρεοειδισμός τεκμηριώθηκε. Νεφρικές παθήσεις (νεφρική αμυλοείδωση) αναφέρθηκαν σε ορισμένες γραμμές. Ομφαλοκήλη περιστασιακά. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια και νεφρική λειτουργία."
  },
  {
    "id": "brittany",
    "slug": "brittany",
    "name_en": "Brittany",
    "name_el": "Μπριτάνι",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Energetic", "Intelligent", "Friendly", "Alert", "Adaptable"],
    "temperament_el": ["Ενεργητικός", "Έξυπνος", "Φιλικός", "Επαγρύπνος", "Προσαρμοστικός"],
    "description_en": "The Brittany is a compact, energetic pointing breed from France, originally developed for bird hunting. They are among the most popular gun dogs due to their versatility, trainability, and affectionate nature. Brittanys are medium-sized with a dense, flat or wavy coat and natural enthusiasm for work and play. They form strong bonds with their families and get along well with children and other dogs when properly socialized.",
    "description_el": "Το Brittany είναι μια συμπαγής, ενεργητική ράτσα δείκτη από τη Γαλλία, αρχικά αναπτυγμένη για κυνήγι πτηνών. Είναι από τις πιο δημοφιλείς ράτσες σκύλων όπλων λόγω της ευελιξίας, της εκπαιδευσιμότητας και της στοργικής φύσης τους. Τα Brittany είναι μεσαίου μεγέθους με πυκνό, επίπεδο ή κυματιστό τρίχωμα και φυσικό ενθουσιασμό για δουλειά και παιχνίδι.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 5, "trainability": 5, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Brittanys need plenty of daily exercise—running, hiking, or field work are ideal. They are intelligent and require mental stimulation to prevent boredom. Their coat is relatively easy to maintain with regular brushing. They thrive in active homes and can become restless or destructive if under-exercised. Positive training methods work best with this eager-to-please breed.",
    "care_el": "Τα Brittany χρειάζονται πολλή καθημερινή άσκηση — τρέξιμο, πεζοπορία ή εργασία στο πεδίο είναι ιδανικά. Είναι πολύ έξυπνα και χρειάζονται νοητική διέγερση για να αποφευχθεί η πλήξη. Η συντήρηση τριχώματος είναι σχετικά εύκολη με τακτικό βούρτσισμα. Ευδοκιμούν σε ενεργά σπίτια και μπορεί να γίνουν ανήσυχα ή καταστροφικά αν δεν ασκηθούν αρκετά. Οι θετικές μέθοδοι εκπαίδευσης λειτουργούν καλύτερα σε αυτήν την πρόθυμη ράτσα. Είναι ευαίσθητα και χρειάζονται ήπια αλλά σταθερή προσέγγιση.",
    "health_en": "Brittanys are generally a healthy, hardy breed with a typical lifespan of 12–15 years. Hip dysplasia is the primary orthopedic concern — OFA screening is recommended. Epilepsy has been documented in some lines and is an area of concern. Hypothyroidism can develop and is manageable with medication. Eye conditions including progressive retinal atrophy (PRA) and lens luxation should be screened for. Ear infections may develop with their pendant ears. Canine discoid lupus erythematosus has been reported at slightly elevated rates. Allergies and skin conditions can occur. The breed maintains good genetic diversity due to its large, active working population worldwide. Responsible breeders screen for hips, eyes, thyroid, and cardiac function.",
    "health_el": "Τα Brittany είναι γενικά υγιής, ανθεκτική ράτσα με τυπική διάρκεια ζωής 12–15 χρόνια. Δυσπλασία ισχίου είναι η κύρια ορθοπεδική ανησυχία — ο έλεγχος OFA συνιστάται. Η επιληψία τεκμηριώθηκε σε ορισμένες γραμμές και αποτελεί σοβαρή ανησυχία. Υποθυρεοειδισμός μπορεί να αναπτυχθεί, αντιμετωπίσιμος με φαρμακευτική αγωγή. Οφθαλμικές παθήσεις — PRA και εξάρθρωση φακού πρέπει να ελέγχονται. Λοιμώξεις αυτιών πιθανές λόγω κρεμαστών αυτιών. Αλλεργίες και δερματικές παθήσεις μπορεί να εμφανιστούν. Η ράτσα διατηρεί καλή γενετική ποικιλότητα. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, μάτια, θυρεοειδή και καρδιά."
  },
  {
    "id": "english-pointer",
    "slug": "english-pointer",
    "name_en": "English Pointer",
    "name_el": "Αγγλικός Πόιντερ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "large",
    "lifespan": "12-17 years",
    "temperament_en": ["Amiable", "Energetic", "Loyal", "Even-tempered", "Intelligent"],
    "temperament_el": ["Φιλικός", "Ενεργητικός", "Πιστός", "Ισορροπημένος", "Έξυπνος"],
    "description_en": "The English Pointer is a classic pointing breed known for the distinctive point stance when locating game. Bred in England for bird hunting, they are athletic, graceful dogs with a short, smooth coat. Pointers are friendly and devoted to their families, and they get along well with children and other dogs. They require ample exercise and do best in homes with access to space to run.",
    "description_el": "Ο Αγγλικός Πόιντερ είναι κλασική ράτσα δείκτη από την Αγγλία, γνωστός για τη χαρακτηριστική στάση point. Αθλητικά, κομψά σκυλιά με κοντό λείο τρίχωμα. Αναπτύχθηκαν τον 17ο αιώνα για εντοπισμό πτηνών. Φιλικοί, αφοσιωμένοι, εξαιρετικοί με παιδιά. Χτισμένοι για ταχύτητα και αντοχή — μπορούν να καλύψουν τεράστιο έδαφος. Αριστοκρατική εμφάνιση με μυώδη, κομψή σωματική διάπλαση.",
    "characteristics": { "energy": 5, "grooming": 1, "friendliness": 4, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "English Pointers need substantial daily exercise — at least 1 to 2 hours of vigorous running, hiking, or field work — and they are among the most athletic of all sporting breeds, built to cover vast ground at high speed. Their short, smooth coat requires only weekly brushing and occasional bathing. They are sensitive, gentle dogs that respond best to calm, positive, consistent training — harsh methods will shut them down. Secure fencing is essential as their running instinct is powerful. They are friendly, amiable house dogs when properly exercised. They get along well with children and other dogs. They need space to run and are not suited to apartment living without extensive daily exercise.",
    "care_el": "Οι Αγγλικοί Πόιντερ χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 έως 2 ώρες έντονου τρεξίματος, πεζοπορίας ή εργασίας στο πεδίο — και είναι μεταξύ των πιο αθλητικών αγωνιστικών ρατσών, χτισμένοι να καλύπτουν τεράστιο έδαφος με υψηλή ταχύτητα. Το κοντό, λείο τρίχωμά τους απαιτεί μόνο εβδομαδιαίο βούρτσισμα. Είναι ευαίσθητα, ήπια σκυλιά που ανταποκρίνονται σε ήρεμη, θετική, σταθερή εκπαίδευση. Η ασφαλής περίφραξη είναι απαραίτητη. Τα πάνε καλά με παιδιά και άλλα σκυλιά. Χρειάζονται χώρο για τρέξιμο και δεν ταιριάζουν σε διαμέρισμα χωρίς εκτεταμένη καθημερινή άσκηση.",
    "health_en": "English Pointers are generally a healthy, hardy breed with an impressive lifespan of 12–17 years. Hip dysplasia can occur — OFA screening is recommended. Congenital deafness has been documented, particularly in dogs with extensive white markings — BAER testing is advised. Eye conditions including cataracts and cherry eye may develop. Hypothyroidism has been occasionally reported. Epilepsy occurs in some lines. Neurotropic osteopathy (a rare skeletal condition) has been documented. The breed can be sensitive to anesthesia. Allergies and skin conditions may occur. Their deep chest makes bloat (GDV) a potential concern. Regular veterinary care supports their naturally robust health. Responsible breeders screen for hips, eyes, hearing, and thyroid.",
    "health_el": "Οι Αγγλικοί Πόιντερ είναι γενικά υγιής, ανθεκτική ράτσα με εντυπωσιακή διάρκεια ζωής 12–17 χρόνια. Η δυσπλασία ισχίου μπορεί να εμφανιστεί — ο έλεγχος OFA συνιστάται. Η συγγενής κώφωση τεκμηριώθηκε, ιδίως σε σκυλιά με εκτεταμένες λευκές σημάνσεις — BAER τεστ. Οφθαλμικές παθήσεις συμπεριλαμβανομένου καταρράκτη και cherry eye. Υποθυρεοειδισμός αναφέρθηκε περιστασιακά. Επιληψία σε ορισμένες γραμμές. Ευαίσθητοι σε αναισθησία. Φούσκωμα (GDV) πιθανός κίνδυνος λόγω βαθύ θώρακα. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, μάτια, ακοή και θυρεοειδή."
  },
  {
    "id": "english-setter",
    "slug": "english-setter",
    "name_en": "English Setter",
    "name_el": "Αγγλικός Σέττερ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "large",
    "lifespan": "11-15 years",
    "temperament_en": ["Gentle", "Friendly", "Energetic", "Good-natured", "Devoted"],
    "temperament_el": ["Ήπιος", "Φιλικός", "Ενεργητικός", "Καλόκαρδος", "Αφοσιωμένος"],
    "description_en": "The English Setter is an elegant, graceful bird dog with a silky feathered coat. Bred in England to locate and set for game, they are gentle and affectionate family companions. They are known for their friendly, outgoing nature and get along well with children, other dogs, and often other pets. Their beautiful coat comes in belton speckled patterns in various colors.",
    "description_el": "Ο Αγγλικός Σέττερ είναι κομψός, χαριτωμένος σκύλος πτηνών με μεταξωτό φτερωτό τρίχωμα. Εκτράφηκε στην Αγγλία για εντοπισμό και ακινητοποίηση θηράματος — μία από τις αρχαιότερες αγγλικές σπορ ράτσες με πάνω από 400 χρόνια ιστορίας. Ήπιοι και στοργικοί οικογενειακοί σύντροφοι, γνωστοί για τη φιλική, εξωστρεφή φύση τους. Τα πάνε εξαιρετικά με παιδιά, άλλα σκυλιά και συχνά με άλλα κατοικίδια. Το πανέμορφο τρίχωμά τους έρχεται σε σχέδια belton σε χρώματα πορτοκαλί, μπλε, λεμονί και σοκολάτα.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "English Setters need substantial daily exercise — at least 1 to 1.5 hours of walks, runs, or field work — and they love hiking and free-running in safe areas. Their beautiful, silky feathered coat requires regular grooming: thorough brushing at least 3 times per week to prevent mats, with particular attention to the ear feathering, chest, and leg furnishings. Professional trimming every few months keeps the coat manageable. Their long ears need regular cleaning. They are gentle, sensitive dogs that train well with positive, patient methods. They are extremely social and thrive as integral family members. They can develop separation anxiety if isolated.",
    "care_el": "Οι Αγγλικοί Σέττερ χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 έως 1,5 ώρες βόλτες, τρέξιμο ή εργασία στο πεδίο — και λατρεύουν την πεζοπορία και το ελεύθερο τρέξιμο σε ασφαλείς περιοχές. Το πανέμορφο, μεταξωτό φτερωτό τρίχωμα απαιτεί τακτικό βούρτσισμα τουλάχιστον 3 φορές εβδομαδιαία για αποφυγή κόμπων. Τα μακριά αυτιά χρειάζονται τακτικό καθαρισμό. Είναι ήπια, ευαίσθητα σκυλιά που εκπαιδεύονται καλά με θετικές, υπομονετικές μεθόδους. Είναι εξαιρετικά κοινωνικά και ευδοκιμούν ως αναπόσπαστα μέλη οικογένειας. Μπορεί να αναπτύξουν άγχος αποχωρισμού αν απομονωθούν.",
    "health_en": "English Setters have a typical lifespan of 11–15 years. Hip and elbow dysplasia are orthopedic concerns — screening is recommended. Congenital deafness can occur, particularly in dogs with extensive white — BAER testing is advised. Hypothyroidism is relatively common and manageable with medication. Eye conditions including PRA have been documented. Allergies and skin conditions can develop. The breed can be prone to certain cancers. Autoimmune thyroiditis occurs at elevated rates. Ear infections are common with their long, feathered ears. Neuronal ceroid lipofuscinosis (NCL) has been identified in some lines — DNA testing is available. Responsible breeders screen for hips, elbows, eyes, hearing, thyroid, and NCL.",
    "health_el": "Οι Αγγλικοί Σέττερ έχουν τυπική διάρκεια ζωής 11–15 χρόνια. Δυσπλασία ισχίου και αγκώνα ορθοπεδικές ανησυχίες — ο έλεγχος συνιστάται. Συγγενής κώφωση μπορεί να εμφανιστεί, ιδίως σε σκυλιά με εκτεταμένο λευκό — BAER τεστ. Υποθυρεοειδισμός σχετικά κοινός, διαχειρίσιμος με φαρμακευτική αγωγή. Οφθαλμικές παθήσεις συμπεριλαμβανομένης PRA τεκμηριώθηκαν. Αλλεργίες και δερματικές παθήσεις πιθανές. Η ράτσα μπορεί να είναι επιρρεπής σε ορισμένους καρκίνους. Νευρωνική κηροειδής λιποφουσκίνωση (NCL) — DNA τεστ διαθέσιμο. Λοιμώξεις αυτιών κοινές. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, ακοή, θυρεοειδή και NCL."
  },
  {
    "id": "german-longhaired-pointer",
    "slug": "german-longhaired-pointer",
    "name_en": "German Longhaired Pointer",
    "name_el": "Γερμανικός Μακρυτρίχος Πόιντερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "large",
    "lifespan": "12-14 years",
    "temperament_en": ["Calm", "Docile", "Intelligent", "Trainable", "Devoted"],
    "temperament_el": ["Ήρεμος", "Πειθήνιος", "Έξυπνος", "Εκπαιδεύσιμος", "Αφοσιωμένος"],
    "description_en": "The German Longhaired Pointer is a versatile gun dog from Germany, bred for pointing and retrieving on land and in water. They have a long, sleek coat with feathering and a calm, steady temperament. They work closely with their handlers and make loyal family companions. Their versatility and willingness to please make them suitable for various dog sports and active families.",
    "description_el": "Ο Γερμανικός Μακρυτρίχος Πόιντερ είναι ευέλικτος σκύλος όπλων από τη Γερμανία, αναπτυγμένος τον 19ο αιώνα για δείκτη και ανάκτηση σε στεριά και νερό. Έχει μακρύ, λείο τρίχωμα με φτερά και ήρεμο, σταθερό χαρακτήρα. Ο πιο σπάνιος από τους τρεις γερμανικούς πόιντερ, αλλά εξαιρετικά αποτελεσματικός στο πεδίο. Εργάζεται στενά με τον χειριστή του και είναι πιστός οικογενειακός σύντροφος. Η ευελιξία και η προθυμία του τον καθιστούν κατάλληλο για διάφορα αθλήματα σκύλων και ενεργές οικογένειες.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 4, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "German Longhaired Pointers need substantial daily exercise — at least 1 to 1.5 hours of vigorous activity. Their long, feathered coat requires regular brushing several times per week to prevent mats, with particular attention to the ears, chest, and leg feathering. They enjoy swimming and field work and are equally happy hiking with their family. They bond very closely with their families and do not tolerate isolation well. Training is straightforward — they are intelligent, eager to please, and respond well to consistent, positive methods. They are calm and well-mannered indoors when adequately exercised.",
    "care_el": "Οι Γερμανικοί Μακρυτρίχοι Πόιντερ χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 έως 1,5 ώρες έντονης δραστηριότητας. Το μακρύ, φτερωτό τρίχωμά τους απαιτεί τακτικό βούρτσισμα πολλές φορές εβδομαδιαία για αποφυγή κόμπων, με ιδιαίτερη προσοχή στα αυτιά, στήθος και πόδια. Απολαμβάνουν κολύμβηση και εργασία στο πεδίο. Δένονται πολύ στενά με τις οικογένειές τους και δεν ανέχονται την απομόνωση. Η εκπαίδευση είναι εύκολη — έξυπνοι, πρόθυμοι, ανταποκρίνονται σε θετικές μεθόδους. Ήρεμοι και ευγενικοί εσωτερικά όταν ασκούνται επαρκώς.",
    "health_en": "German Longhaired Pointers are generally a healthy breed with a typical lifespan of 12–14 years. Hip dysplasia is the primary orthopedic concern — screening is recommended. Ear infections can occur due to their long, feathered ears — regular cleaning is important. Eye conditions including entropion have been occasionally reported. Hypothyroidism may develop. Bloat (GDV) is a potential risk. The breed is relatively rare outside Germany, and German breeding regulations (VDH performance tests required before breeding) help maintain both health and working ability. Responsible breeders screen for hips, elbows, eyes, and are mindful of maintaining genetic diversity.",
    "health_el": "Οι Γερμανικοί Μακρυτρίχοι Πόιντερ είναι γενικά υγιής ράτσα με τυπική διάρκεια ζωής 12–14 χρόνια. Η δυσπλασία ισχίου είναι η κύρια ορθοπεδική ανησυχία — ο έλεγχος συνιστάται. Λοιμώξεις αυτιών πιθανές λόγω μακριών, φτερωτών αυτιών — τακτικός καθαρισμός σημαντικός. Οφθαλμικές παθήσεις συμπεριλαμβανομένου εντροπίου αναφέρθηκαν. Υποθυρεοειδισμός μπορεί να αναπτυχθεί. Φούσκωμα (GDV) πιθανός κίνδυνος. Η ράτσα είναι σχετικά σπάνια εκτός Γερμανίας και οι γερμανικοί κανονισμοί εκτροφής βοηθούν στη διατήρηση υγείας και εργασιακής ικανότητας. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια και διατηρούν γενετική ποικιλότητα."
  },
  {
    "id": "german-shorthaired-pointer",
    "slug": "german-shorthaired-pointer",
    "name_en": "German Shorthaired Pointer",
    "name_el": "Γερμανικός Βραχυτρίχος Πόιντερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Friendly", "Energetic", "Intelligent", "Trainable", "Eager to please"],
    "temperament_el": ["Φιλικός", "Ενεργητικός", "Έξυπνος", "Εκπαιδεύσιμος", "Πρόθυμος να ευχαριστήσει"],
    "description_en": "The German Shorthaired Pointer is one of the most versatile gun dogs, capable of pointing, retrieving, and tracking on land and in water. Bred in Germany for all-purpose hunting, they are athletic, intelligent, and eager to please. They have a short, dense coat that is easy to maintain. GSPs form strong bonds with their families and need an active lifestyle to be happy.",
    "description_el": "Ο Γερμανικός Βραχυτρίχος Πόιντερ (GSP) είναι ένας από τους πιο ευέλικτους σκύλους όπλων παγκοσμίως — ικανός για δείκτη, ανάκτηση και ιχνηλασία σε στεριά και νερό. Αναπτύχθηκε τον 19ο αιώνα στη Γερμανία για κυνήγι γενικής χρήσης. Αθλητικοί, έξυπνοι και πρόθυμοι να ευχαριστήσουν, με κοντό, πυκνό τρίχωμα σε liver ή liver και λευκό. Είναι ο πιο δημοφιλής σκύλος όπλων στη Γερμανία και χτισμένος για ταχύτητα, αντοχή και ευελιξία. Δημιουργούν ισχυρούς δεσμούς με τις οικογένειές τους.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 4, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "German Shorthaired Pointers need substantial daily exercise — at least 1.5 to 2 hours of vigorous running, swimming, hiking, or field work — and they are among the most energetic of all breeds, requiring an athletic owner who can match their stamina. They are extremely intelligent and need mental stimulation to prevent boredom-driven destructive behavior. Their short coat is very low-maintenance. Training is highly rewarding — GSPs are eager to please and excel at virtually every canine sport. Early socialization is important to develop their confident, friendly nature. They are not suited to sedentary lifestyles.",
    "care_el": "Οι GSP χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1,5 έως 2 ώρες έντονου τρεξίματος, κολύμβησης, πεζοπορίας ή εργασίας στο πεδίο — και είναι μεταξύ των πιο ενεργητικών ρατσών, απαιτώντας αθλητικό ιδιοκτήτη. Εξαιρετικά έξυπνοι και χρειάζονται νοητική διέγερση για αποφυγή καταστροφικής συμπεριφοράς από πλήξη. Το κοντό τρίχωμα είναι πολύ χαμηλής συντήρησης. Η εκπαίδευση είναι πολύ ανταποδοτική — οι GSP είναι πρόθυμοι και υπερέχουν σε σχεδόν κάθε αγώνισμα. Πρώιμη κοινωνικοποίηση σημαντική. Δεν ταιριάζουν σε καθιστικούς τρόπους ζωής.",
    "health_en": "German Shorthaired Pointers have a typical lifespan of 10–12 years. Hip dysplasia is a significant concern — OFA screening is essential. Bloat (GDV) is a serious risk in this deep-chested breed. Eye conditions including cone degeneration (causing day blindness) and PRA have been documented — DNA tests are available. Lymphedema has been identified in some lines. Von Willebrand's disease (a bleeding disorder) has been reported. Cardiac conditions including subaortic stenosis may occur. Hypothyroidism can develop. Lupoid dermatosis has been documented. Cancer, particularly hemangiosarcoma and mast cell tumors, affects the breed at moderate rates. Ear infections can occur. Responsible breeders screen for hips, elbows, eyes, cardiac function, and cone degeneration DNA.",
    "health_el": "Οι GSP έχουν τυπική διάρκεια ζωής 10–12 χρόνια. Δυσπλασία ισχίου είναι σημαντική ανησυχία — ο έλεγχος OFA απαραίτητος. Φούσκωμα (GDV) σοβαρός κίνδυνος σε αυτήν τη βαθυστήθη ράτσα. Εκφύλιση κωνίων που προκαλεί ημερήσια τύφλωση — DNA τεστ διαθέσιμο. PRA επίσης τεκμηριώθηκε. Λεμφοίδημα αναγνωρίστηκε σε ορισμένες γραμμές. Νόσος von Willebrand αναφέρθηκε. Καρδιακές παθήσεις συμπεριλαμβανομένης υποαορτικής στένωσης. Υποθυρεοειδισμός μπορεί να αναπτυχθεί. Καρκίνος σε μέτρια ποσοστά. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, καρδιά και DNA εκφύλισης κωνίων."
  },
  {
    "id": "german-wirehaired-pointer",
    "slug": "german-wirehaired-pointer",
    "name_en": "German Wirehaired Pointer",
    "name_el": "Γερμανικός Σκληρότριχος Πόιντερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "large",
    "lifespan": "12-14 years",
    "temperament_en": ["Determined", "Intelligent", "Loyal", "Energetic", "Versatile"],
    "temperament_el": ["Αποφασιστικός", "Έξυπνος", "Πιστός", "Ενεργητικός", "Ευέλικτος"],
    "description_en": "The German Wirehaired Pointer is a rugged, versatile gun dog with a distinctive wiry, weather-resistant coat. Bred in Germany to work in rough terrain and water, they are determined, intelligent, and loyal. They are slightly more reserved than the Shorthaired variety but equally capable and devoted. Their beard and eyebrows give them a distinctive, expressive appearance.",
    "description_el": "Ο Γερμανικός Σκληρότριχος Πόιντερ (GWP/Drahthaar) είναι σκληραγωγημένος, ευέλικτος σκύλος όπλων που αναπτύχθηκε στα τέλη του 19ου αιώνα στη Γερμανία. Το χαρακτηριστικό σκληρό, ανθεκτικό στις καιρικές συνθήκες τρίχωμα προστατεύει από αγκάθια, κρύο νερό και σκληρό έδαφος. Είναι η δημοφιλέστερη ράτσα κυνηγιού στη Γερμανία. Αποφασιστικοί, έξυπνοι και βαθιά πιστοί στον ιδιοκτήτη τους, ελαφρώς πιο συγκρατημένοι από τους GSP. Η γενειάδα και τα φρύδια δίνουν χαρακτηριστική, εκφραστική εμφάνιση.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 3, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "German Wirehaired Pointers need substantial daily exercise and mental stimulation. Their wiry coat requires regular brushing and occasional hand-stripping or clipping to maintain texture. They enjoy swimming, hiking, and field work. They need consistent, firm but fair training and early socialization. They can be strong-willed and are best suited to active, experienced owners.",
    "care_el": "Οι GWP χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1,5 ώρες έντονης δραστηριότητας. Το σκληρό τρίχωμά τους απαιτεί τακτικό βούρτσισμα και περιοδικό hand-stripping ή κούρεμα για διατήρηση της σωστής υφής. Απολαμβάνουν κολύμβηση, πεζοπορία και εργασία στο πεδίο. Χρειάζονται σταθερή, δίκαιη εκπαίδευση — έχουν ισχυρή προσωπικότητα και μπορεί να είναι ισχυρογνώμονες. Η πρώιμη κοινωνικοποίηση είναι σημαντική. Ταιριάζουν καλύτερα σε έμπειρους, ενεργούς ιδιοκτήτες.",
    "health_en": "German Wirehaired Pointers have a typical lifespan of 12–14 years. Hip dysplasia is a significant concern — OFA screening is recommended. Von Willebrand's disease (Type II) is documented in the breed — DNA testing is available and essential. Eye conditions including cataracts and entropion can occur. Bloat (GDV) is a potential risk. Hypothyroidism may develop. Ear infections can occur. Cardiac conditions including subaortic stenosis have been reported. The breed's strict German breeding regulations (Zuchtprüfung performance tests required) help maintain overall health. Allergies and skin conditions can develop. Responsible breeders screen for hips, eyes, vWD DNA, thyroid, and cardiac function.",
    "health_el": "Οι GWP έχουν τυπική διάρκεια ζωής 12–14 χρόνια. Η δυσπλασία ισχίου είναι σημαντική ανησυχία — ο έλεγχος OFA συνιστάται. Η νόσος von Willebrand (Τύπος II) τεκμηριώθηκε — DNA τεστ διαθέσιμο και απαραίτητο. Οφθαλμικές παθήσεις συμπεριλαμβανομένου καταρράκτη και εντροπίου. Φούσκωμα (GDV) πιθανός κίνδυνος. Υποθυρεοειδισμός μπορεί να αναπτυχθεί. Καρδιακές παθήσεις αναφέρθηκαν. Οι αυστηροί γερμανικοί κανονισμοί εκτροφής βοηθούν στη διατήρηση συνολικής υγείας. Αλλεργίες και δερματικές παθήσεις πιθανές. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, μάτια, vWD DNA, θυρεοειδή και καρδιά."
  },
  {
    "id": "gordon-setter",
    "slug": "gordon-setter",
    "name_en": "Gordon Setter",
    "name_el": "Γκόρντον Σέττερ",
    "type": "dog",
    "origin": "Scotland",
    "originCode": "GB",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Loyal", "Confident", "Reserved", "Energetic", "Alert"],
    "temperament_el": ["Πιστός", "Σίγουρος", "Συνεσταλμένος", "Ενεργητικός", "Επαγρύπνος"],
    "description_en": "The Gordon Setter is the largest of the setter breeds, developed in Scotland for finding game birds. They have a striking black and tan coat with a feathered appearance. Gordons are loyal, confident, and reserved with strangers but devoted to their families. They are energetic and need regular exercise and mental stimulation. They are intelligent and trainable but can be strong-willed.",
    "description_el": "Το Gordon Setter είναι το μεγαλύτερο και πιο ανθεκτικό setter, αναπτύχθηκε στη Σκωτία στο κάστρο του 4ου Δούκα του Gordon τον 17ο αιώνα. Διαθέτει εντυπωσιακό μαύρο και καφέ τρίχωμα — είναι το μόνο setter με μαύρο χρώμα. Πιστοί, σίγουροι και σοβαροί, περισσότερο συγκρατημένοι από τα υπόλοιπα setters αλλά βαθιά αφοσιωμένοι στις οικογένειές τους. Ισχυρά χτισμένοι για αντοχή στα σκωτσέζικα Χάιλαντ, είναι ενεργητικοί και χρειάζονται τακτική άσκηση και νοητική διέγερση.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 3, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Gordon Setters need substantial daily exercise — at least 1 to 1.5 hours of vigorous walks, runs, or field work — and they have more endurance than many setter breeds. Their luxurious black and tan coat requires regular brushing at least 3 times per week to prevent mats, with professional trimming every few months. Ear cleaning is critical due to their long ears. Training requires patience — Gordons are intelligent but can be stubborn and independent-minded, responding best to consistent, positive methods. They bond deeply with their families and can be reserved with strangers. They mature more slowly than other setters and benefit from patient, long-term training.",
    "care_el": "Τα Gordon Setter χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 έως 1,5 ώρες έντονων βόλτων, τρεξίματος ή εργασίας στο πεδίο — και έχουν περισσότερη αντοχή από πολλές ράτσες setter. Το πολυτελές μαύρο και καφέ τρίχωμά τους απαιτεί τακτικό βούρτσισμα τουλάχιστον 3 φορές εβδομαδιαία. Ο καθαρισμός αυτιών είναι κρίσιμος λόγω μακριών αυτιών. Η εκπαίδευση απαιτεί υπομονή — τα Gordons είναι ισχυρογνώμονα και ωριμάζουν αργά, ανταποκρινόμενα σε σταθερές, θετικές μεθόδους. Δένονται βαθιά με τις οικογένειές τους.",
    "health_en": "Gordon Setters have a typical lifespan of 10–12 years. Hip and elbow dysplasia are significant orthopedic concerns — screening is essential. Progressive retinal atrophy (PRA) is documented — DNA testing (rcd4) is available. Hypothyroidism is relatively common. Bloat (GDV) is a serious risk in this large, deep-chested breed. Cerebellar abiotrophy has been identified in some lines. Eye conditions including cataracts and entropion may develop. Ear infections are common. Cancer is a concern in older Gordons. Allergies and skin conditions can occur. The breed maintains a moderate genetic diversity. Responsible breeders screen for hips, elbows, eyes, PRA DNA (rcd4), thyroid, and cardiac function.",
    "health_el": "Τα Gordon Setter έχουν τυπική διάρκεια ζωής 10–12 χρόνια. Η δυσπλασία ισχίου και αγκώνα είναι σημαντικές ορθοπεδικές ανησυχίες — ο έλεγχος είναι απαραίτητος. Η PRA τεκμηριώθηκε — DNA τεστ (rcd4) διαθέσιμο. Υποθυρεοειδισμός σχετικά κοινός. Φούσκωμα (GDV) σοβαρός κίνδυνος σε αυτήν τη μεγαλόσωμη, βαθυστήθη ράτσα. Παρεγκεφαλιδική αβιοτροφία αναγνωρίστηκε σε ορισμένες γραμμές. Οφθαλμικές παθήσεις συμπεριλαμβανομένου καταρράκτη και εντροπίου. Λοιμώξεις αυτιών κοινές. Καρκίνος ανησυχία σε ηλικιωμένα. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, PRA DNA (rcd4), θυρεοειδή και καρδιά."
  },
  {
    "id": "hungarian-vizsla",
    "slug": "hungarian-vizsla",
    "name_en": "Hungarian Vizsla",
    "name_el": "Ουγγρικός Βίζλα",
    "type": "dog",
    "origin": "Hungary",
    "originCode": "HU",
    "images": [],
    "size": "large",
    "lifespan": "12-15 years",
    "temperament_en": ["Affectionate", "Energetic", "Loyal", "Gentle", "Trainable"],
    "temperament_el": ["Στοργικός", "Ενεργητικός", "Πιστός", "Ήπιος", "Εκπαιδεύσιμος"],
    "description_en": "The Hungarian Vizsla is a versatile pointing breed from Hungary, prized for their golden-rust coat and affectionate nature. They are often called velcro dogs because they form extremely close bonds with their owners. Vizslas are energetic, intelligent, and eager to please. They excel in hunting, agility, obedience, and as devoted family companions. They are sensitive dogs that thrive on positive reinforcement.",
    "description_el": "Ο Ουγγρικός Βίζλα είναι ευέλικτη ράτσα δείκτη με ιστορία πάνω από 1.000 ετών — συνόδευε Μαγυάρους αριστοκράτες στο κυνήγι. Διαθέτει εντυπωσιακό χρυσό-σκουριά τρίχωμα που ταιριάζει αρμονικά στα μάτια. Αποκαλούνται συχνά «velcro σκύλοι» λόγω των εξαιρετικά στενών δεσμών που δημιουργούν με τους ιδιοκτήτες τους. Ενεργητικοί, έξυπνοι και βαθιά ευαίσθητοι. Διαπρέπουν σε κυνήγι, agility, υπακοή και ως αφοσιωμένοι οικογενειακοί σύντροφοι. Ήταν η πρώτη ράτσα που κέρδισε τίτλους πρωταθλητή σε 5 κλάδους AKC.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Hungarian Vizslas need substantial daily exercise and close human companionship. They are prone to separation anxiety if left alone too much. Their short coat requires minimal grooming. They excel at running, swimming, and field work. They are sensitive and respond best to gentle, positive training. They do not do well in kennels or as outdoor-only dogs.",
    "care_el": "Οι Βίζλα χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1,5 έως 2 ώρες — και στενή ανθρώπινη συντροφιά είναι απαραίτητη καθώς είναι ιδιαίτερα επιρρεπείς σε άγχος αποχωρισμού. Το κοντό τρίχωμά τους απαιτεί ελάχιστη περιποίηση. Είναι εξαιρετικά ευαίσθητοι σκύλοι που ανταποκρίνονται καλύτερα σε ήπια, θετική εκπαίδευση — σκληρές μέθοδοι τους τραυματίζουν. Δεν κάνουν ως μόνο-εξωτερικοί ή σκύλοι ρημαγμένοι. Χρειάζονται τόσο σωματική όσο και νοητική διέγερση. Διαπρέπουν σε τρέξιμο, κολύμβηση και εργασία στο πεδίο.",
    "health_en": "Hungarian Vizslas have a typical lifespan of 12–15 years. Hip dysplasia is a concern — OFA screening is recommended. Epilepsy has been documented in the breed. Hypothyroidism can develop. Progressive retinal atrophy (PRA) should be screened for. Allergies and food sensitivities are relatively common. Lymphosarcoma and hemangiosarcoma occur at moderate rates. Immune-mediated conditions including polymyositis and sebaceous adenitis have been reported. The breed can be sensitive to anesthesia. Bloat (GDV) is a potential risk. Eye conditions including entropion may occur. The breed's growing popularity raises concerns about maintaining health — puppy buyers should seek health-tested parents. Responsible breeders screen for hips, elbows, eyes, thyroid, and cardiac function.",
    "health_el": "Οι Βίζλα έχουν τυπική διάρκεια ζωής 12–15 χρόνια. Η δυσπλασία ισχίου αποτελεί ανησυχία — ο έλεγχος OFA συνιστάται. Η επιληψία τεκμηριώθηκε στη ράτσα. Υποθυρεοειδισμός μπορεί να αναπτυχθεί. Η PRA πρέπει να ελέγχεται. Αλλεργίες και ευαισθησίες τροφής σχετικά κοινές. Λεμφοσάρκωμα και αιμαγγειοσάρκωμα σε μέτρια ποσοστά. Ανοσοδιαμεσολαβούμενες παθήσεις αναφέρθηκαν. Ευαίσθητοι σε αναισθησία. Φούσκωμα (GDV) πιθανός κίνδυνος. Η αυξανόμενη δημοτικότητα εγείρει ανησυχίες για τη διατήρηση υγείας. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, θυρεοειδή και καρδιά."
  },
  {
    "id": "hungarian-wirehaired-vizsla",
    "slug": "hungarian-wirehaired-vizsla",
    "name_en": "Hungarian Wirehaired Vizsla",
    "name_el": "Ουγγρικός Σκληρότριχος Βίζλα",
    "type": "dog",
    "origin": "Hungary",
    "originCode": "HU",
    "images": [],
    "size": "large",
    "lifespan": "12-14 years",
    "temperament_en": ["Loyal", "Calm", "Courageous", "Trainable", "Affectionate"],
    "temperament_el": ["Πιστός", "Ήρεμος", "Θαρραλέος", "Εκπαιδεύσιμος", "Στοργικός"],
    "description_en": "The Hungarian Wirehaired Vizsla was developed by crossing the smooth Vizsla with the German Wirehaired Pointer to create a more robust, weather-resistant hunting dog. They have a wiry, rust-colored coat and a calm, steady temperament. They are loyal, affectionate family dogs that also excel in the field. They are slightly more reserved than the smooth Vizsla but equally devoted and trainable.",
    "description_el": "Ο Ουγγρικός Σκληρότριχος Βίζλα αναπτύχθηκε τη δεκαετία 1930 διασταυρώνοντας λείο Βίζλα με GWP — πιο στιβαρός, ανθεκτικός κυνηγετικός σκύλος. Σκληρό σκουριά τρίχωμα με γενειάδα. Ηρεμότερος, πιο μεθοδικός από τον λείο Βίζλα. Πιστοί, στοργικοί οικογενειακοί σκύλοι. Εξαιρετικοί στο πεδίο — ανθεκτικοί σε κρύο και αγκάθια. Αυξανόμενη δημοτικότητα παγκοσμίως.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 4, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Hungarian Wirehaired Vizslas need substantial daily exercise — at least 1 to 1.5 hours — though they are calmer and more methodical than the smooth Vizsla. Their wiry coat requires regular brushing and periodic hand-stripping every few months to maintain texture. They enjoy swimming, hiking, and field work. They bond closely with families and also dislike extended isolation. Training is rewarding — they are cooperative and eager but more independently-minded than the smooth variety. Ear cleaning is recommended. They are adaptable to family life with adequate activity.",
    "care_el": "Οι Σκληρότριχοι Βίζλα χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 έως 1,5 ώρες — αν και είναι ηρεμότεροι και πιο μεθοδικοί από τη λεία ποικιλία. Το σκληρό τρίχωμά τους απαιτεί τακτικό βούρτσισμα και περιοδικό hand-stripping κάθε λίγους μήνες για τη διατήρηση της υφής. Απολαμβάνουν κολύμβηση, πεζοπορία και εργασία στο πεδίο. Δένονται στενά με τις οικογένειές τους και δεν αγαπούν την παρατεταμένη απομόνωση. Η εκπαίδευση είναι ανταποδοτική — συνεργάσιμοι και πρόθυμοι. Προσαρμοστικοί στην οικογενειακή ζωή με επαρκή δραστηριότητα.",
    "health_en": "Hungarian Wirehaired Vizslas have a typical lifespan of 12–14 years. Hip dysplasia is a concern — OFA screening is recommended. Hypothyroidism can develop. Eye conditions should be screened for annually. Hyperuricosuria (HUU, linked to urate stone formation) has been identified in some lines — DNA testing is available. Allergies and skin conditions may occur. Epilepsy has been occasionally reported. Bloat (GDV) is a potential risk. The breed is relatively young and still being refined — responsible breeders maintain health records. The relatively small gene pool outside Hungary and Central Europe means genetic diversity needs attention. Responsible breeders screen for hips, elbows, eyes, thyroid, and HUU DNA.",
    "health_el": "Οι Σκληρότριχοι Βίζλα έχουν τυπική διάρκεια ζωής 12–14 χρόνια. Η δυσπλασία ισχίου αποτελεί ανησυχία — ο έλεγχος OFA συνιστάται. Υποθυρεοειδισμός μπορεί να αναπτυχθεί. Οφθαλμικές παθήσεις πρέπει να ελέγχονται ετησίως. Υπερουρικοζουρία (HUU) αναγνωρίστηκε — DNA τεστ διαθέσιμο. Αλλεργίες και δερματικές παθήσεις πιθανές. Επιληψία αναφέρθηκε περιστασιακά. Φούσκωμα (GDV) πιθανός κίνδυνος. Η ράτσα είναι σχετικά νέα — η γενετική ποικιλότητα χρειάζεται προσοχή εκτός Ουγγαρίας και Κεντρικής Ευρώπης. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, θυρεοειδή και HUU DNA."
  },
  {
    "id": "irish-red-and-white-setter",
    "slug": "irish-red-and-white-setter",
    "name_en": "Irish Red and White Setter",
    "name_el": "Ιρλανδικός Κόκκινος και Λευκός Σέττερ",
    "type": "dog",
    "origin": "Ireland",
    "originCode": "IE",
    "images": [],
    "size": "large",
    "lifespan": "11-15 years",
    "temperament_en": ["Friendly", "Energetic", "Devoted", "Intelligent", "Good-natured"],
    "temperament_el": ["Φιλικός", "Ενεργητικός", "Αφοσιωμένος", "Έξυπνος", "Καλόκαρδος"],
    "description_en": "The Irish Red and White Setter is the older of the two Irish setter breeds, with a distinctive red and white parti-color coat. They were bred for hunting in the Irish countryside and are energetic, friendly, and devoted to their families. They are intelligent and trainable, with a slightly calmer disposition than the solid red Irish Setter. They get along well with children and other dogs.",
    "description_el": "Ο Ιρλανδικός Κόκκινος και Λευκός Σέττερ είναι η αρχική ιρλανδική ράτσα setter — αρχαιότερη από τον κόκκινο. Σχεδόν εξαφανίστηκε τον 19ο αιώνα — σωθείσα τη δεκαετία 1920. Λευκό τρίχωμα με κόκκινες κηλίδες. Ενεργητικοί, φιλικοί, αφοσιωμένοι. Ηρεμότεροι και πιο μεθοδικοί από τον κόκκινο Irish Setter. Εξαιρετικοί στο κυνήγι — τα λευκά τους τα κάνει ορατά στο πεδίο.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Irish Red and White Setters need substantial daily exercise — at least 1 to 1.5 hours of vigorous activity. Their feathered coat requires regular brushing several times per week. They enjoy long walks, field work, and free-running in secure areas. They are social, affectionate dogs that thrive on family involvement and do not do well isolated. Ear cleaning is critical due to their pendulous ears. Training is rewarding — they are cooperative and responsive to positive methods. They are calmer and more focused than the red Irish Setter, making them somewhat easier to train.",
    "care_el": "Οι IRWS χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 έως 1,5 ώρες έντονης δραστηριότητας. Το φτερωτό τρίχωμά τους απαιτεί τακτικό βούρτσισμα πολλές φορές εβδομαδιαία. Απολαμβάνουν μακριές βόλτες, εργασία στο πεδίο και ελεύθερο τρέξιμο σε ασφαλείς χώρους. Είναι κοινωνικά, στοργικά σκυλιά που ευδοκιμούν με οικογενειακή συμμετοχή. Ο καθαρισμός αυτιών είναι κρίσιμος λόγω κρεμαστών αυτιών. Η εκπαίδευση είναι ανταποδοτική — συνεργάσιμοι, ανταποκρίνονται σε θετικές μεθόδους. Ηρεμότεροι και πιο εστιασμένοι από τον κόκκινο Irish Setter.",
    "health_en": "Irish Red and White Setters have a typical lifespan of 11–15 years. Hip and elbow dysplasia are orthopedic concerns. Canine leucocyte adhesion deficiency (CLAD) is a breed-specific fatal genetic condition — DNA testing is available and essential for all breeding stock. PRA (rcd1 and rcd4) has been documented — DNA testing available. Von Willebrand's disease has been reported. Hypothyroidism can develop. Ear infections are common. Bloat (GDV) is a potential risk. The breed's small global population means genetic diversity requires careful management. Responsible breeders screen for CLAD DNA, PRA DNA, hips, elbows, eyes, and thyroid.",
    "health_el": "Οι IRWS έχουν τυπική διάρκεια ζωής 11–15 χρόνια. Δυσπλασία ισχίου/αγκώνα. CLAD — θανατηφόρα γενετική πάθηση — DNA τεστ απαραίτητο. PRA (rcd1, rcd4) — DNA τεστ. Νόσος von Willebrand. Υποθυρεοειδισμός. Λοιμώξεις αυτιών. Φούσκωμα κίνδυνος. Μικρός παγκόσμιος πληθυσμός — γενετική ποικιλότητα. Οι εκτροφείς ελέγχουν CLAD, PRA DNA, ισχία, αγκώνα, μάτια, θυρεοειδή."
  },
  {
    "id": "irish-setter",
    "slug": "irish-setter",
    "name_en": "Irish Setter",
    "name_el": "Ιρλανδικός Σέττερ",
    "type": "dog",
    "origin": "Ireland",
    "originCode": "IE",
    "images": [],
    "size": "large",
    "lifespan": "12-15 years",
    "temperament_en": ["Outgoing", "Energetic", "Playful", "Affectionate", "Independent"],
    "temperament_el": ["Εξωστρεφής", "Ενεργητικός", "Παιχνιδιάρης", "Στοργικός", "Ανεξάρτητος"],
    "description_en": "The Irish Setter is famous for its stunning mahogany or chestnut red coat and graceful, athletic build. Bred in Ireland for bird hunting, they are outgoing, energetic, and playful companions. They are affectionate with their families and generally friendly with everyone. Irish Setters can be independent and may need patient, consistent training. They are beautiful, lively dogs that need plenty of exercise.",
    "description_el": "Ο Ιρλανδικός Σέττερ είναι διάσημος για εκπληκτικό μαόνι κόκκινο τρίχωμα — μία από τις πιο αναγνωρίσιμες ράτσες. Αναπτύχθηκε τον 18ο αιώνα στην Ιρλανδία. Χαριτωμένη, αθλητική σωματική διάπλαση. Εξωστρεφείς, ενεργητικοί, παιχνιδιάρηδες — αιώνια κουτάβια στη συμπεριφορά. Στοργικοί, φιλικοί με όλους. Δημοφιλείς σε εκθέσεις μορφολογίας αλλά εξίσου ικανοί κυνηγοί.",
    "characteristics": { "energy": 5, "grooming": 4, "friendliness": 5, "trainability": 3, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Irish Setters need substantial daily exercise — at least 1.5 to 2 hours of running, hiking, or field work — and they remain playful and boisterous well into adulthood. Their gorgeous long coat requires thorough brushing at least 3 times per week and periodic trimming. Ear cleaning is essential. Training requires patience — Irish Setters are intelligent but slow to mature mentally and can be distractible. Positive, fun-based methods work best. They are extremely social and do not tolerate isolation — separation anxiety is common. They are wonderful with children. They can be vocal. Their exuberance and energy make them best suited to active, patient families.",
    "care_el": "Οι Ιρλανδικοί Σέττερ χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1,5 έως 2 ώρες τρεξίματος, πεζοπορίας ή εργασίας στο πεδίο — και παραμένουν παιχνιδιάρηδες και ζωηροί μέχρι βαθιά ενηλικίωση. Το πανέμορφο μακρύ τρίχωμά τους απαιτεί βούρτσισμα τουλάχιστον 3 φορές εβδομαδιαία και περιοδικό κούρεμα. Ο καθαρισμός αυτιών είναι απαραίτητος. Η εκπαίδευση χρειάζεται υπομονή — ωριμάζουν αργά νοητικά. Εξαιρετικά κοινωνικά — δεν ανέχονται απομόνωση, το άγχος αποχωρισμού είναι κοινό. Θαυμάσια με παιδιά. Ταιριάζουν σε ενεργές, υπομονετικές οικογένειες.",
    "health_en": "Irish Setters have a typical lifespan of 12–15 years. Hip and elbow dysplasia are orthopedic concerns — screening is recommended. PRA (rcd1 and rcd4) is documented — DNA testing is available and essential. Hypothyroidism is relatively common. Bloat (GDV) is a serious risk in this deep-chested breed. Epilepsy has been reported in some lines. Osteosarcoma (bone cancer) occurs at elevated rates. Canine leucocyte adhesion deficiency (CLAD) is a fatal genetic disease — DNA testing is available. Ear infections are common. Allergies and skin conditions can develop. Megaesophagus has been occasionally reported. Responsible breeders screen for CLAD DNA, PRA DNA, hips, elbows, eyes, thyroid, and cardiac function.",
    "health_el": "Οι Ιρλανδικοί Σέττερ έχουν τυπική διάρκεια ζωής 12–15 χρόνια. Δυσπλασία ισχίου/αγκώνα. PRA (rcd1, rcd4) — DNA τεστ. Υποθυρεοειδισμός κοινός. Φούσκωμα (GDV) σοβαρός κίνδυνος. Επιληψία. Οστεοσάρκωμα σε αυξημένα ποσοστά. CLAD — θανατηφόρα γενετική νόσος — DNA τεστ. Λοιμώξεις αυτιών. Αλλεργίες. Οι εκτροφείς ελέγχουν CLAD, PRA DNA, ισχία, αγκώνα, μάτια, θυρεοειδή, καρδιά."
  },
  {
    "id": "italian-spinone",
    "slug": "italian-spinone",
    "name_en": "Italian Spinone",
    "name_el": "Ιταλικό Σπιντόνε",
    "type": "dog",
    "origin": "Italy",
    "originCode": "IT",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Docile", "Friendly", "Patient", "Loyal", "Gentle"],
    "temperament_el": ["Πειθήνιος", "Φιλικός", "Υπομονετικός", "Πιστός", "Ήπιος"],
    "description_en": "The Italian Spinone is an ancient Italian pointing breed with a distinctive wiry, dense coat and gentle expression. They are calm, patient dogs that work at a steady pace in the field. Spinoni are devoted to their families and get along well with children and other animals. They are intelligent but can be stubborn; patient, positive training works best. Their rugged build and coat suit them for difficult terrain and cold weather.",
    "description_el": "Το Ιταλικό Σπιντόνε είναι αρχαία ιταλική ράτσα δείκτη — πιθανώς η αρχαιότερη δεικτική ράτσα στον κόσμο. Διαθέτει σκληρό, πυκνό τρίχωμα και ήπια «ανθρώπινη» έκφραση που τους κάνει αμέσως αγαπητούς. Ήρεμα και υπομονετικά σκυλιά που εργάζονται με σταθερό, μεθοδικό ρυθμό στο πεδίο. Βαθιά αφοσιωμένα στις οικογένειές τους και εξαιρετικά με παιδιά και άλλα ζώα. Ο «ήπιος γίγαντας» των σκυλιών όπλων, χτισμένος με σκληραγωγημένη κατασκευή κατάλληλη για δύσκολο ιταλικό έδαφος και κρύο καιρό.",
    "characteristics": { "energy": 3, "grooming": 3, "friendliness": 5, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Italian Spinoni need moderate to substantial exercise and enjoy long walks, hiking, and field work. Their wiry coat requires regular brushing and occasional hand-stripping. They are calm in the home when adequately exercised. They bond closely with their families and prefer to be included in activities. Ear cleaning is recommended. They can be sensitive and respond best to gentle training.",
    "care_el": "Τα Σπιντόνε χρειάζονται μέτρια έως σημαντική άσκηση — τουλάχιστον 1 ώρα καθημερινά — και απολαμβάνουν μακριές βόλτες, πεζοπορία και εργασία στο πεδίο. Το σκληρό τρίχωμά τους απαιτεί τακτικό βούρτσισμα και περιοδικό hand-stripping. Ήρεμα στο σπίτι όταν ασκούνται επαρκώς. Δένονται στενά με τις οικογένειές τους και προτιμούν να συμμετέχουν στις δραστηριότητες. Ευαίσθητα σκυλιά που ανταποκρίνονται σε ήπια εκπαίδευση. Η γενειάδα χρειάζεται καθαρισμό μετά τα γεύματα. Ο καθαρισμός αυτιών συνιστάται.",
    "health_en": "Italian Spinoni have a typical lifespan of 10–12 years. Hip and elbow dysplasia are significant concerns — screening is essential. Cerebellar ataxia is a breed-specific neurological condition that causes progressive coordination loss — awareness and genetic research are ongoing. Bloat (GDV) is a serious risk in this large, deep-chested breed. Eye conditions including entropion and ectropion can occur. Hypothyroidism may develop. Ear infections are common due to their pendulous, hairy ears. Allergies and skin conditions may develop. Some lines may have elevated cancer rates. The breed's moderate popularity helps maintain genetic diversity. Responsible breeders screen for hips, elbows, eyes, and are aware of cerebellar ataxia.",
    "health_el": "Τα Σπιντόνε έχουν τυπική διάρκεια ζωής 10–12 χρόνια. Η δυσπλασία ισχίου και αγκώνα είναι σημαντικές ανησυχίες — ο έλεγχος είναι απαραίτητος. Η παρεγκεφαλιδική αταξία είναι νευρολογική πάθηση ειδική για τη ράτσα που προκαλεί προοδευτική απώλεια συντονισμού — η γενετική έρευνα βρίσκεται σε εξέλιξη. Φούσκωμα (GDV) σοβαρός κίνδυνος σε αυτήν τη μεγαλόσωμη, βαθυστήθη ράτσα. Οφθαλμικές παθήσεις συμπεριλαμβανομένου εντροπίου και εκτροπίου. Υποθυρεοειδισμός πιθανός. Λοιμώξεις αυτιών κοινές. Καρκίνος σε ορισμένες γραμμές. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα και μάτια."
  },
  {
    "id": "korthals-griffon",
    "slug": "korthals-griffon",
    "name_en": "Wirehaired Pointing Griffon",
    "name_el": "Σκληρότριχος Δείκτης Γκριφόν (Korthals)",
    "type": "dog",
    "origin": "France",
    "originCode": "FR",
    "images": [],
    "size": "large",
    "lifespan": "12-15 years",
    "temperament_en": ["Friendly", "Eager to please", "Intelligent", "Loyal", "Versatile"],
    "temperament_el": ["Φιλικός", "Πρόθυμος να ευχαριστήσει", "Έξυπνος", "Πιστός", "Ευέλικτος"],
    "description_en": "The Wirehaired Pointing Griffon, also known as Korthals Griffon, was developed in the Netherlands and France for versatile hunting. They have a distinctive wiry, gray or brown coat and a bearded, expressive face. Griffons are friendly, intelligent, and eager to please. They work closely with their handlers and make devoted family companions. They are known for their stamina and ability to work in tough conditions.",
    "description_el": "Ο Σκληρότριχος Δείκτης Γκριφόν, γνωστός και ως Korthals Griffon, αναπτύχθηκε στην Ολλανδία και τη Γαλλία για ευέλικτο κυνήγι. Έχει χαρακτηριστικό σκληρό, γκρι ή καφέ τρίχωμα και γενειοφόρο, εκφραστικό πρόσωπο. Είναι φιλικοί, έξυπνοι και πρόθυμοι να ευχαριστούν. Εργάζονται στενά με τους χειριστές τους και γίνονται αφοσιωμένοι οικογενειακοί σύντροφοι.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Wirehaired Pointing Griffons need regular exercise and mental stimulation. Their wiry coat requires regular brushing and occasional hand-stripping or clipping. They enjoy swimming, hiking, and field work. They are highly trainable and bond closely with their families. They do not do well when left alone for long periods. Ear cleaning is recommended.",
    "care_el": "Οι Γκριφόν Korthals χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 έως 1,5 ώρες. Το σκληρό τρίχωμά τους απαιτεί τακτικό βούρτσισμα και περιοδικό hand-stripping ή κούρεμα. Απολαμβάνουν κολύμβηση — είναι εξαιρετικοί κολυμβητές — πεζοπορία και εργασία στο πεδίο. Πολύ εκπαιδεύσιμοι και δένονται στενά με τις οικογένειές τους — δεν ανέχονται μοναξιά. Ο καθαρισμός αυτιών συνιστάται. Εξαιρετικοί οικογενειακοί σύντροφοι με ζωηρή, φιλική προσωπικότητα.",
    "health_en": "Wirehaired Pointing Griffons have a typical lifespan of 12–15 years and are generally a healthy, hardy breed. Hip dysplasia is the primary orthopedic concern — OFA screening is recommended. Elbow dysplasia can also occur. Eye conditions should be screened for annually. Hypothyroidism may develop. Epilepsy has been reported in some lines. Ear infections can occur. Bloat (GDV) is a potential risk. The breed benefits from strong breeding practices in both Europe and North America, with many breeders requiring hunting performance tests before breeding. Allergies are uncommon. Responsible breeders screen for hips, elbows, eyes, thyroid, and cardiac function.",
    "health_el": "Οι Γκριφόν Korthals έχουν τυπική διάρκεια ζωής 12–15 χρόνια και είναι γενικά υγιής, ανθεκτική ράτσα. Η δυσπλασία ισχίου είναι η κύρια ορθοπεδική ανησυχία — ο έλεγχος OFA συνιστάται. Δυσπλασία αγκώνα μπορεί επίσης να εμφανιστεί. Οι οφθαλμικές παθήσεις πρέπει να ελέγχονται ετησίως. Υποθυρεοειδισμός πιθανός. Επιληψία σε ορισμένες γραμμές. Λοιμώξεις αυτιών πιθανές. Φούσκωμα (GDV) πιθανός κίνδυνος. Η ράτσα επωφελείται από ισχυρές πρακτικές εκτροφής σε Ευρώπη και Βόρεια Αμερική. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, θυρεοειδή και καρδιά."
  },
  {
    "id": "large-munsterlander",
    "slug": "large-munsterlander",
    "name_en": "Large Münsterländer",
    "name_el": "Μεγάλος Μύνστερλαντερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "large",
    "lifespan": "12-14 years",
    "temperament_en": ["Intelligent", "Energetic", "Friendly", "Trainable", "Devoted"],
    "temperament_el": ["Έξυπνος", "Ενεργητικός", "Φιλικός", "Εκπαιδεύσιμος", "Αφοσιωμένος"],
    "description_en": "The Large Münsterländer is a versatile German pointing breed with a long, dense coat that is black and white. They were developed in the Münster region for hunting and retrieving. They are intelligent, energetic, and friendly dogs that bond closely with their families. They need plenty of exercise and mental stimulation. They are trainable and eager to please, making them suitable for active families and hunters.",
    "description_el": "Ο Μεγάλος Μύνστερλαντερ είναι ευέλικτη γερμανική ράτσα δείκτη με μακρύ, πυκνό μαύρο και λευκό τρίχωμα — μοναδικό χρωματισμό μεταξύ των γερμανικών πόιντερ. Αναπτύχθηκε στην περιοχή Μύνστερ ως η «μαύρη εκδοχή» που αρχικά απορρίφθηκε από τους εκτροφείς GLP. Είναι έξυπνα, ενεργητικά και φιλικά σκυλιά. Εξαιρετικά ευέλικτα στο πεδίο — δείκτης, ανάκτηση και ιχνηλασία σε στεριά και νερό. Δένονται στενά με τις οικογένειές τους και χρειάζονται πολλή άσκηση.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 4, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Large Münsterländers need substantial daily exercise — at least 1.5 hours of vigorous activity. Their long black and white coat requires regular brushing several times per week to prevent mats. They enjoy running, swimming, and field work. They thrive in active homes and become restless or destructive if under-exercised. They are social, trainable dogs that respond well to positive methods. German breeding regulations require performance testing, which ensures the breed maintains working ability.",
    "care_el": "Οι Μεγάλοι Μύνστερλαντερ χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1,5 ώρες έντονης δραστηριότητας. Το μακρύ μαύρο και λευκό τρίχωμά τους απαιτεί τακτικό βούρτσισμα πολλές φορές εβδομαδιαία για αποφυγή κόμπων. Απολαμβάνουν τρέξιμο, κολύμβηση και εργασία στο πεδίο. Γίνονται ανήσυχα ή καταστροφικά αν δεν ασκηθούν αρκετά. Κοινωνικά, εκπαιδεύσιμα σκυλιά που ανταποκρίνονται σε θετικές μεθόδους. Οι γερμανικοί κανονισμοί εκτροφής απαιτούν δοκιμές απόδοσης, εξασφαλίζοντας τη διατήρηση εργασιακής ικανότητας.",
    "health_en": "Large Münsterländers have a typical lifespan of 12–14 years and are generally a healthy breed. Hip dysplasia is the primary orthopedic concern — screening is recommended. Ear infections can occur due to their long, pendant ears. Eye conditions should be monitored. Hypothyroidism has been occasionally reported. Bloat (GDV) is a potential risk. The breed benefits from German breeding regulations that require health testing and performance evaluation. Responsible breeders screen for hips, elbows, eyes, and are mindful of genetic diversity.",
    "health_el": "Οι Μεγάλοι Μύνστερλαντερ έχουν τυπική διάρκεια ζωής 12–14 χρόνια και είναι γενικά υγιής ράτσα. Η δυσπλασία ισχίου είναι η κύρια ορθοπεδική ανησυχία — ο έλεγχος συνιστάται. Λοιμώξεις αυτιών πιθανές λόγω μακριών, κρεμαστών αυτιών. Οι οφθαλμικές παθήσεις πρέπει να παρακολουθούνται. Υποθυρεοειδισμός αναφέρθηκε περιστασιακά. Φούσκωμα (GDV) πιθανός κίνδυνος. Η ράτσα ωφελείται από τους γερμανικούς κανονισμούς εκτροφής που απαιτούν ελέγχους υγείας και αξιολόγηση απόδοσης. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα και μάτια, και είναι προσεκτικοί στη γενετική ποικιλότητα."
  },
  {
    "id": "pudelpointer",
    "slug": "pudelpointer",
    "name_en": "Pudelpointer",
    "name_el": "Πούντελποϊντερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "large",
    "lifespan": "11-14 years",
    "temperament_en": ["Intelligent", "Loyal", "Energetic", "Trainable", "Devoted"],
    "temperament_el": ["Έξυπνος", "Πιστός", "Ενεργητικός", "Εκπαιδεύσιμος", "Αφοσιωμένος"],
    "description_en": "The Pudelpointer was developed in Germany by crossing the Pointer with the Poodle to create a versatile, weather-resistant hunting dog. They have a wiry, dense coat that can be brown or black. They are intelligent, loyal, and energetic dogs that bond closely with their handlers. Pudelpointers are versatile in the field and make devoted family companions when given enough exercise and mental stimulation.",
    "description_el": "Το Pudelpointer αναπτύχθηκε στη Γερμανία διασταυρώνοντας τον Πόιντερ με το Κανίς για να δημιουργηθεί ευέλικτος, ανθεκτικός σκύλος κυνηγιού. Έχει σκληρό, πυκνό τρίχωμα που μπορεί να είναι καφέ ή μαύρο. Είναι έξυπνα, πιστά και ενεργητικά σκυλιά που δένονται στενά με τους χειριστές τους. Είναι ευέλικτα στο πεδίο και αφοσιωμένοι οικογενειακοί σύντροφοι.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 4, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Pudelpointers need substantial daily exercise and mental stimulation. Their wiry coat requires regular brushing and occasional hand-stripping. They enjoy swimming, hiking, and field work. They are highly trainable and thrive with a job to do. They bond closely with their families and do not do well when left alone for long periods. They need an active owner.",
    "care_el": "Τα Pudelpointer χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1,5 ώρες — και νοητική διέγερση. Το σκληρό τρίχωμά τους απαιτεί τακτικό βούρτσισμα και περιοδικό hand-stripping. Απολαμβάνουν κολύμβηση, πεζοπορία και εργασία στο πεδίο. Εξαιρετικά εκπαιδεύσιμα σκυλιά που ευδοκιμούν όταν έχουν δουλειά. Δένονται στενά με τις οικογένειές τους και δεν τα πάνε καλά μόνα τους για πολύ. Χρειάζονται ενεργό ιδιοκτήτη. Θεωρούνται από τους πιο ολοκληρωμένους σκύλους όπλων στον κόσμο.",
    "health_en": "Pudelpointers have a typical lifespan of 11–14 years and are generally a very healthy, hardy breed — benefiting from strict German breeding practices that prioritize working ability and health. Hip dysplasia is the primary concern — screening is recommended. Eye conditions should be monitored. Hypothyroidism has been occasionally reported. Bloat (GDV) is a potential risk. Ear infections may develop. The breed's strict breeding regulations (requiring field testing before breeding) help maintain overall vigor. Responsible breeders screen for hips, elbows, eyes, and thyroid.",
    "health_el": "Τα Pudelpointer έχουν τυπική διάρκεια ζωής 11–14 χρόνια και είναι γενικά πολύ υγιής, ανθεκτική ράτσα — ωφελούνται από αυστηρές γερμανικές πρακτικές εκτροφής που δίνουν προτεραιότητα στην εργασιακή ικανότητα και την υγεία. Η δυσπλασία ισχίου είναι η κύρια ανησυχία — ο έλεγχος συνιστάται. Οι οφθαλμικές παθήσεις πρέπει να παρακολουθούνται. Υποθυρεοειδισμός αναφέρθηκε περιστασιακά. Φούσκωμα (GDV) πιθανός κίνδυνος. Λοιμώξεις αυτιών πιθανές. Οι αυστηροί κανονισμοί εκτροφής που απαιτούν δοκιμές πεδίου βοηθούν στη διατήρηση συνολικής ευρωστίας. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια και θυρεοειδή."
  },
  {
    "id": "small-munsterlander",
    "slug": "small-munsterlander",
    "name_en": "Small Münsterländer",
    "name_el": "Μικρός Μύνστερλαντερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Friendly", "Energetic", "Intelligent", "Trainable", "Devoted"],
    "temperament_el": ["Φιλικός", "Ενεργητικός", "Έξυπνος", "Εκπαιδεύσιμος", "Αφοσιωμένος"],
    "description_en": "The Small Münsterländer is a medium-sized German pointing breed with a long, dense brown and white coat. They were developed for hunting in the Münster region and are versatile, energetic gun dogs. They are friendly, intelligent, and bond closely with their families. They are slightly smaller than the Large Münsterländer but share the same enthusiasm for work and companionship. They need regular exercise and mental stimulation.",
    "description_el": "Ο Μικρός Μύνστερλαντερ είναι γερμανική ράτσα δείκτη μεσαίου μεγέθους με μακρύ, πυκνό καφέ και λευκό τρίχωμα. Αναπτύχθηκε για κυνήγι στην περιοχή Μύνστερ και είναι ευέλικτα, ενεργητικά σκυλιά όπλων. Είναι φιλικά, έξυπνα και δένονται στενά με τις οικογένειές τους. Είναι ελαφρώς μικρότερο από τον Μεγάλο Μύνστερλαντερ αλλά μοιράζονται τον ίδιο ενθουσιασμό.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Small Münsterländers need substantial daily exercise — at least 1 to 1.5 hours of vigorous activity. Their medium-length coat requires regular brushing several times per week. They enjoy running, swimming, and field work. They are exceptionally social dogs that thrive on family involvement and don't do well isolated. Training is rewarding — they are eager to please and highly responsive. Ear cleaning is important. They adapt well to family life when given adequate exercise and companionship.",
    "care_el": "Οι Μικροί Μύνστερλαντερ χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 έως 1,5 ώρες έντονης δραστηριότητας. Το μεσαίου μήκους τρίχωμά τους απαιτεί τακτικό βούρτσισμα πολλές φορές εβδομαδιαία. Απολαμβάνουν τρέξιμο, κολύμβηση και εργασία στο πεδίο. Είναι εξαιρετικά κοινωνικά σκυλιά που ευδοκιμούν με οικογενειακή συμμετοχή και δεν τα πάνε καλά σε απομόνωση. Η εκπαίδευση είναι ανταποδοτική — είναι πρόθυμα να ευχαριστήσουν και πολύ ανταποκρίσιμα. Ο καθαρισμός αυτιών είναι σημαντικός. Προσαρμόζονται καλά στην οικογενειακή ζωή όταν τους παρέχεται επαρκής άσκηση.",
    "health_en": "Small Münsterländers have a typical lifespan of 12–14 years and are generally a healthy breed. Hip dysplasia is the primary concern — screening is recommended. Ear infections can occur due to their pendant ears. Eye conditions should be monitored. Hypothyroidism has been occasionally documented. Bloat (GDV) is a potential risk. The breed maintains good health through German breeding regulations requiring field performance testing. Allergies are uncommon. Responsible breeders screen for hips, elbows, eyes, and thyroid.",
    "health_el": "Οι Μικροί Μύνστερλαντερ έχουν τυπική διάρκεια ζωής 12–14 χρόνια και είναι γενικά υγιής ράτσα. Η δυσπλασία ισχίου είναι η κύρια ανησυχία — ο έλεγχος συνιστάται. Λοιμώξεις αυτιών πιθανές λόγω κρεμαστών αυτιών. Οι οφθαλμικές παθήσεις πρέπει να παρακολουθούνται. Υποθυρεοειδισμός αναφέρθηκε περιστασιακά. Φούσκωμα (GDV) πιθανός κίνδυνος. Η ράτσα διατηρεί καλή υγεία μέσω γερμανικών κανονισμών εκτροφής που απαιτούν δοκιμές απόδοσης πεδίου. Οι αλλεργίες είναι ασυνήθιστες. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια και θυρεοειδή."
  },
  {
    "id": "weimaraner",
    "slug": "weimaraner",
    "name_en": "Weimaraner",
    "name_el": "Βαϊμαράνερ",
    "type": "dog",
    "origin": "Germany",
    "originCode": "DE",
    "images": [],
    "size": "large",
    "lifespan": "10-13 years",
    "temperament_en": ["Energetic", "Loyal", "Intelligent", "Stubborn", "Affectionate"],
    "temperament_el": ["Ενεργητικός", "Πιστός", "Έξυπνος", "Πεισματάρης", "Στοργικός"],
    "description_en": "The Weimaraner is a striking silver-gray gun dog from Germany, originally bred for hunting large game. They are energetic, loyal, and highly intelligent. Weimaraners form very strong bonds with their owners and can suffer from separation anxiety. They need substantial exercise and mental stimulation. They are often reserved with strangers but devoted to their families. Their short, sleek coat is easy to maintain.",
    "description_el": "Ο Βαϊμαράνερ — γνωστός ως «Γκρίζο Φάντασμα» — είναι εντυπωσιακός ασημόγκριζος σκύλος από τη Βαϊμάρη της Γερμανίας, αρχικά εκτρεφόμενος για κυνήγι μεγάλων θηραμάτων όπως ελάφι, αρκούδα και αγριόχοιρος. Ενεργητικοί, βαθιά πιστοί και πολύ έξυπνοι. Δημιουργούν πολύ ισχυρούς δεσμούς με τους ιδιοκτήτες τους — μπορεί να υποφέρουν σοβαρά από άγχος αποχωρισμού. Τα κουτάβια γεννιούνται με γαλανά μάτια. Χρειάζονται σημαντική άσκηση και νοητική διέγερση. Το κοντό, λείο τρίχωμα είναι εύκολο στη συντήρηση.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 3, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Weimaraners need substantial daily exercise—running, hiking, or field work. They are prone to separation anxiety and do best when included in family activities. Their short coat requires minimal grooming. They are intelligent but can be stubborn; consistent, positive training is important. They need an active owner who can provide plenty of exercise and companionship.",
    "care_el": "Οι Βαϊμαράνερ χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1,5 έως 2 ώρες τρεξίματος, πεζοπορίας ή εργασίας στο πεδίο. Το άγχος αποχωρισμού είναι πολύ κοινό — πρέπει να συμπεριλαμβάνονται στις οικογενειακές δραστηριότητες. Το κοντό τρίχωμα απαιτεί ελάχιστη περιποίηση. Είναι έξυπνοι αλλά μπορεί να είναι πεισματάρηδες — η σταθερή, θετική εκπαίδευση είναι σημαντική. Χρειάζονται ενεργό, αφοσιωμένο ιδιοκτήτη που μπορεί να τους παρέχει πολλή άσκηση και συντροφιά. Δεν ταιριάζουν σε καθιστικό τρόπο ζωής.",
    "health_en": "Weimaraners have a typical lifespan of 10–13 years. Bloat (GDV) is the most serious health concern — preventive gastropexy is often recommended. Hip dysplasia is common — OFA screening is essential. Hypothyroidism is relatively common. Spinal dysraphism (a congenital spinal cord defect) is a breed-specific condition. Hypertrophic osteodystrophy (HOD) can affect growing puppies. Eye conditions including distichiasis and entropion may occur. Mast cell tumors and other cancers affect the breed. Von Willebrand's disease has been reported. They can be sensitive to anesthesia. Immune-mediated conditions occur at moderate rates. The breed's popularity has led to variable breeding quality — selecting health-tested parents is crucial. Responsible breeders screen for hips, elbows, eyes, thyroid, and cardiac function.",
    "health_el": "Οι Βαϊμαράνερ έχουν τυπική διάρκεια ζωής 10–13 χρόνια. Το φούσκωμα (GDV) είναι η σοβαρότερη ανησυχία υγείας — η προληπτική γαστροπεξία συχνά συνιστάται. Η δυσπλασία ισχίου είναι κοινή — ο έλεγχος OFA απαραίτητος. Ο υποθυρεοειδισμός είναι σχετικά κοινός. Η νωτιαία δυσραφία είναι συγγενής πάθηση ράτσας. Η HOD μπορεί να επηρεάσει αναπτυσσόμενα κουτάβια. Οφθαλμικές παθήσεις συμπεριλαμβανομένου δυστιχίασης και εντροπίου. Καρκίνοι — mastocytoma και άλλοι. Νόσος von Willebrand. Ευαίσθητοι σε αναισθησία. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, θυρεοειδή και καρδιά."
  },
  {
    "id": "american-water-spaniel",
    "slug": "american-water-spaniel",
    "name_en": "American Water Spaniel",
    "name_el": "Αμερικανικός Υδάτινος Σπάνιελ",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "10-14 years",
    "temperament_en": ["Friendly", "Intelligent", "Energetic", "Trainable", "Devoted"],
    "temperament_el": ["Φιλικός", "Έξυπνος", "Ενεργητικός", "Εκπαιδεύσιμος", "Αφοσιωμένος"],
    "description_en": "The American Water Spaniel was developed in the United States for retrieving waterfowl in the Midwest. They have a curly or wavy brown coat that is water-resistant. They are friendly, intelligent, and energetic dogs that bond closely with their families. They are versatile and can hunt, retrieve, and serve as loyal companions. They are medium-sized and adaptable to various living situations when given enough exercise.",
    "description_el": "Το American Water Spaniel αναπτύχθηκε στο Midwest των ΗΠΑ για ανάκτηση υδρόβιων πτηνών — είναι το κρατικό σκυλί του Ουισκόνσιν. Διαθέτει σγουρό ή κυματιστό καφέ τρίχωμα που είναι αδιάβροχο. Φιλικά, έξυπνα και ενεργητικά σκυλιά. Εξαιρετικά ευέλικτα — κυνήγι, ανάκτηση και κολύμβηση. Σχεδιάστηκαν αρκετά μικρά ώστε να χωρούν σε κανό (αρχικός σχεδιαστικός σκοπός). Μεσαίου μεγέθους και προσαρμοστικά. Σπάνια ράτσα εκτός Midwest, αφοσιωμένοι οικογενειακοί σύντροφοι.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 4, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "American Water Spaniels need regular exercise and enjoy swimming and retrieving games. Their coat requires regular brushing to prevent mats. They are intelligent and need mental stimulation. They bond closely with their families and do best with consistent, positive training. They can be reserved with strangers. Ear cleaning is important due to their pendulous ears.",
    "care_el": "Τα AWS χρειάζονται τακτική καθημερινή άσκηση — τουλάχιστον 1 ώρα — και απολαμβάνουν ιδιαίτερα κολύμβηση και παιχνίδια ανάκτησης. Το σγουρό τρίχωμά τους απαιτεί τακτικό βούρτσισμα για αποφυγή κόμπων. Είναι έξυπνα και χρειάζονται νοητική διέγερση. Δένονται στενά με τις οικογένειές τους και τα πάνε καλύτερα με σταθερή, θετική εκπαίδευση. Μπορεί να είναι επιφυλακτικά με ξένους — η πρώιμη κοινωνικοποίηση είναι σημαντική. Ο καθαρισμός αυτιών είναι σημαντικός λόγω κρεμαστών αυτιών.",
    "health_en": "American Water Spaniels have a typical lifespan of 10–14 years. Hip dysplasia is a concern — screening is recommended. Eye conditions including PRA and cataracts should be screened for. Hypothyroidism may develop. Cardiac conditions have been occasionally reported. Growth hormone-responsive alopecia (a skin condition causing hair loss) has been documented. Allergies and ear infections can occur. The breed's very small population (one of the rarest AKC breeds) means genetic diversity is a critical concern. Degenerative myelopathy has been identified. Responsible breeders screen for hips, eyes, cardiac function, and are mindful of maintaining genetic diversity.",
    "health_el": "Τα AWS έχουν τυπική διάρκεια ζωής 10–14 χρόνια. Η δυσπλασία ισχίου αποτελεί ανησυχία — ο έλεγχος συνιστάται. Οφθαλμικές παθήσεις συμπεριλαμβανομένης PRA και καταρράκτη πρέπει να ελέγχονται. Υποθυρεοειδισμός μπορεί να αναπτυχθεί. Καρδιακές παθήσεις αναφέρθηκαν περιστασιακά. Αλωπεκία ανταποκρινόμενη σε αυξητική ορμόνη τεκμηριώθηκε. Αλλεργίες και λοιμώξεις αυτιών πιθανές. Ο πολύ μικρός πληθυσμός (μία από τις σπανιότερες ράτσες AKC) σημαίνει ότι η γενετική ποικιλότητα είναι κρίσιμη. Εκφυλιστική μυελοπάθεια αναγνωρίστηκε. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, μάτια, καρδιά."
  },
  {
    "id": "boykin-spaniel",
    "slug": "boykin-spaniel",
    "name_en": "Boykin Spaniel",
    "name_el": "Μπόικιν Σπάνιελ",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "14-16 years",
    "temperament_en": ["Friendly", "Energetic", "Eager to please", "Sociable", "Intelligent"],
    "temperament_el": ["Φιλικός", "Ενεργητικός", "Πρόθυμος να ευχαριστήσει", "Κοινωνικός", "Έξυπνος"],
    "description_en": "The Boykin Spaniel is the state dog of South Carolina, developed for hunting turkeys and retrieving waterfowl. They have a rich brown, curly coat and a compact, athletic build. Boykins are friendly, energetic, and eager to please. They are excellent family dogs and get along well with children and other pets. They love water and retrieving. They are highly trainable and thrive on companionship and activity.",
    "description_el": "Το Boykin Spaniel είναι το κρατικό σκυλί της Νότιας Καρολίνας, αναπτυγμένο τον 20ό αιώνα για κυνήγι γαλοπούλων και ανάκτηση υδρόβιων πτηνών. Διαθέτει πλούσιο σοκολατί σγουρό τρίχωμα και συμπαγές, αθλητικό σώμα. Φιλικά, ενεργητικά και πρόθυμα να ευχαριστήσουν. Εξαιρετικά οικογενειακά σκυλιά που τα πάνε καλά με παιδιά και άλλα κατοικίδια. Λατρεύουν το νερό και την ανάκτηση. Πολύ εκπαιδεύσιμα σε κυνήγι, agility και dock diving. Γνωστά ως «ο μικρός καφέ σκύλος» της Νότιας Καρολίνας.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Boykin Spaniels need substantial daily exercise — at least 1 hour of swimming, retrieving, hiking, or active play — and they excel at dock diving, agility, and hunt tests. Their curly/wavy coat requires regular brushing several times per week. They are highly social dogs that thrive on family involvement and can develop separation anxiety. Training is a joy — Boykins are eager to please, food-motivated, and responsive to positive methods. Ear cleaning is important. They need both physical exercise and mental engagement to be happy. They adapt well to various living situations with adequate activity.",
    "care_el": "Τα Boykin χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 ώρα κολύμβησης, ανάκτησης, πεζοπορίας ή ενεργού παιχνιδιού — και διαπρέπουν σε dock diving, agility και δοκιμές κυνηγιού. Το σγουρό/κυματιστό τρίχωμά τους απαιτεί τακτικό βούρτσισμα πολλές φορές εβδομαδιαία. Πολύ κοινωνικά σκυλιά που μπορεί να αναπτύξουν άγχος αποχωρισμού. Η εκπαίδευση είναι χαρά — πρόθυμα, ανταποκρίνονται σε θετικές μεθόδους. Ο καθαρισμός αυτιών σημαντικός. Προσαρμόζονται καλά σε διάφορες συνθήκες ζωής με επαρκή δραστηριότητα.",
    "health_en": "Boykin Spaniels have a typical lifespan of 14–16 years. Hip dysplasia is a concern — screening is recommended. Exercise-induced collapse (EIC) is documented — DNA testing is available and essential. Patellar luxation can occur. Eye conditions including cataracts, PRA, and collie eye anomaly should be screened for. Cardiac conditions including pulmonic stenosis have been reported. Hypothyroidism may develop. Degenerative myelopathy has been identified — DNA testing available. Skin conditions and allergies can occur. The breed's foundation from a small number of dogs means genetic diversity requires attention. Responsible breeders screen for hips, eyes, EIC DNA, cardiac function, and DM DNA.",
    "health_el": "Τα Boykin έχουν τυπική διάρκεια ζωής 14–16 χρόνια. Η δυσπλασία ισχίου αποτελεί ανησυχία — ο έλεγχος συνιστάται. Η κατάρρευση από άσκηση (EIC) τεκμηριώθηκε — DNA τεστ διαθέσιμο και απαραίτητο. Εξάρθρωση επιγονατίδας πιθανή. Οφθαλμικές παθήσεις συμπεριλαμβανομένων καταρράκτη, PRA και ανωμαλίας ματιού κόλεϊ. Καρδιακές παθήσεις αναφέρθηκαν. Εκφυλιστική μυελοπάθεια — DNA τεστ. Η ράτσα ιδρύθηκε από μικρό αριθμό σκύλων, η γενετική ποικιλότητα απαιτεί προσοχή. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, μάτια, EIC DNA, καρδιά και DM DNA."
  },
  {
    "id": "chesapeake-bay-retriever",
    "slug": "chesapeake-bay-retriever",
    "name_en": "Chesapeake Bay Retriever",
    "name_el": "Τσεσαπίκ Μπέι Ρετρίβερ",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "large",
    "lifespan": "10-13 years",
    "temperament_en": ["Intelligent", "Loyal", "Protective", "Energetic", "Independent"],
    "temperament_el": ["Έξυπνος", "Πιστός", "Προστατευτικός", "Ενεργητικός", "Ανεξάρτητος"],
    "description_en": "The Chesapeake Bay Retriever was developed in the United States for retrieving waterfowl in the cold, rough waters of the Chesapeake Bay. They have a distinctive oily, wavy coat that is water-resistant. Chessies are intelligent, loyal, and can be protective of their families. They are more independent and strong-willed than other retrievers. They are excellent swimmers and need regular exercise and mental stimulation.",
    "description_el": "Το Chesapeake Bay Retriever αναπτύχθηκε στις ΗΠΑ για ανάκτηση υδρόβιων πτηνών στα κρύα, τραχιά νερά του κόλπου Chesapeake — είναι το κρατικό σκυλί του Μέριλαντ. Διαθέτει χαρακτηριστικό λαδωμένο, κυματιστό αδιάβροχο τρίχωμα σε αποχρώσεις deadgrass, sedge και σοκολάτα. Πιο ανεξάρτητα, ισχυρά και προστατευτικά από τα υπόλοιπα retriever. Εξαιρετικοί κολυμβητές ακόμα και σε πολύ κρύα νερά. Βαθιά αφοσιωμένα στην οικογένεια αλλά συνεσταλμένα με ξένους.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 3, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Chesapeake Bay Retrievers need regular exercise and love swimming. Their oily coat requires regular brushing but should not be over-bathed. They are intelligent but can be stubborn; consistent, firm training is important. They need early socialization. They are loyal and protective and do best with experienced owners who can provide leadership and activity.",
    "care_el": "Τα Chessies χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 έως 1,5 ώρες — και λατρεύουν ιδιαίτερα την κολύμβηση. Το λαδωμένο τρίχωμά τους απαιτεί τακτικό βούρτσισμα αλλά δεν πρέπει να λούζονται υπερβολικά (αφαιρεί τα φυσικά έλαια). Είναι έξυπνα αλλά μπορεί να είναι πεισματάρικα — η σταθερή, δίκαιη εκπαίδευση είναι σημαντική. Η πρώιμη κοινωνικοποίηση είναι κρίσιμη. Πιστά και προστατευτικά, ταιριάζουν καλύτερα σε έμπειρους ιδιοκτήτες που μπορούν να παρέχουν ηγεσία και δραστηριότητα.",
    "health_en": "Chesapeake Bay Retrievers have a typical lifespan of 10–13 years. Hip and elbow dysplasia are significant concerns — OFA screening is essential. PRA is documented — DNA testing is important. Bloat (GDV) is a serious risk. Exercise-induced collapse (EIC) has been identified — DNA testing available. Degenerative myelopathy (DM) is a concern — DNA testing available. Von Willebrand's disease has been reported. Hypothyroidism can develop. Eye conditions including cataracts and entropion may occur. Cancer is a concern in older dogs. The breed's moderate popularity helps maintain genetic diversity. Responsible breeders screen for hips, elbows, eyes, EIC DNA, DM DNA, and cardiac function.",
    "health_el": "Τα Chessies έχουν τυπική διάρκεια ζωής 10–13 χρόνια. Η δυσπλασία ισχίου και αγκώνα είναι σημαντικές ανησυχίες — ο έλεγχος OFA απαραίτητος. Η PRA τεκμηριώθηκε — DNA τεστ σημαντικό. Φούσκωμα (GDV) σοβαρός κίνδυνος. Κατάρρευση από άσκηση (EIC) αναγνωρίστηκε — DNA τεστ. Εκφυλιστική μυελοπάθεια (DM) — DNA τεστ. Νόσος von Willebrand αναφέρθηκε. Υποθυρεοειδισμός μπορεί να αναπτυχθεί. Οφθαλμικές παθήσεις και καρκίνος ανησυχία σε ηλικιωμένα. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, EIC/DM DNA και καρδιά."
  },
  {
    "id": "clumber-spaniel",
    "slug": "clumber-spaniel",
    "name_en": "Clumber Spaniel",
    "name_el": "Κλάμπερ Σπάνιελ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "10-12 years",
    "temperament_en": ["Calm", "Loyal", "Gentle", "Dignified", "Affectionate"],
    "temperament_el": ["Ήρεμος", "Πιστός", "Ήπιος", "Αξιοπρεπής", "Στοργικός"],
    "description_en": "The Clumber Spaniel is the largest of the spaniel breeds, with a heavy bone structure and a dense, white coat with lemon or orange markings. Bred in England for flushing game, they are calm, loyal, and dignified. They work at a slower, deliberate pace. Clumbers are gentle and affectionate with their families and get along well with children. They can be reserved with strangers and tend to drool.",
    "description_el": "Το Clumber Spaniel είναι το μεγαλύτερο από τα spaniel, με βαριά οστική δομή και πυκνό λευκό τρίχωμα με λεμονί ή πορτοκαλί σημάνσεις. Εκτράφηκε στο Clumber Park της Αγγλίας για ξεχύλισμα θηράματος. Αγαπημένα βρετανικών μοναρχών — του Πρίγκηπα Αλβέρτου και του Εδουάρδου Ζ'. Ήρεμα, πιστά και αξιοπρεπή σκυλιά που εργάζονται με αργό, μεθοδικό ρυθμό. Ήπια και στοργικά με τις οικογένειές τους, τα πάνε καλά με παιδιά. Μπορεί να σταλάζουν. Σπάνια ράτσα εκτός Βρετανίας.",
    "characteristics": { "energy": 2, "grooming": 4, "friendliness": 4, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Clumber Spaniels need moderate exercise—they are not as high-energy as other spaniels. Their dense coat requires regular brushing to prevent mats. They are prone to weight gain, so portion control is important. They can drool, especially after eating or drinking. They are calm in the home and make good companions for less active owners. Ear cleaning is important.",
    "care_el": "Τα Clumber χρειάζονται μέτρια καθημερινή άσκηση — 30 έως 60 λεπτά βόλτες — δεν είναι τόσο ενεργητικά όσο τα υπόλοιπα spaniel. Το πυκνό τρίχωμά τους απαιτεί τακτικό βούρτσισμα για αποφυγή κόμπων. Είναι επιρρεπή σε αύξηση βάρους, γι' αυτό ο αυστηρός έλεγχος μερίδων είναι σημαντικός. Μπορεί να σταλάζουν, ιδίως μετά τα γεύματα ή το νερό. Ήρεμα στο σπίτι και κατάλληλα σύντροφοι για λιγότερο ενεργούς ιδιοκτήτες. Ο καθαρισμός αυτιών είναι σημαντικός. Ευαίσθητα στη ζέστη.",
    "health_en": "Clumber Spaniels have a typical lifespan of 10–12 years. Hip dysplasia is very common — OFA screening is essential. Intervertebral disc disease (IVDD) is a concern due to their long body. Eye conditions including entropion and ectropion are common. They can have breathing difficulties due to their heavy head structure. Hypothyroidism is relatively common. Ear infections are frequent. They are prone to obesity which exacerbates joint issues. Immune-mediated hemolytic anemia (IMHA) has been reported. Pyruvate dehydrogenase phosphatase 1 deficiency (PDP1) is a breed-specific condition — DNA testing is available. The breed's small population means genetic diversity is a concern. Responsible breeders screen for hips, eyes, PDP1 DNA, and thyroid.",
    "health_el": "Τα Clumber έχουν τυπική διάρκεια ζωής 10–12 χρόνια. Η δυσπλασία ισχίου είναι πολύ κοινή — ο έλεγχος OFA απαραίτητος. Η IVDD αποτελεί κίνδυνο λόγω μακρού σώματος. Οφθαλμικές παθήσεις συμπεριλαμβανομένου εντροπίου και εκτροπίου κοινές. Αναπνευστικές δυσκολίες λόγω βαριάς δομής κεφαλής. Υποθυρεοειδισμός σχετικά κοινός. Λοιμώξεις αυτιών συχνές. Η παχυσαρκία επιδεινώνει τα αρθρικά προβλήματα. PDP1 πάθηση ράτσας — DNA τεστ διαθέσιμο. Ο μικρός πληθυσμός σημαίνει γενετική ποικιλότητα ανησυχία. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, μάτια, PDP1 DNA και θυρεοειδή."
  },
  {
    "id": "cocker-spaniel-american",
    "slug": "cocker-spaniel-american",
    "name_en": "Cocker Spaniel (American)",
    "name_el": "Αμερικανικό Κόκερ Σπάνιελ",
    "type": "dog",
    "origin": "United States",
    "originCode": "US",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Gentle", "Friendly", "Playful", "Adaptable", "Devoted"],
    "temperament_el": ["Ήπιος", "Φιλικός", "Παιχνιδιάρης", "Προσαρμοστικός", "Αφοσιωμένος"],
    "description_en": "The American Cocker Spaniel is a small, sturdy spaniel with a beautiful silky coat that comes in many colors. Bred from the English Cocker Spaniel in the United States, they were developed for hunting woodcock. They are gentle, friendly, and playful companions that adapt well to various living situations. They are devoted to their families and get along well with children and other pets. They have a merry, outgoing personality.",
    "description_el": "Το Αμερικανικό Κόκερ Σπάνιελ είναι μικρό, στιβαρό spaniel με όμορφο μεταξωτό τρίχωμα που έρχεται σε πολλά χρώματα. Εκτράφηκε από το Αγγλικό Cocker Spaniel στις Ηνωμένες Πολιτείες, αναπτύχθηκε για κυνήγι woodcock. Είναι ήπιοι, φιλικοί και παιχνιδιάρηδες σύντροφοι που προσαρμόζονται καλά σε διάφορες συνθήκες διαβίωσης. Είναι αφοσιωμένα στις οικογένειές τους.",
    "characteristics": { "energy": 3, "grooming": 5, "friendliness": 5, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "American Cocker Spaniels need regular exercise and enjoy walks and play. Their long, silky coat requires frequent brushing and regular professional grooming to prevent mats. They are prone to ear infections, so ear cleaning is essential. They are generally easy to train and respond well to positive reinforcement. They thrive on companionship and can develop separation anxiety if left alone too much.",
    "care_el": "Τα Αμερικανικά Cocker χρειάζονται μέτρια καθημερινή άσκηση — 45 λεπτά έως 1 ώρα βόλτες και παιχνίδι. Το μακρύ, μεταξωτό τρίχωμά τους απαιτεί καθημερινό βούρτσισμα και επαγγελματική περιποίηση κάθε 6-8 εβδομάδες για αποφυγή κόμπων. Οι λοιμώξεις αυτιών είναι πολύ κοινές, γι' αυτό ο τακτικός καθαρισμός αυτιών είναι απαραίτητος. Γενικά εύκολη εκπαίδευση — ανταποκρίνονται καλά σε θετική ενίσχυση. Ευδοκιμούν με συντροφιά και μπορεί να αναπτύξουν άγχος αποχωρισμού. Ο έλεγχος βάρους είναι σημαντικός.",
    "health_en": "American Cocker Spaniels have a typical lifespan of 12–15 years. Ear infections are extremely common due to their heavy, pendulous ears — routine cleaning is essential. Eye conditions are a major concern including cataracts, glaucoma, PRA, and cherry eye — annual ophthalmologic exams recommended. Hip dysplasia and patellar luxation can occur. Allergies and skin conditions (including seborrhea) are common. Hypothyroidism may develop. AIHA (autoimmune hemolytic anemia) occurs at elevated rates. Liver conditions have been reported. Dilated cardiomyopathy can occur. Epilepsy has been documented. The breed's enormous popularity has led to variable breeding quality — selecting health-tested parents is crucial. Responsible breeders screen for hips, patellae, eyes, thyroid, and cardiac function.",
    "health_el": "Τα Αμερικανικά Cocker έχουν τυπική διάρκεια ζωής 12–15 χρόνια. Λοιμώξεις αυτιών πολύ κοινές. Οφθαλμικές παθήσεις — καταρράκτης, γλαύκωμα, PRA, cherry eye. Δυσπλασία ισχίου, εξάρθρωση επιγονατίδας. Αλλεργίες, σμηγματόρροια. AIHA σε αυξημένα ποσοστά. Επιληψία. Ποικίλη ποιότητα εκτροφής. Οι εκτροφείς ελέγχουν ισχία, επιγονατίδα, μάτια, θυρεοειδή, καρδιά."
  },
  {
    "id": "cocker-spaniel-english",
    "slug": "cocker-spaniel-english",
    "name_en": "Cocker Spaniel (English)",
    "name_el": "Αγγλικό Κόκερ Σπάνιελ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Merry", "Devoted", "Gentle", "Energetic", "Trainable"],
    "temperament_el": ["Χαρούμενος", "Αφοσιωμένος", "Ήπιος", "Ενεργητικός", "Εκπαιδεύσιμος"],
    "description_en": "The English Cocker Spaniel is a merry, devoted breed with a sturdy build and soft, silky coat that comes in many colors. Bred in England for flushing woodcock, they are energetic and love to work. They are gentle with their families and get along well with children. They have a wagging tail and cheerful disposition. They are slightly larger than the American Cocker and have a more working-dog character.",
    "description_el": "Το Αγγλικό Κόκερ Σπάνιελ είναι χαρούμενη, αφοσιωμένη ράτσα με στιβαρή κατασκευή και μαλακό, μεταξωτό τρίχωμα που έρχεται σε πάνω από 30 χρωματικούς συνδυασμούς. Εκτράφηκε στην Αγγλία για ξεχύλισμα woodcock και είναι ενεργητικά σκυλιά που λατρεύουν να εργάζονται. Πιο αθλητικά και εργατικά σε χαρακτήρα από το Αμερικανικό Cocker. Ήπια με τις οικογένειές τους και εξαιρετικά με τα παιδιά. Γνωστά ως «Merry Cocker» για το αιώνιο κούνημα ουράς και τη χαρούμενη διάθεσή τους.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 5, "trainability": 5, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "English Cocker Spaniels need regular exercise and enjoy long walks and play. Their coat requires regular brushing and periodic grooming. They are intelligent and trainable and excel in obedience and field work. Ear cleaning is important due to their pendulous ears. They are social dogs that thrive on family involvement. They can be vocal and may need training to manage barking.",
    "care_el": "Τα Αγγλικά Cocker χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 ώρα μακριές βόλτες και παιχνίδι. Το τρίχωμά τους απαιτεί τακτικό βούρτσισμα και περιοδική επαγγελματική περιποίηση. Είναι πολύ έξυπνα και εκπαιδεύσιμα σκυλιά που διαπρέπουν σε υπακοή και εργασία στο πεδίο. Ο καθαρισμός αυτιών είναι σημαντικός λόγω κρεμαστών αυτιών. Κοινωνικά σκυλιά που ευδοκιμούν με οικογενειακή συμμετοχή. Μπορεί να γαβγίζουν — η εκπαίδευση βοηθά στη διαχείριση.",
    "health_en": "English Cocker Spaniels have a typical lifespan of 12–14 years. Familial nephropathy (FN) is a breed-specific fatal kidney disease — DNA testing is available and essential. PRA (prcd-PRA) is documented — DNA testing available. Hip dysplasia is a concern. Ear infections are very common. Eye conditions including cataracts and glaucoma can occur. Hypothyroidism may develop. AIHA occurs at elevated rates, especially in solid-color dogs. Phosphofructokinase deficiency (PFK) has been identified — DNA testing available. Rage syndrome (sudden aggressive episodes) has been reported primarily in solid-color English Cockers, though it is rare. Responsible breeders screen for FN DNA, PRA DNA, PFK DNA, hips, eyes, and thyroid.",
    "health_el": "Τα Αγγλικά Cocker έχουν τυπική διάρκεια ζωής 12–14 χρόνια. Η οικογενής νεφροπάθεια (FN) είναι θανατηφόρα νεφρική νόσος ράτσας — DNA τεστ απαραίτητο. PRA (prcd) τεκμηριώθηκε — DNA τεστ. Η δυσπλασία ισχίου αποτελεί ανησυχία. Λοιμώξεις αυτιών πολύ κοινές. Οφθαλμικές παθήσεις συμπεριλαμβανομένου καταρράκτη και γλαυκώματος. AIHA σε αυξημένα ποσοστά, ιδίως σε μονόχρωμα σκυλιά. PFK — DNA τεστ. Σύνδρομο rage σπάνιο αλλά τεκμηριωμένο. Οι υπεύθυνοι εκτροφείς ελέγχουν FN, PRA, PFK DNA, ισχία, μάτια και θυρεοειδή."
  },
  {
    "id": "curly-coated-retriever",
    "slug": "curly-coated-retriever",
    "name_en": "Curly-Coated Retriever",
    "name_el": "Σγουρότριχο Ρετρίβερ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "large",
    "lifespan": "10-12 years",
    "temperament_en": ["Confident", "Intelligent", "Independent", "Loyal", "Energetic"],
    "temperament_el": ["Σίγουρος", "Έξυπνος", "Ανεξάρτητος", "Πιστός", "Ενεργητικός"],
    "description_en": "The Curly-Coated Retriever is the oldest of the retriever breeds, with a distinctive tight, curly coat that is black or liver. Bred in England for retrieving from water, they are confident, intelligent, and somewhat independent. They are loyal to their families but can be reserved with strangers. They are energetic and need regular exercise and mental stimulation. Their curly coat is low-shedding but requires regular grooming.",
    "description_el": "Το Curly-Coated Retriever είναι το παλαιότερο retriever, πιθανώς χρονολογούμενο από τον 18ο αιώνα. Διαθέτει χαρακτηριστικό σφιχτό σγουρό τρίχωμα σε μαύρο ή liver που παρέχει φυσική αδιαβροχοποίηση. Σίγουρα, έξυπνα και κάπως ανεξάρτητα — πιο «ώριμα» και συγκρατημένα σε χαρακτήρα από τα υπόλοιπα retriever. Πιστά στις οικογένειές τους αλλά μπορεί να είναι συνεσταλμένα με ξένους. Ενεργητικά και χρειάζονται τακτική άσκηση. Μεταξύ των σπανιότερων ρατσών retriever στον κόσμο.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 3, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Curly-Coated Retrievers need regular exercise and love swimming. Their curly coat requires regular brushing and should be trimmed periodically. They are intelligent but can be independent; patient, consistent training works best. They need early socialization. They are loyal and make good companions for active owners who can provide exercise and mental challenges.",
    "care_el": "Τα Curly χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 ώρα — και λατρεύουν ιδιαίτερα την κολύμβηση. Το σγουρό τρίχωμά τους απαιτεί ιδιαίτερη φροντίδα — μην βουρτσίζετε στεγνό (καταστρέφει τις μπούκλες) — βρέξτε πρώτα και κουρεύετε περιοδικά. Είναι ανεξάρτητα σκυλιά που χρειάζονται υπομονετική, σταθερή εκπαίδευση. Η πρώιμη κοινωνικοποίηση είναι σημαντική. Ταιριάζουν ως σύντροφοι σε ενεργούς, έμπειρους ιδιοκτήτες που μπορούν να τους παρέχουν άσκηση και νοητικές προκλήσεις.",
    "health_en": "Curly-Coated Retrievers have a typical lifespan of 10–12 years. Hip and elbow dysplasia are orthopedic concerns — screening is recommended. Bloat (GDV) is a serious risk in this large, deep-chested breed. Eye conditions including cataracts, entropion, and PRA should be screened for. Glycogen storage disease (GSD IIIa) has been identified — DNA testing is available. Exercise-induced collapse (EIC) has been documented. Cancer, particularly lymphosarcoma, is a significant concern in the breed. Hypothyroidism may develop. Cardiac conditions can occur. The breed's small global population means genetic diversity needs careful management. Responsible breeders screen for hips, elbows, eyes, GSD DNA, EIC DNA, and cardiac function.",
    "health_el": "Τα Curly έχουν τυπική διάρκεια ζωής 10–12 χρόνια. Η δυσπλασία ισχίου και αγκώνα αποτελούν ορθοπεδικές ανησυχίες — ο έλεγχος συνιστάται. Φούσκωμα (GDV) σοβαρός κίνδυνος σε αυτήν τη μεγαλόσωμη, βαθυστήθη ράτσα. Οφθαλμικές παθήσεις συμπεριλαμβανομένης PRA, καταρράκτη και εντροπίου. Νόσος αποθήκευσης γλυκογόνου (GSD IIIa) — DNA τεστ. Κατάρρευση από άσκηση (EIC) τεκμηριώθηκε. Ο καρκίνος, ιδίως λεμφοσάρκωμα, αποτελεί σημαντική ανησυχία. Μικρός παγκόσμιος πληθυσμός — γενετική ποικιλότητα κρίσιμη. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, GSD/EIC DNA και καρδιά."
  },
  {
    "id": "english-springer-spaniel",
    "slug": "english-springer-spaniel",
    "name_en": "English Springer Spaniel",
    "name_el": "Αγγλικό Σπρίνγκερ Σπάνιελ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Friendly", "Energetic", "Intelligent", "Obedient", "Attentive"],
    "temperament_el": ["Φιλικός", "Ενεργητικός", "Έξυπνος", "Πειθήνιος", "Προσεκτικός"],
    "description_en": "The English Springer Spaniel is a medium-sized spaniel bred for flushing and retrieving game. They have a medium-length coat that can be liver and white or black and white. Springers are friendly, energetic, and intelligent. They are one of the most popular gun dogs and excel in field trials, obedience, and as family companions. They have a wagging tail and cheerful, willing nature. They need regular exercise to stay happy.",
    "description_el": "Το Αγγλικό Σπρίνγκερ Σπάνιελ είναι spaniel μεσαίου μεγέθους εκτρεφόμενο για ξεχύλισμα και ανάκτηση θήραματος. Έχει τρίχωμα μέσου μήκους που μπορεί να είναι liver και λευκό ή μαύρο και λευκό. Τα Springers είναι φιλικά, ενεργητικά και έξυπνα. Είναι από τα πιο δημοφιλή σκυλιά όπλων και διαπρέπουν σε δοκιμές πεδίου, υπακοή και ως οικογενειακοί σύντροφοι.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "English Springer Spaniels need substantial daily exercise — at least 1 to 1.5 hours of vigorous activity — and they are happiest with a job to do. Their coat requires regular brushing several times per week and periodic professional trimming. They excel at running, swimming, and field work. They are among the most trainable of all breeds — eager to please and responsive. Ear cleaning is essential. They can develop behavioral issues if under-stimulated. They are wonderful family dogs that thrive on being part of household activities.",
    "care_el": "Τα Springer χρειάζονται σημαντική καθημερινή άσκηση — τουλάχιστον 1 έως 1,5 ώρες έντονης δραστηριότητας — και είναι πιο ευτυχισμένα με δουλειά. Το τρίχωμά τους απαιτεί τακτικό βούρτσισμα πολλές φορές εβδομαδιαία και περιοδικό επαγγελματικό κούρεμα. Είναι μεταξύ των πιο εκπαιδεύσιμων ρατσών — πρόθυμα και ανταποκρίσιμα. Ο καθαρισμός αυτιών είναι απαραίτητος. Μπορεί να αναπτύξουν προβλήματα συμπεριφοράς αν δεν ασκηθούν αρκετά. Θαυμάσια οικογενειακά σκυλιά που ευδοκιμούν ως μέρος των δραστηριοτήτων του νοικοκυριού.",
    "health_en": "English Springer Spaniels have a typical lifespan of 12–14 years. Hip dysplasia is a concern — screening recommended. Phosphofructokinase deficiency (PFK) is a breed-specific enzyme deficiency — DNA testing available and essential. Eye conditions including PRA and retinal dysplasia should be screened for. Ear infections are common. Hypothyroidism can develop. AIHA and immune-mediated thrombocytopenia may occur. Epilepsy has been reported. Rage syndrome (sudden aggression) is rare but documented — responsible breeding selection helps minimize risk. Cancer affects the breed at moderate rates. Skin conditions and allergies can develop. Responsible breeders screen for PFK DNA, hips, elbows, eyes, and thyroid.",
    "health_el": "Τα Springer έχουν τυπική διάρκεια ζωής 12–14 χρόνια. Η δυσπλασία ισχίου αποτελεί ανησυχία — ο έλεγχος συνιστάται. Η ανεπάρκεια φωσφοφρουκτοκινάσης (PFK) είναι πάθηση ράτσας — DNA τεστ διαθέσιμο και απαραίτητο. Οφθαλμικές παθήσεις συμπεριλαμβανομένης PRA και δυσπλασίας αμφιβληστροειδούς. Λοιμώξεις αυτιών κοινές. Υποθυρεοειδισμός. AIHA και θρομβοπενία. Επιληψία αναφέρθηκε. Σύνδρομο rage σπάνιο αλλά τεκμηριωμένο. Καρκίνος σε μέτρια ποσοστά. Αλλεργίες. Οι υπεύθυνοι εκτροφείς ελέγχουν PFK DNA, ισχία, αγκώνα, μάτια και θυρεοειδή."
  },
  {
    "id": "field-spaniel",
    "slug": "field-spaniel",
    "name_en": "Field Spaniel",
    "name_el": "Φιλντ Σπάνιελ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "10-12 years",
    "temperament_en": ["Docile", "Sensitive", "Adaptable", "Loyal", "Gentle"],
    "temperament_el": ["Πειθήνιος", "Ευαίσθητος", "Προσαρμοστικός", "Πιστός", "Ήπιος"],
    "description_en": "The Field Spaniel is a rare spaniel breed with a long, glossy coat that is usually black, liver, or roan. Bred in England for field work, they are docile, sensitive, and adaptable. They are loyal and gentle with their families and can be reserved with strangers. They are calmer than many other spaniels and make good companions for those who can provide moderate exercise and gentle training.",
    "description_el": "Το Field Spaniel είναι σπάνια ράτσα spaniel που σχεδόν εξαφανίστηκε τον 19ο αιώνα λόγω υπερβολικής εκτροφής για μορφολογικές εκθέσεις. Διαθέτει μακρύ, γυαλιστερό τρίχωμα συνήθως σε μαύρο, liver ή roan. Πειθήνια, ευαίσθητα και ήπια σκυλιά — πιο ήρεμα σε χαρακτήρα από πολλά άλλα spaniel. Μεταξύ των σπανιότερων ρατσών παγκοσμίως. Πιστά στις οικογένειές τους και μπορεί να είναι συνεσταλμένα με ξένους. Όμορφοι, αξιοπρεπείς σκύλοι εργασίας.",
    "characteristics": { "energy": 3, "grooming": 4, "friendliness": 4, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Field Spaniels need moderate exercise and enjoy walks and gentle field work. Their long coat requires regular brushing to prevent mats. They are sensitive and respond best to gentle, positive training. They bond closely with their families. Ear cleaning is important. They do well in various living situations when given enough attention and exercise.",
    "care_el": "Τα Field Spaniel χρειάζονται μέτρια καθημερινή άσκηση — 45 λεπτά έως 1 ώρα βόλτες και ήπια εργασία στο πεδίο. Το μακρύ τρίχωμά τους απαιτεί τακτικό βούρτσισμα για αποφυγή κόμπων. Είναι ευαίσθητα σκυλιά που ανταποκρίνονται μόνο σε ήπια, θετική εκπαίδευση. Δένονται στενά με τις οικογένειές τους. Ο καθαρισμός αυτιών είναι σημαντικός. Ηρεμότερα σε χαρακτήρα από πολλά spaniel — καλοί σύντροφοι για ήπιες, υπομονετικές οικογένειες.",
    "health_en": "Field Spaniels have a typical lifespan of 10–12 years. Hip dysplasia is a concern — screening is recommended. Hypothyroidism is relatively common and manageable. Ear infections can occur due to their pendulous ears. Eye conditions including cataracts and PRA should be screened for. Allergies and skin conditions may develop. The breed's extremely small population means maintaining genetic diversity is the most critical long-term health concern — breed clubs work carefully to manage breeding pairings. Cancer is a concern in older dogs. Autoimmune conditions have been occasionally reported. Responsible breeders screen for hips, eyes, thyroid, and are attentive to maintaining genetic health within this rare breed.",
    "health_el": "Τα Field Spaniel έχουν τυπική διάρκεια ζωής 10–12 χρόνια. Η δυσπλασία ισχίου αποτελεί ανησυχία — ο έλεγχος συνιστάται. Ο υποθυρεοειδισμός είναι σχετικά κοινός και διαχειρίσιμος. Λοιμώξεις αυτιών πιθανές λόγω κρεμαστών αυτιών. Οφθαλμικές παθήσεις συμπεριλαμβανομένων καταρράκτη και PRA. Αλλεργίες και δερματικές παθήσεις. Ο εξαιρετικά μικρός παγκόσμιος πληθυσμός σημαίνει ότι η γενετική ποικιλότητα είναι η πιο κρίσιμη μακροπρόθεσμη ανησυχία υγείας. Καρκίνος ανησυχία σε μεγαλύτερα σκυλιά. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, μάτια και θυρεοειδή."
  },
  {
    "id": "flat-coated-retriever",
    "slug": "flat-coated-retriever",
    "name_en": "Flat-Coated Retriever",
    "name_el": "Πλατύτριχο Ρετρίβερ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "large",
    "lifespan": "8-10 years",
    "temperament_en": ["Optimistic", "Friendly", "Energetic", "Devoted", "Playful"],
    "temperament_el": ["Ακτινοβόλος", "Φιλικός", "Ενεργητικός", "Αφοσιωμένος", "Παιχνιδιάρης"],
    "description_en": "The Flat-Coated Retriever is an enthusiastic, friendly retriever with a sleek black or liver coat. Bred in England for retrieving on land and water, they are known for their perpetual puppy-like enthusiasm and wagging tail. They are optimistic, devoted, and get along well with everyone. They are energetic and need plenty of exercise. Unfortunately, they have a higher incidence of cancer than some other breeds.",
    "description_el": "Το Flat-Coated Retriever — γνωστό ως «Peter Pan» των retriever — είναι ενθουσιώδες, φιλικό σκυλί με λείο μαύρο ή liver τρίχωμα. Εκτράφηκε στην Αγγλία για ανάκτηση σε στεριά και νερό. Γνωστά για τον αέναο ενθουσιασμό κουταβιών που διατηρούν μέχρι τα γεράματα. Ακτινοβόλα, αφοσιωμένα και φιλικά με όλους — τα πάνε εξαιρετικά με παιδιά. Δυστυχώς η ράτσα εμφανίζει υψηλότερη επίπτωση καρκίνου, με αποτέλεσμα μικρότερη ζωή (8–10 χρόνια). Παρόλα αυτά πολυαγαπημένα για τη χαρά που φέρνουν στις οικογένειές τους.",
    "characteristics": { "energy": 5, "grooming": 2, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Flat-Coated Retrievers need plenty of daily exercise and mental stimulation. Their flat coat requires minimal grooming—weekly brushing is sufficient. They love swimming and retrieving. They are highly trainable and thrive on positive reinforcement. They retain their playful nature well into adulthood. They do best in active families that can provide lots of exercise and companionship.",
    "care_el": "Τα Flat-Coat χρειάζονται πολλή καθημερινή άσκηση — τουλάχιστον 1,5 ώρες — και νοητική διέγερση. Το λείο τρίχωμά τους απαιτεί ελάχιστη περιποίηση — εβδομαδιαίο βούρτσισμα αρκεί. Λατρεύουν κολύμβηση και ανάκτηση. Πολύ εκπαιδεύσιμα — ανταποκρίνονται σε θετική ενίσχυση. Διατηρούν την παιχνιδιάρικη φύση τους μέχρι τα γεράματα. Ευδοκιμούν σε ενεργές οικογένειες που μπορούν να τους παρέχουν πολλή άσκηση και συντροφιά. Δεν κάνουν για καθιστικές ζωές.",
    "health_en": "Flat-Coated Retrievers have a higher incidence of cancer (especially histiocytic sarcoma) compared to other breeds. They may also be prone to hip dysplasia, elbow dysplasia, and malignant histiocytosis. Responsible breeders screen for genetic conditions. Regular veterinary checkups are important. Despite health concerns, they are joyful, loving dogs.",
    "health_el": "Τα Flat-Coat έχουν μικρότερη τυπική διάρκεια ζωής 8–10 χρόνια, κυρίως λόγω καρκίνου. Ο καρκίνος — ιδίως ιστιοκυτικό σάρκωμα και κακοήθης ιστιοκυτικός — είναι η κύρια ανησυχία της ράτσας και εμφανίζεται σε πολύ υψηλά ποσοστά. Δυσπλασία ισχίου και αγκώνα αποτελούν ορθοπεδικές ανησυχίες. Φούσκωμα (GDV) πιθανός κίνδυνος σε αυτήν τη μεγαλόσωμη ράτσα. Οφθαλμικές παθήσεις πιθανές. Η έρευνα καρκίνου αποτελεί τον πιο σημαντικό στόχο υγείας. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα και μάτια."
  },
  {
    "id": "irish-water-spaniel",
    "slug": "irish-water-spaniel",
    "name_en": "Irish Water Spaniel",
    "name_el": "Ιρλανδικό Υδάτινο Σπάνιελ",
    "type": "dog",
    "origin": "Ireland",
    "originCode": "IE",
    "images": [],
    "size": "large",
    "lifespan": "12-13 years",
    "temperament_en": ["Intelligent", "Active", "Clownish", "Independent", "Loyal"],
    "temperament_el": ["Έξυπνος", "Ενεργητικός", "Κλόουν", "Ανεξάρτητος", "Πιστός"],
    "description_en": "The Irish Water Spaniel is the tallest of the spaniels, with a distinctive curly, liver-colored coat and a rat-tail. Bred in Ireland for retrieving waterfowl, they are intelligent, active, and often clownish. They have a unique appearance and personality. They are loyal to their families but can be reserved with strangers and independent. They love water and need regular exercise and mental stimulation.",
    "description_el": "Το Ιρλανδικό Υδάτινο Σπάνιελ είναι το ψηλότερο από τα spaniel, με χαρακτηριστικό σγουρό, liver τρίχωμα και ουρά αρουραίου. Εκτράφηκε στην Ιρλανδία για ανάκτηση υδρόβιων πτηνών, είναι έξυπνα, ενεργητικά και συχνά κλόουν. Έχουν μοναδική εμφάνιση και προσωπικότητα. Είναι πιστά στις οικογένειές τους αλλά μπορεί να είναι συνεσταλμένα με αγνώστους. Λατρεύουν το νερό.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 3, "trainability": 4, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Irish Water Spaniels need substantial daily exercise — at least 1 to 1.5 hours — and they are natural swimmers that love water. Their dense, curly coat requires thorough brushing several times per week and periodic professional clipping every 6-8 weeks. They are intelligent but independent and have a distinctive sense of humor — training is rewarding but requires patience and a playful approach. They need early, extensive socialization as they can be naturally reserved with strangers. Ear cleaning is important. They are clownish and entertaining companions.",
    "care_el": "Τα Ιρλανδικά Water Spaniel χρειάζονται τακτική άσκηση και λατρεύουν την κολύμβηση. Το σγουρό τρίχωμά τους απαιτεί τακτικό βούρτσισμα και περιοδικό κούρεμα. Είναι έξυπνα αλλά μπορεί να είναι ανεξάρτητα και πεισματάρικα· η υπομονετική, σταθερή εκπαίδευση λειτουργεί καλύτερα. Χρειάζονται πρώιμη κοινωνικοποίηση. Ο καθαρισμός των αυτιών είναι σημαντικός.",
    "health_en": "Irish Water Spaniels have a typical lifespan of 12–13 years. Hip dysplasia is a concern — screening recommended. Hypothyroidism is relatively common. Eye conditions including PRA, cataracts, and distichiasis should be screened for. Ear infections can develop. Drug sensitivity (similar to MDR1) has been reported — discuss anesthesia protocols with veterinarians. Allergies and skin conditions may occur. Bloat (GDV) is a potential risk. Epilepsy has been occasionally reported. The breed's small population means genetic diversity is a concern. Vaccine sensitivity has been noted. Responsible breeders screen for hips, elbows, eyes, thyroid, and are aware of drug sensitivities.",
    "health_el": "Τα IWS έχουν τυπική διάρκεια ζωής 12–13 χρόνια. Η δυσπλασία ισχίου αποτελεί ανησυχία — ο έλεγχος συνιστάται. Ο υποθυρεοειδισμός είναι σχετικά κοινός. Οφθαλμικές παθήσεις συμπεριλαμβανομένης PRA, καταρράκτη και δυστιχίασης. Ευαισθησία σε φάρμακα (παρόμοια με MDR1) αναφέρθηκε — τα πρωτόκολλα αναισθησίας πρέπει να συζητούνται με κτηνίατρο. Αλλεργίες και δερματικές παθήσεις. Φούσκωμα (GDV) πιθανός κίνδυνος. Ο μικρός πληθυσμός σημαίνει γενετική ποικιλότητα ανησυχία. Ευαισθησία σε εμβόλια σημειώθηκε. Οι υπεύθυνοι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια και θυρεοειδή."
  },
  {
    "id": "lagotto-romagnolo",
    "slug": "lagotto-romagnolo",
    "name_en": "Lagotto Romagnolo",
    "name_el": "Λαγκότο Ρομανιόλο",
    "type": "dog",
    "origin": "Italy",
    "originCode": "IT",
    "images": [],
    "size": "medium",
    "lifespan": "15-17 years",
    "temperament_en": ["Loyal", "Loving", "Eager to please", "Intelligent", "Sociable"],
    "temperament_el": ["Πιστός", "Στοργικός", "Πρόθυμος να ευχαριστήσει", "Έξυπνος", "Κοινωνικός"],
    "description_en": "The Lagotto Romagnolo is an Italian water dog originally bred for truffle hunting. They have a dense, curly, woolly coat that is hypoallergenic and does not shed much. They are loyal, loving, and eager to please. They are highly intelligent and need mental stimulation. Lagotti are versatile and excel in truffle hunting, obedience, and as family companions. They have a cheerful, hardworking nature.",
    "description_el": "Το Lagotto Romagnolo είναι ιταλικό υδάτινο σκυλί αρχικά εκτρεφόμενο για κυνήγι τρούφας. Έχει πυκνό, σγουρό, μαλλί τρίχωμα που είναι υποαλλεργικό και δεν αλλάζει πολύ. Είναι πιστά, αγαπημένα και πρόθυμα να ευχαριστούν. Είναι πολύ έξυπνα και χρειάζονται νοητική διέγερση. Τα Lagotti είναι ευέλικτα και διαπρέπουν στο κυνήγι τρούφας, την υπακοή και ως οικογενειακοί σύντροφοι.",
    "characteristics": { "energy": 4, "grooming": 5, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Lagotto Romagnolos need regular exercise and mental stimulation. Their curly coat requires regular brushing and professional clipping every few months to prevent mats. They are highly trainable and enjoy learning new tasks. They bond closely with their families and can develop separation anxiety if left alone too much. They need a job or activity to stay happy.",
    "care_el": "Τα Lagotto χρειάζονται τακτική άσκηση — 1+ ώρες — και σημαντική νοητική διέγερση. Σγουρό τρίχωμα: κούρεμα κάθε λίγους μήνες. Υποαλλεργικό. Πολύ εκπαιδεύσιμα. Δένονται στενά — μπορεί άγχος αποχωρισμού. Χρειάζονται δουλειά — truffle hunting, scent work, agility. Σκάβουν ενστικτωδώς.",
    "health_en": "Lagotto Romagnolos have an impressive lifespan of 15–17 years. Cerebellar ataxia (Lagotto type) is the most important breed-specific condition — a progressive neurological disease causing coordination loss — DNA testing is available and essential. Juvenile epilepsy (benign familial) occurs in puppies but typically resolves by adulthood — DNA testing available. Hip dysplasia is a concern — screening recommended. Lysosomal storage disease has been identified. Eye conditions should be screened for. Hypothyroidism may develop. Ear infections can occur with their curly ear hair. The breed's growing popularity means demand for health-tested puppies is important. Responsible breeders screen for cerebellar ataxia DNA, juvenile epilepsy DNA, hips, elbows, eyes, and patellae.",
    "health_el": "Τα Lagotto έχουν εντυπωσιακή διάρκεια ζωής 15–17 χρόνια. Παρεγκεφαλιδική αταξία (τύπου Lagotto) — DNA τεστ απαραίτητο. Νεανική επιληψία — DNA τεστ, συνήθως υποχωρεί. Δυσπλασία ισχίου. Νόσος λυσοσωματικής αποθήκευσης. Οφθαλμικές παθήσεις. Υποθυρεοειδισμός. Αυξανόμενη δημοτικότητα σημαίνει ζήτηση υγιών κουταβιών. Οι εκτροφείς ελέγχουν αταξία/επιληψία DNA, ισχία, αγκώνα, μάτια, επιγονατίδα."
  },
  {
    "id": "nederlandse-kooikerhondje",
    "slug": "nederlandse-kooikerhondje",
    "name_en": "Nederlandse Kooikerhondje",
    "name_el": "Ολλανδικό Κόικερχοντιε",
    "type": "dog",
    "origin": "Netherlands",
    "originCode": "NL",
    "images": [],
    "size": "small",
    "lifespan": "12-15 years",
    "temperament_en": ["Alert", "Friendly", "Intelligent", "Trainable", "Active"],
    "temperament_el": ["Επαγρύπνος", "Φιλικός", "Έξυπνος", "Εκπαιδεύσιμος", "Ενεργητικός"],
    "description_en": "The Nederlandse Kooikerhondje is a small Dutch spaniel-type breed originally used to lure ducks into traps (kooien). They have a distinctive orange and white coat with feathered ears. They are alert, friendly, and intelligent. Kooikers can be reserved with strangers but are devoted to their families. They are active and need regular exercise. They are trainable but can be sensitive; positive reinforcement works best.",
    "description_el": "Το Nederlandse Kooikerhondje είναι μικρή ολλανδική ράτσα τύπου spaniel αρχικά χρησιμοποιούμενη για να δελεάζει πάπιες σε παγίδες. Έχει χαρακτηριστικό πορτοκαλί και λευκό τρίχωμα με φτερωτά αυτιά. Είναι επαγρύπνων, φιλικά και έξυπνα. Τα Kooikers μπορεί να είναι συνεσταλμένα με αγνώστους αλλά είναι αφοσιωμένα στις οικογένειές τους. Είναι ενεργητικά και χρειάζονται τακτική άσκηση.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 4, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Nederlandse Kooikerhondjes need regular exercise and mental stimulation. Their coat requires regular brushing, especially the feathering. They are intelligent and enjoy learning. They can be sensitive to harsh training; positive methods work best. They bond closely with their families. They may be reserved with strangers, so early socialization is helpful. Ear cleaning is recommended.",
    "care_el": "Τα Kooiker χρειάζονται τακτική άσκηση — 45 λεπτά-1 ώρα. Βούρτσισμα ειδικά φτερά. Έξυπνα — απολαμβάνουν μάθηση. Ευαίσθητα — θετικές μέθοδοι μόνο. Δένονται στενά. Πρώιμη κοινωνικοποίηση σημαντική. Καθαρισμός αυτιών. Ενεργητικά αλλά προσαρμοστικά.",
    "health_en": "Nederlandse Kooikerhondjes have a typical lifespan of 12–15 years. Von Willebrand's disease (Type I) is documented — DNA testing is available and important. Hereditary necrotizing myelopathy (ENM/Kooiker paralysis) is a fatal neurological condition — DNA testing is essential. Patellar luxation can occur. Eye conditions including cataracts should be screened for. Kidney conditions (renal dysplasia) have been reported. Polymyositis has been documented. Epilepsy may occur. The breed was reconstructed from very few dogs after near-extinction in WWII — genetic diversity is carefully managed. Responsible breeders screen for vWD DNA, ENM DNA, patellae, eyes, and hips.",
    "health_el": "Τα Kooiker έχουν τυπική διάρκεια ζωής 12–15 χρόνια. Νόσος von Willebrand (Τύπος I) — DNA τεστ. Κληρονομική νεκρωτική μυελοπάθεια (ENM) — θανατηφόρα — DNA τεστ. Εξάρθρωση επιγονατίδας. Οφθαλμικές παθήσεις. Νεφρική δυσπλασία. Πολυμυοσίτιδα. Ράτσα ανασυστάθηκε από πολύ λίγα σκυλιά. Οι εκτροφείς ελέγχουν vWD/ENM DNA, επιγονατίδα, μάτια, ισχία."
  },
  {
    "id": "nova-scotia-duck-tolling-retriever",
    "slug": "nova-scotia-duck-tolling-retriever",
    "name_en": "Nova Scotia Duck Tolling Retriever",
    "name_el": "Νova Scotia Duck Tolling Retriever",
    "type": "dog",
    "origin": "Canada",
    "originCode": "CA",
    "images": [],
    "size": "medium",
    "lifespan": "12-14 years",
    "temperament_en": ["Intelligent", "Energetic", "Outgoing", "Alert", "Affectionate"],
    "temperament_el": ["Έξυπνος", "Ενεργητικός", "Εξωστρεφής", "Επαγρύπνος", "Στοργικός"],
    "description_en": "The Nova Scotia Duck Tolling Retriever is a medium-sized retriever from Canada, bred to lure (toll) ducks within gun range by playing at the water's edge. They have a red or orange coat and a fox-like appearance. Tollers are intelligent, energetic, and outgoing. They are affectionate with their families and get along well with children. They need plenty of exercise and mental stimulation. They are versatile and excel in many dog sports.",
    "description_el": "Το Nova Scotia Duck Tolling Retriever είναι retriever μεσαίου μεγέθους από τον Καναδά, εκτρεφόμενο για να δελεάζει (toll) πάπιες εντός εύρους όπλων παίζοντας στην άκρη του νερού. Έχει κόκκινο ή πορτοκαλί τρίχωμα και εμφάνιση σαν αλεπού. Τα Tollers είναι έξυπνα, ενεργητικά και εξωστρεφή. Είναι στοργικά με τις οικογένειές τους και τα πάνε καλά με παιδιά. Χρειάζονται πολλή άσκηση και νοητική διέγερση.",
    "characteristics": { "energy": 5, "grooming": 3, "friendliness": 5, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Nova Scotia Duck Tolling Retrievers need plenty of daily exercise and mental stimulation. Their double coat requires regular brushing, especially during shedding. They love swimming and retrieving. They are highly trainable and excel in obedience, agility, and field work. They can be vocal and may bark to get attention. They thrive in active families. Ear cleaning is recommended.",
    "care_el": "Τα Nova Scotia Duck Tolling Retriever χρειάζονται πολλή καθημερινή άσκηση και νοητική διέγερση. Το διπλό τρίχωμά τους απαιτεί τακτικό βούρτσισμα. Λατρεύουν την κολύμβηση και την ανάκτηση. Είναι πολύ εκπαιδεύσιμα και διαπρέπουν στην υπακοή, την ευκινησία και την εργασία στο πεδίο. Μπορεί να γαβγίζουν. Ευδοκιμούν σε ενεργές οικογένειες. Ο καθαρισμός των αυτιών συνιστάται.",
    "health_en": "Nova Scotia Duck Tolling Retrievers have a typical lifespan of 12–14 years. Immune-mediated diseases are the most significant health concern — the breed has elevated rates of immune-mediated rheumatic disease (IMRD), steroid-responsive meningitis-arteritis (SRMA), and Addison's disease. PRA (prcd-PRA) is documented — DNA testing available. Hip dysplasia is a concern — screening recommended. Collie eye anomaly (CEA) has been identified — DNA testing available. Degenerative encephalopathy of Tollers is a breed-specific condition. Hypothyroidism can develop. The breed's founder effect (small gene pool from Nova Scotia) contributes to immune-mediated disease prevalence. Responsible breeders screen for PRA DNA, CEA DNA, hips, elbows, eyes, thyroid, and cardiac function.",
    "health_el": "Τα Tollers έχουν τυπική διάρκεια ζωής 12–14 χρόνια. Ανοσοδιαμεσολαβούμενες νόσοι σημαντικότερη ανησυχία — IMRD, SRMA, νόσος Addison. PRA (prcd) — DNA τεστ. Δυσπλασία ισχίου. CEA — DNA τεστ. Εκφυλιστική εγκεφαλοπάθεια Tollers. Μικρή γονιδιακή δεξαμενή. Οι εκτροφείς ελέγχουν PRA/CEA DNA, ισχία, αγκώνα, μάτια, θυρεοειδή, καρδιά."
  },
  {
    "id": "portuguese-water-dog",
    "slug": "portuguese-water-dog",
    "name_en": "Portuguese Water Dog",
    "name_el": "Πορτογαλικό Υδάτινο Σκυλί",
    "type": "dog",
    "origin": "Portugal",
    "originCode": "PT",
    "images": [],
    "size": "medium",
    "lifespan": "11-13 years",
    "temperament_en": ["Intelligent", "Athletic", "Loyal", "Adventurous", "Trainable"],
    "temperament_el": ["Έξυπνος", "Αθλητικός", "Πιστός", "Τολμηρός", "Εκπαιδεύσιμος"],
    "description_en": "The Portuguese Water Dog was bred in Portugal to work with fishermen, herding fish into nets and retrieving lost gear. They have a curly or wavy coat that is hypoallergenic and comes in black, white, or brown. They are intelligent, athletic, and loyal. They love water and need regular exercise and mental stimulation. They are trainable and bond closely with their families. They became widely known when the Obama family chose one as their White House pet.",
    "description_el": "Το Πορτογαλικό Υδάτινο Σκυλί εκτράφηκε στην Πορτογαλία για να εργάζεται με ψαράδες, να οδηγεί ψάρια σε δίχτυα και να ανακτά χαμένο εξοπλισμό. Έχει σγουρό ή κυματιστό τρίχωμα που είναι υποαλλεργικό και έρχεται σε μαύρο, λευκό ή καφέ. Είναι έξυπνα, αθλητικά και πιστά. Λατρεύουν το νερό και χρειάζονται τακτική άσκηση και νοητική διέγερση. Είναι εκπαιδεύσιμα και δένονται στενά με τις οικογένειές τους.",
    "characteristics": { "energy": 4, "grooming": 4, "friendliness": 4, "trainability": 5, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Portuguese Water Dogs need regular exercise and love swimming. Their curly or wavy coat requires regular brushing and clipping every few months. They are highly trainable and excel in many dog sports. They bond closely with their families and need mental stimulation to prevent boredom. They can be reserved with strangers. Early socialization is recommended.",
    "care_el": "Τα Πορτογαλικά Υδάτινα Σκυλιά χρειάζονται τακτική άσκηση και λατρεύουν την κολύμβηση. Το σγουρό ή κυματιστό τρίχωμά τους απαιτεί τακτικό βούρτσισμα και κούρεμα κάθε λίγους μήνες. Είναι πολύ εκπαιδεύσιμα και διαπρέπουν σε πολλά αθλήματα σκύλων. Δένονται στενά με τις οικογένειές τους και χρειάζονται νοητική διέγερση. Συνιστάται πρώιμη κοινωνικοποίηση.",
    "health_en": "Portuguese Water Dogs have a typical lifespan of 11–13 years. GM1 gangliosidosis is a fatal storage disease — DNA testing is available and essential for all breeding stock. PRA (prcd-PRA) is documented — DNA testing available. Hip dysplasia is a concern — screening recommended. Juvenile dilated cardiomyopathy (JDCM) is a breed-specific fatal heart condition affecting puppies — DNA testing available. Addison's disease occurs at elevated rates. Hypothyroidism may develop. Eye conditions including cataracts should be screened for. Allergies and skin conditions can occur. Ear infections may develop with their curly ears. Responsible breeders screen for GM1 DNA, PRA DNA, JDCM DNA, hips, elbows, eyes, and cardiac function.",
    "health_el": "Τα PWD έχουν τυπική διάρκεια ζωής 11–13 χρόνια. GM1 γαγγλιοσίδωση — θανατηφόρα — DNA τεστ. PRA (prcd) — DNA τεστ. Δυσπλασία ισχίου. Νεανική DCM — DNA τεστ. Νόσος Addison σε αυξημένα ποσοστά. Υποθυρεοειδισμός. Οφθαλμικές παθήσεις. Αλλεργίες. Οι εκτροφείς ελέγχουν GM1/PRA/JDCM DNA, ισχία, αγκώνα, μάτια, καρδιά."
  },
  {
    "id": "sussex-spaniel",
    "slug": "sussex-spaniel",
    "name_en": "Sussex Spaniel",
    "name_el": "Σάσσεξ Σπάνιελ",
    "type": "dog",
    "origin": "England",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "11-14 years",
    "temperament_en": ["Cheerful", "Friendly", "Calm", "Loyal", "Gentle"],
    "temperament_el": ["Χαρούμενος", "Φιλικός", "Ήρεμος", "Πιστός", "Ήπιος"],
    "description_en": "The Sussex Spaniel is a rare spaniel with a long, golden liver coat and a serious expression. Bred in England for flushing game in dense cover, they work at a slow, deliberate pace. They are cheerful, friendly, and calm at home. They are loyal and gentle with their families. They have a distinctive rolling gait and can be stubborn. They need moderate exercise and make good companions for those who prefer a calmer dog.",
    "description_el": "Το Sussex Spaniel είναι σπάνιο spaniel με μακρύ, χρυσό liver τρίχωμα και σοβαρή έκφραση. Εκτράφηκε στην Αγγλία για ξεχύλισμα θήραματος σε πυκνό κάλυμμα, εργάζονται με αργό, σκόπιμο ρυθμό. Είναι χαρούμενα, φιλικά και ήρεμα στο σπίτι. Είναι πιστά και ήπια με τις οικογένειές τους. Έχουν χαρακτηριστικό rolling gait και μπορεί να είναι πεισματάρικα. Χρειάζονται μέτρια άσκηση.",
    "characteristics": { "energy": 2, "grooming": 4, "friendliness": 4, "trainability": 3, "cost_index": 3 },
    "cost_annual_usd": "$1,200-1,800",
    "care_en": "Sussex Spaniels need moderate exercise—short to medium walks are sufficient. Their long coat requires regular brushing to prevent mats. They are calm in the home and can adapt to various living situations. They can be stubborn and may need patient training. They are loyal and devoted to their families. Ear cleaning is important. They are prone to weight gain, so portion control is important.",
    "care_el": "Τα Sussex Spaniel χρειάζονται μέτρια άσκηση—σύντομες έως μέσες βόλτες αρκούν. Το μακρύ τρίχωμά τους απαιτεί τακτικό βούρτσισμα. Είναι ήρεμα στο σπίτι και μπορούν να προσαρμοστούν σε διάφορες συνθήκες. Μπορεί να είναι πεισματάρικα και να χρειάζονται υπομονετική εκπαίδευση. Είναι πιστά και αφοσιωμένα στις οικογένειές τους. Ο καθαρισμός των αυτιών είναι σημαντικός. Είναι επιρρεπή σε αύξηση βάρους.",
    "health_en": "Sussex Spaniels have a typical lifespan of 11–14 years. Hip dysplasia is a significant concern — screening essential. Cardiac conditions including pulmonic stenosis and patent ductus arteriosus have been documented. Intervertebral disc disease (IVDD) is a risk due to their long body. Ear infections are common. Hypothyroidism may develop. Eye conditions including entropion can occur. They are prone to obesity which exacerbates joint and back problems. The breed's extremely small population makes genetic diversity the most critical concern. PDP1 deficiency has been identified. They can be sensitive to heat. Responsible breeders screen for hips, cardiac function, PDP1 DNA, eyes, and thyroid.",
    "health_el": "Τα Sussex έχουν τυπική διάρκεια ζωής 11–14 χρόνια. Δυσπλασία ισχίου σημαντική. Καρδιακές παθήσεις τεκμηριώθηκαν. IVDD κίνδυνος λόγω μακρύ σώματος. Λοιμώξεις αυτιών κοινές. Παχυσαρκία. Πολύ μικρός πληθυσμός — γενετική ποικιλότητα κρίσιμη. PDP1. Ευαίσθητα στη ζέστη. Οι εκτροφείς ελέγχουν ισχία, καρδιά, PDP1 DNA, μάτια, θυρεοειδή."
  },
  {
    "id": "welsh-springer-spaniel",
    "slug": "welsh-springer-spaniel",
    "name_en": "Welsh Springer Spaniel",
    "name_el": "Ουαλικό Σπρίνγκερ Σπάνιελ",
    "type": "dog",
    "origin": "Wales",
    "originCode": "GB",
    "images": [],
    "size": "medium",
    "lifespan": "12-15 years",
    "temperament_en": ["Friendly", "Loyal", "Energetic", "Intelligent", "Devoted"],
    "temperament_el": ["Φιλικός", "Πιστός", "Ενεργητικός", "Έξυπνος", "Αφοσιωμένος"],
    "description_en": "The Welsh Springer Spaniel is a red and white spaniel from Wales, bred for flushing and retrieving game. They are friendly, loyal, and energetic. They are devoted to their families and get along well with children and other dogs. They are intelligent and trainable but can be sensitive. They need regular exercise and mental stimulation. They are slightly smaller and often calmer than the English Springer but share the same enthusiasm for work and play.",
    "description_el": "Το Ουαλικό Σπρίνγκερ Σπάνιελ είναι κόκκινο και λευκό spaniel από την Ουαλία, εκτρεφόμενο για ξεχύλισμα και ανάκτηση θήραματος. Είναι φιλικά, πιστά και ενεργητικά. Είναι αφοσιωμένα στις οικογένειές τους και τα πάνε καλά με παιδιά και άλλα σκυλιά. Είναι έξυπνα και εκπαιδεύσιμα αλλά μπορεί να είναι ευαίσθητα. Χρειάζονται τακτική άσκηση και νοητική διέγερση.",
    "characteristics": { "energy": 4, "grooming": 3, "friendliness": 5, "trainability": 4, "cost_index": 2 },
    "cost_annual_usd": "$800-1,200",
    "care_en": "Welsh Springer Spaniels need regular exercise and enjoy long walks, runs, and field work. Their coat requires regular brushing and periodic trimming. They are intelligent and need mental stimulation. They bond closely with their families and can develop separation anxiety if left alone too much. They respond best to gentle, positive training. Ear cleaning is important. They thrive in active families.",
    "care_el": "Τα Ουαλικά Springer Spaniel χρειάζονται τακτική άσκηση και απολαμβάνουν μακριές βόλτες, τρέξιμο και εργασία στο πεδίο. Το τρίχωμά τους απαιτεί τακτικό βούρτσισμα και περιοδικό κούρεμα. Είναι έξυπνα και χρειάζονται νοητική διέγερση. Δένονται στενά με τις οικογένειές τους. Απαντούν καλύτερα σε ήπια, θετική εκπαίδευση. Ο καθαρισμός των αυτιών είναι σημαντικός. Ευδοκιμούν σε ενεργές οικογένειες.",
    "health_en": "Welsh Springer Spaniels have a typical lifespan of 12–15 years. Hip dysplasia is a concern — screening recommended. Eye conditions are significant: glaucoma is documented and entropion may occur. PRA has been identified — screening advised. Epilepsy has been reported in the breed. Ear infections are common due to pendulous ears. Hypothyroidism may develop. Autoimmune conditions can occur. They are generally a healthy breed with good longevity when well-bred. Responsible breeders screen for hips, elbows, eyes, thyroid, and cardiac function.",
    "health_el": "Τα Welsh Springer έχουν τυπική διάρκεια ζωής 12–15 χρόνια. Δυσπλασία ισχίου. Σοβαρές οφθαλμικές παθήσεις — γλαύκωμα, εντρόπιο, PRA. Επιληψία αναφέρθηκε. Λοιμώξεις αυτιών κοινές. Υποθυρεοειδισμός. Αυτοάνοσες παθήσεις. Γενικά υγιής ράτσα με καλή μακροζωία. Οι εκτροφείς ελέγχουν ισχία, αγκώνα, μάτια, θυρεοειδή, καρδιά."
  }
]
